Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Cache.po
Languages: fr_fr, it_it

source: Alternatively, if it is not critical that changes are immediately visible to the user, you could set a short expiry time on the cache node.
fr_fr: Autre alternative, si ce n'est pas critique que les modifications ne soient pas immédiatement visitble pour l'utilisateur, vous pouvez définir une periode d'expiration courte dans le noeud de JbossCache.
it_it: In alternativa, se non è critico che le modifiche siano immediatamente visibili agli utenti, è possibile impostare un tempo di scadenza breve nel nodo della cache.
