Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Cache.po
Languages: fr_fr, it_it

source: Caching
fr_fr: Mise en cache
it_it: Gestione della cache

source: In almost all enterprise applications, the database is the primary bottleneck, and the least scalable tier of the runtime environment. People from a PHP/Ruby environment will try to tell you that so-called "shared nothing" architectures scale well. While that may be literally true, I don't know of many interesting multi-user applications which can be implemented with no sharing of resources between different nodes of the cluster. What these silly people are really thinking of is a "share nothing except for the database" architecture. Of course, sharing the database is the primary problem with scaling a multi-user application &#8212; so the claim that this architecture is highly scalable is absurd, and tells you a lot about the kind of applications that these folks spend most of their time working on.
fr_fr: Dans presque toutes les applications d'entreprise, la base de données est le premier goulet d'étranglement et le moins scalable tierce-partie de l'environement d'exécution. Les gens venant des environements PHP/Ruby vont essayer de vous dire que les architectures surnommées "ne partage rien" se dimensionnent bien. Et bien c'est peut être littérallement vrai, je ne sait pas combien d'application intéréssantes multi-utilisateurs peuvent être implémentées avec aucun partage de ressources entre les différentes noeuds du cluster. Que pensent vraiment ces personnes loufoques d'une architecture "ne rien partager sauf la base de données". Bien sur, le partage de la base de données est un problème principal quand on dimensionne une application multi utilisateur donc réclammer que cette architecture soit hautement dimensionnable est absurde et dites vous que c'est pas mal de ce type d'application sur les quelles ces gens passent la plus part du temps à travailler dessus.
it_it: In quasi tutte le applicazioni gestionali il database è il principale collo di bottiglia e lo strato meno scalabile dell'ambiente di esecuzione. Chi utilizza ambienti PHP/Ruby cercherà di sostenere che le architetture cosiddette "shared nothing" (nessuna condivisione) hanno una buona scalabilità. Benché questo possa essere letteralmente vero, non si conoscono molte applicazioni multi utente che possano essere implementate senza la condivisione di risorse tra diversi nodi di un cluster. In effetti ciò a cui questi sprovveduti stanno pensando è un'architettura con "nessuna condivisione eccetto il database". Ovviamente condividere il database è il principale problema di scalabilità di una applicazione multi utente, perciò affermare che questa architettura è altamente scalabile è assurdo e ci dice molto sul tipo di applicazioni sul cui sviluppo questi signori spendono la maggior parte del tempo.

source: Almost anything we can possibly do to share the database <emphasis>less often</emphasis> is worth doing.
fr_fr: Le moins que nous puissions rendre faisable et de partager la base de données <emphasis>le moins souvent</emphasis> est d'une grande valeur.
it_it: Quasi tutto ciò che riusciamo a fare per condividere il database <emphasis>meno frequentemente</emphasis> è ben fatto.

source: This calls for a cache. Well, not just one cache. A well designed Seam application will feature a rich, multi-layered caching strategy that impacts every layer of the application:
fr_fr: Cela demande un cache. Et bien , pas juste un seul cache. Une application Seam bien désignée va fonctionner avec une stratégie de cache multi couche riche qui va impacter chaque couche de l'application:
it_it: E questo richiede una cache (memoria tampone). Un'applicazione Seam ben progettata comprenderà una ricca e stratificata strategia di cache che interessi ogni strato dell'applicazione:

source: The database, of course, has its own cache. This is super-important, but can't scale like a cache in the application tier.
fr_fr: La base de données a , bien sûr, son propre cache. C'est super-important, mais ne peut pas être dimensionné comme un cache dans une application tierce.
it_it: Il database, chiaramente, ha la propria cache. Questo è enormemente importante, ma non può scalare come una cache nello strato applicativo.

source: Your ORM solution (Hibernate, or some other JPA implementation) has a second-level cache of data from the database. This is a very powerful capability, but is often misused. In a clustered environment, keeping the data in the cache transactionally consistent across the whole cluster, and with the database, is quite expensive. It makes most sense for data which is shared between many users, and is updated rarely. In traditional stateless architectures, people often try to use the second-level cache for conversational state. This is always bad, and is especially wrong in Seam.
fr_fr: Votre solution ORM (Hibernate ou une autre implémentation JPA) a un cache de second niveau de données de la base de données. C'est une fonctionnalité très puissante mais elle est souvant mal utilisée. Dans une environement en cluster, la conservation des données dans le cache transactionnel consistant au travers du cluster entier et avec la base de données est assez couteux. Cela gagne en plus de sens s'il est partagé entre plusieurs utilisateurs et s'il est mis à jours rarement. Dans les architectures transactionnelles sans état, les gens essaye souvent d'utiliser le cache de second niveau pour les états conversationnel. C'est toujours très mauvais et c'est spécialement faux dans Seam.
it_it: La soluzione ORM scelta (Hibernate o qualche altra implementazione JPA) ha una cache di secondo livello per i dati provenienti dal database. Questa è una caratteristica molto potente, ma spesso male utilizzata. In un ambiente cluster, mantenere i dati in una cache in modo consistente dal punto di vista delle transazioni con l'intero cluster e con il database, è molto dispendioso. Ha più senso per i dati condivisi tra molti utenti e che vengono aggiornati raramente. Nelle architetture tradizionali senza stato, spesso si cerca di usare la cache di secondo livello per conservare lo stato di una conversazione. Questo è sempre un male ed è particolarmente sbagliato in Seam.

source: The Seam conversation context is a cache of conversational state. Components you put into the conversation context can hold and cache state relating to the current user interaction.
fr_fr: Le contexte de conversation est un cache de l'état conversationnel. Les composant que vous mettez dans le contexte conversationnel peuvent conserver et mettre en cache l'état relatif à l'intéraction de l'utilisateur courrant.
it_it: Il contesto Conversation di Seam è una cache per lo stato della conversazione. I componenti che vengono messi nel contesto conversation posso mantenere lo stato relativo all'interazione dell'utente.

source: In particular, the Seam-managed persistence context (or an extended EJB container-managed persistence context associated with a conversation-scoped stateful session bean) acts as a cache of data that has been read in the current conversation. This cache tends to have a pretty high hitrate! Seam optimizes the replication of Seam-managed persistence contexts in a clustered environment, and there is no requirement for transactional consistency with the database (optimistic locking is sufficient) so you don't need to worry too much about the performance implications of this cache, unless you read thousands of objects into a single persistence context.
fr_fr: En particulier, le contexte de persistance géré par Seam (ou un contexte géré par container EJB étendue s'associant avec un bean de session avec état d'étendue conversationnel) agit comme un cache de données qui a été lu pendant la conversation courrante. Ce cache tends à avoir une fréquence très élevé de solicitation! Seam optimise la réplication des contextes de persistance géré par Seam dans un environement en cluster et il n'y a pas de prérequis pour la consistance transactionnelle avec la base de données (un véroullage optimiste est suffisant) donc vous n'avez pas besoin de trop vous inquiéter au sujet de l'implication en terme de performations de ce cache, à moins que ne lisiez des milliers d'objets dans un seul contexte de persistance.
it_it: In particolare, un persistence context gestito da Seam (o un persistence context EJB gestito dal container associato ad uno stateful session bean legato ad una conversazione) agisce con una cache per i dati che sono stati letti nella conversazione attuale. Questa cache tende ad avere una frequenza di utilizzo piuttosto alta! Seam ottimizza la replica dei persistence context gestiti da Seam in un ambiente cluster e non c'è bisogno di curare la consistenza transazionale con il database (il lock ottimistico è sufficiente) perciò non è necessario preoccuparsi troppo per le implicazioni sulle prestazioni di questa cache, a meno che non si leggano migliaia di oggetti con un singolo persistence context.

source: The application can cache non-transactional state in the Seam application context. State kept in the application context is of course not visible to other nodes in the cluster.
fr_fr: L'application peu mettre en cache l'état non-transactionnel dans le contexte d'application de Seam. Convervez l'état dans le contexte applicatif est bien sur invisible pour les autres noeuds dans le cluster.
it_it: L'applicazione può conservare uno stato non transazionale nell'application context di Seam. Lo stato mantenuto nell'applicazione context ovviamente non è visibile agli altri nodi del cluster.

source: The application can cache transactional state using the Seam <literal>cacheProvider</literal> component, which integrates JBossCache, JBoss POJO Cache or EHCache into the Seam environment. This state will be visible to other nodes if your cache supports running in a clustered mode.
fr_fr: L'application peut mettre en cache l'état transactionnel en utilisant le composant <literal>cacheProvider</literal> de Seam qui intègre JBossCache, Jboss POJO Cache ou EHCache dans l'environement de Seam. Cet état sera visible pour les autres noeuds si votre cache est capable de s'exécuter dans un mode en cluster.
it_it: L'applicazione può conservare uno stato transazionale usando il componente <literal>cacheProvider</literal> di Seam, il quale si integra con JBossCache, JBoss POJO Cache oppure EHCache nell'ambiente Seam. Questo stato risulterà visibile agli altri nodi se la cache gestisce il funzionamento in modalità cluster.

source: Finally, Seam lets you cache rendered fragments of a JSF page. Unlike the ORM second-level cache, this cache is not automatically invalidated when data changes, so you need to write application code to perform explicit invalidation, or set appropriate expiration policies.
fr_fr: Enfin, Seam vous permet de mettre en cache les fragments rendus d'une page JSF. A la différence du cache de second niveau de l'ORM, ce cache n'est pas automatiquement invalidé quand les données changent, donc vous avez besoin d'écrire le code de l'application pour réaliser une invalidation explicite ou de mettre des politiques d'expirations appropriées.
it_it: Infine Seam consente di conservare dei frammenti generati di una pagina JSF. A differenza della cache di secondo livello dell'ORM, questa cache non viene automaticamente invalidata quando i dati cambiano, perciò è necessario scrivere il codice applicativo necessario per realizzare una invalidazione esplicita, oppure importare degli opportuni criteri di scadenza.

source: For more information about the second-level cache, you'll need to refer to the documentation of your ORM solution, since this is an extremely complex topic. In this section we'll discuss the use of caching directly, via the <literal>cacheProvider</literal> component, or as the page fragment cache, via the <literal>&lt;s:cache&gt;</literal> control.
fr_fr: Pour plus d'informations à propos du cache de second niveau, vous allez avoir besoin de vous référer à la document de votre solution ORM, car c'est un sujet extrèmement complexe. Dans cette section, nous allons parler de l'utilisation du chache directemnet via le composant <literal>cacheProvider</literal> , ou comme le cache de fragment de page, via le controle <literal>&lt;s:cache&gt;</literal>.
it_it: Per ulteriori informazioni sulla cache di secondo livello è necessario fare riferimento alla documentazione della soluzione ORM scelta poiché si tratta di un argomento estremamente complesso. In questo paragrafo verrà affrontato l'uso diretto della cache, tramite il componente <literal>cacheProvider</literal> o come cache dei frammenti di pagina, tramite il controllo <literal>&lt;s:cache&gt;</literal>.

source: Using Caching in Seam
fr_fr: Utilisation de JBossCache dans Seam
it_it: Usare la cache in Seam

source: The built-in <literal>cacheProvider</literal> component manages an instance of:
fr_fr: Le composant livré <literal>cacheProvider</literal> gère une instance de:
it_it: Il componente <literal>cacheProvider</literal> fornito dal framework gestisce una istanza di:

source: JBoss Cache 1.x (suitable for use in JBoss 4.2.x or later and other containers)
fr_fr: JBoss Cache 1.x (disponible pour utilisation dans JBoss 4.2.x ou suppérieur et pour les autres containeurs)
it_it: JBoss Cache 1.x (adatto per l'uso in JBoss 4.2.x o successivo e altri container)

source: JBoss Cache 2.x (suitable for use in JBoss 5.x and other containers)
fr_fr: JBoss Cache 2.x (disponible pour utilisation dans JBoss 5.x et pour les autres containeurs)
it_it: JBoss Cache 2.x (adatto per l'uso in JBoss 5.x e altri container)

source: JBoss POJO Cache 1.x (suitable for use in JBoss 4.2.x or later and other containers)
fr_fr: JBoss POJO Cache 1.x (disponible pour utilisation dans JBoss 4.2.x et pour les autres containeurs)
it_it: JBoss POJO Cache 1.x (adatto per l'uso in JBoss 4.2.x o successivo e altri container)

source: EHCache (suitable for use in any container)
fr_fr: EHCache (disponible pour une utilisation dans tout containeur)
it_it: EHCache (adatto per l'uso in qualsiasi container)

source: You can safely put any immutable Java object in the cache, and it will be stored in the cache and replicated across the cluster (assuming that replication is supported and enabled). If you want to keep mutable objects in the cache read the documentation of the underling caching project documentation to discover how to notify the cache of changes to the cache.
fr_fr: Vous pouvez de manière sure mettre tout objet Java immuable dans le cache, et il sera stocké dans le cache et répliqué au travers du cluster (en supposant que la réplication est disponible et activée). Si vous voulez conserver les objets mutables dans le cache, vous allez avoir besoin de lire la documentation nécéssaire à l'outil de cache pour comprendre commen lui notifier du changement dans la mise en cache auprès de l'outil du cache.
it_it: E' possibile mettere con sicurezza nella cache qualsiasi oggetto Java immutabile; esso verrà conservato nella cache e replicato nel cluster (assumendo che la replica sia gestita e abilitata). Se si vuole mantenere degli oggetti mutabili nella cache occorre leggere la documentazione della cache sottostante per scoprire come notificare la cache dei cambiamenti negli oggetti.

source: To use <literal>cacheProvider</literal>, you need to include the jars of the cache implementation in your project:
fr_fr: Pour utiliser <literal>cacheProvider</literal>, vous aller devoir inclure les fichiers jars de l'implémentation de ce cache dans votre projet:
it_it: Per usare <literal>cacheProvider</literal> è necessario includere nel progetto i jar dell'implementazione della cache:

source: If you are using JBoss Cache in containers other than JBoss Application Server, look at the JBoss Cache <ulink url="http://wiki.jboss.org/wiki/JBossCache">wiki</ulink> page for more dependencies.
fr_fr: Si vous utilisez JBoss Cache dans un containeur autre que le JBoss Application Server, allez voir la page sur JBoss Cache <ulink url="http://wiki.jboss.org/wiki/JBossCache">wiki</ulink> pour les dépendances.
it_it: Se si sta usando JBoss Cache in un container diverso da JBoss Application Server, verificare sul <ulink url="http://wiki.jboss.org/wiki/JBossCache">wiki</ulink> di JBoss Cache per le ulteriori dipendenze.

source: For an EAR depoyment of Seam, we recommend that the cache jars and configuration go directly into the EAR.
fr_fr: Pour un déploiement EAR de Seam, nous vous recommandaons que les fichiers jars de la mise en cache et la configuration soient directement mis dans l'EAR.
it_it: Se l'applicazione Seam viene assemblata in un EAR si raccomanda di inserire direttamente nell'EAR la configurazione e i jar della cache.

source: You'll also need to provide a configuration file for JBossCache. Place <literal>treecache.xml</literal> with an appropriate cache configuration into the classpath (e.g. the ejb jar or <literal>WEB-INF/classes</literal>). JBossCache has many scary and confusing configuration settings, so we won't discuss them here. Please refer to the JBossCache documentation for more information.
fr_fr: Vous allez avoir aussi besoinde fournir un fichier de configuration pour JBossCache. Placez <literal>treecache.xml</literal> avec une configuration de la mise en cache approprié dans le classpath (par exemple le fichier jar ejb ou <literal>WEB-INF/classes</literal>). JBossCache a de nombreuses horreurs et des réglages de configurations confus, donc nous n'allons pas en parler ici. Merci de vous référer à la document de JBossCache pour plus d'information.
it_it: Sarà inoltre necessario fornire un file di configurazione per JBossCache. Posizionare <literal>treecache.xml</literal> con un'opportuna configurazione di cache nel classpath (ad esempio nel jar ejb oppure in <literal>WEB-INF/classes</literal>). JBossCache ha molte impostazioni ostiche e terribili perciò non verranno discusse qui. Per ulteriori informazioni fare riferimento alla documentazione di JBossCache.

source: You can find a sample <literal>treecache.xml</literal> in <literal>examples/blog/resources/treecache.xml</literal>.
fr_fr: Vous trouverez un exemple de <literal>treecache.xml</literal> dans <literal>examples/blog/resources/treecache.xml</literal>.
it_it: E' possibile trovare un <literal>treecache.xml</literal> di esempio in <literal>examples/blog/resources/treecache.xml</literal>.

source: EHCache will run in it's default configuration without a configuration file
fr_fr: EHCache sera exécuté dans sa configuration par défaut sans fichier de configuration
it_it: EHCache senza un file di configurazione funzionerà nella sua configurazione di default.

source: To alter the configuration file in use, configure your cache in <literal>components.xml</literal>:
fr_fr: Pour modifier le fichier de configuration en cours d'utilisation, configurez votre cache dans <literal>components.xml</literal>:
it_it: Per modificare il file di configurazione in uso, configurare la cache in <literal>components.xml</literal>:

source: Now you can inject the cache into any Seam component:
fr_fr: Maintenant, vous pouvez injecter votre cache dans tout composant de Seam:
it_it: A questo punto è possibile iniettare la cache in qualsiasi componente Seam:

source: If you want to have multiple cache configurations in your application, use <literal>components.xml</literal> to configure multiple cache providers:
fr_fr: Si vous voulez avoir de multplies configurations de mises en cache dans votre application, utilisez <literal>components.xml</literal> pour configurer vos différents fournisseur de mise en cache:
it_it: Se nell'applicazione si vogliono avere più configurazioni della cache basta usare <literal>components.xml</literal> per configurare più componenti <literal>cacheProvider</literal>:

source: Page fragment caching
fr_fr: La mise en cache de fragment de page
it_it: Cache dei frammenti di pagina

source: The most interesting use of caching in Seam is the <literal>&lt;s:cache&gt;</literal> tag, Seam's solution to the problem of page fragment caching in JSF. <literal>&lt;s:cache&gt;</literal> uses <literal>pojoCache</literal> internally, so you need to follow the steps listed above before you can use it. (Put the jars in the EAR, wade through the scary configuration options, etc.)
fr_fr: L'utlisation la plus intéressante de JBossCache est le tag <literal>&lt;s:cache&gt;</literal> , la solution de Seam pour le problème de mettre en cache les fragments de pages.<literal>&lt;s:cache&gt;</literal> utilise <literal>pojoCache</literal> en interne, donc nous avez besoin de suivre les étapes listées ci dessous avant de pouvoir l'utiliser. (Mettez les jars dans le EAR, barboter dans les horribles options de configurations , etc.)
it_it: L'uso più interessante della cache in Seam è la tag <literal>&lt;s:cache&gt;</literal>, che è la soluzione offerta da Seam per il problema di conservare in cache frammenti di pagine JSF. Internamente <literal>&lt;s:cache&gt;</literal> usa <literal>pojoCache</literal>, perciò è necessario seguire i passi elencati in precedenza prima di poterla usare (mettere i jar nell'EAR, sistemare le terribili opzioni di configurazione, ecc).

source: <literal>&lt;s:cache&gt;</literal> is used for caching some rendered content which changes rarely. For example, the welcome page of our blog displays the recent blog entries:
fr_fr: <literal>&lt;s:cache&gt;</literal> est utilisé pour mettre en cache quelques contenues rendues rarement. par exemple, la page bienvenue de votre blog qui affiche les entrées récentes du blog:
it_it: <literal>&lt;s:cache&gt;</literal> viene usata per conservare quei contenuti generati che cambiano raramente. Ad esempio la pagina di benvenuto del nostro blog mostra le voci del blog più recenti:

source: The <literal>key</literal> let's you have multiple cached versions of each page fragment. In this case, there is one cached version per blog. The <literal>region</literal> determines the cache or region node that all version will be stored in. Different nodes may have different expiry policies. (That's the stuff you set up using the aforementioned scary configuration options.)
fr_fr: La <literal>key</literal> permet d'avoir de multiples versions en cache de chaque fragment de page. Dans ce cas, il n'y a qu'une version mise en cache par blog. La <literal>region</literal> détermine le cache ou le noeud local pour toutes les versions qui seront à stocker. Les noeuds différents peuvent avoir des politiques d'expirations différentes. (C'est du boulot que vous configuriez tout en utilisant les horribles options de configurations susmentionnées.)
it_it: La chiave (<literal>key</literal>) consente di avere più versioni in cache di ogni frammento di pagina. In questo caso c'è una versione in cache per ogni blog. La regione (<literal>region</literal>) determina la cache o il nodo region in cui tutte le versioni verranno conservate. Diversi nodi possono avere diverse regole di scadenza (queste sono le cose che si impostano con le summenzionate terribili opzioni di configurazione).

source: Of course, the big problem with <literal>&lt;s:cache&gt;</literal> is that it is too stupid to know when the underlying data changes (for example, when the blogger posts a new entry). So you need to evict the cached fragment manually:
fr_fr: Bien sur, le gros problème avec <literal>&lt;s:cache&gt;</literal> est qu'il est trop stupide pour connaitre quand les données sousjacentes changent (par exemple, quand les billets d'un bloggeur ont une nouvelle entrée). Donc vous avez besoin de virer les fragment en cache manuellement:
it_it: Ovviamente il grosso problema di <literal>&lt;s:cache&gt;</literal> è che è troppo semplice sapere quando i dati contenuti cambiano (ad esempio quando il blogger pubblica uno nuovo contenuto). Così è necessario eliminare i frammento in cache manualmente:
