Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Concepts.po
Languages: fr_fr, it_it, ja_jp

source: By default, Seam will do a priority search of all contexts, using the name of the property or instance variable that is being injected. You may wish to specify the context variable name explicitly, using, for example, <literal>@In("currentUser")</literal>.
fr_fr: Par défaut, Seam va donner une priorité de recherche dans tous les contextes en utilisant le nom de la propriété ou de la variable d’instance qui a été injectée. Vous devriez vouloir spécifier le nom de la variable de contexte explicitement, en utilisant, par exemple, <literal>@In("currentUser")</literal>.
it_it: Di default Seam esegue una ricerca prioritaria di tutti i contesti, usando il nome della proprietà o variabile d'istanza che viene iniettata. Si può specificare esplicitamente il nome della varibile di contesto, usando, per esempio, <literal>@In("currentUser")</literal>.
ja_jp: デフォルトでは、 Seam はプロパティ名あるいはインジェクトされたインスタンス変数名を使用して、 すべてのコンテキストの優先順位検索を行います。 例えば、 <literal>@In("currentUser")</literal>を使用することで明示的にコンテキスト変数を指定することもできます。

source: If you want Seam to create an instance of the component when there is no existing component instance bound to the named context variable, you should specify <literal>@In(create=true)</literal>. If the value is optional (it can be null), specify <literal>@In(required=false)</literal>.
fr_fr: Si vous voulez que Seam puisse créer une instance du composant quand il n’y a pas d’instance de composant existante reliée à une variable de contexte nommée, vous pouvez spécifier <literal>@In(create=true)</literal>. Si la valeur est optionnel (elle peut être null) spécifiez <literal>@In(required=false)</literal>.
it_it: Se si vuole che Seam crei un'istanza del componente quando non esiste un'istanza di componente associata alla variabile di contesto, occorre specificare <literal>@In(create=true)</literal>. Se il valore è opzionale (può essere null), specificare <literal>@In(required=false)</literal>.
ja_jp: 指定されたコンテキスト変数と関連した既存のコンポーネントインスタンスが存在しないときに、 Seam にコンポーネントのインスタンスの生成を望むならば、 <literal>@In(create=true)</literal> を指定する必要があります。 値がオプションで (null でも可能) であれば、<literal>@In(required=false)</literal> を指定してください。

source: For some components, it can be repetitive to have to specify <literal>@In(create=true)</literal> everywhere they are used. In such cases, you can annotate the component <literal>@AutoCreate</literal>, and then it will always be created, whenever needed, even without the explicit use of <literal>create=true</literal>.
fr_fr: Pour quelques composants, il peut être répétitif d’avoir à spécifier <literal>@In(create=true)</literal> partout où ils sont utilisés . Dans ce genre de cas, vous pouvez annoter le composant <literal>@AutoCreate</literal>, et alors il va toujours être créé, n’important quand, même sans l’utilisation explicite de <literal>create=true</literal>.
it_it: Per alcuni componenti può essere ripetitivo dove specificare <literal>@In(create=true)</literal> ogni volta che sono usati. In questi casi si può annotare il componente con <literal>@AutoCreate</literal>, e quindi questo verrà creato, quando necessario, senza dover escplicitare <literal>create=true</literal>.
ja_jp: いくつかのコンポーネントでは、 それらが使用されるところではどこでも繰り返し <literal>@In(create=true)</literal> を指定する必要があるかもしれません。 このような場合、 コンポーネントに <literal>@AutoCreate</literal> アノテーションを付けることが可能で、 <literal>create=true</literal> を明示的に使用しなくても、 必要なとき常に作成されるようになります。

source: You can even inject the value of an expression:
fr_fr: Vous pouvez même injecter la valeur d’une expression :
it_it: Si può anche iniettare il valore di un'espressione:
ja_jp: 式の値をインジェクトすることも可能です。

source: Injected values are disinjected (i.e., set to <literal>null</literal>) immediately after method completion and outjection.
fr_fr: Les valeurs injectées sont désalouées (autrement dit, définie à <literal>null</literal>) immédiatement après la réalisation de la méthode et sont extraction.
it_it: I valori iniettati sono disiniettati (cioè impostati a <literal>null</literal>) immediatamente dopo il completamento del metodo e dell'outjection.

source: (There is much more information about component lifecycle and injection in the next chapter.)
fr_fr: (Il y a beaucoup plus d'information sur le cicle de vie d'un composant et l'injection dans le chapitre suivant).
it_it: (Maggiori informazioni sul ciclo di vita dei componenti e su injection nel prossimo capitolo.)
ja_jp: (コンポーネントライフサイクルとインジェクションについては次章により多くの情報があります。)

source: The <literal>@Out</literal> annotation specifies that an attribute should be outjected, either from an instance variable:
fr_fr: L'annotation <literal>@Out</literal> indique qu'un attribue devrait être extradé, tout comme une variable d'instance:
it_it: L'annotazione <literal>@Out</literal> specifica che occorre eseguire l'outjection di un attributo, oppure da una variabile d'istanza:
ja_jp: <literal>@Out</literal>アノテーションは、属性がインスタンス変数からもアウトジェクトされるべきことを指定します。

source: or from a getter method:
fr_fr: ou comme une méthode assesseur:
it_it: o dal metodo getter:
ja_jp: あるいは getter メソッドからアウトジェクトされます。

source: An attribute may be both injected and outjected:
fr_fr: Un attribut peut être à la fois injecté et extradé:
it_it: Di un attributo si può fare sia l'injection sia l'outjection:
ja_jp: 属性値はインジェクトされることもアウトジェクトされることも可能です。

source: <para>or:</para>
fr_fr: <para>ou:</para>
it_it: <para>o:</para>
ja_jp: <para>または、</para>

source: Lifecycle methods
fr_fr: Les méthode du cycle de vie
it_it: Metodi del ciclo di vita
ja_jp: ライフサイクルメソッド

source: Session bean and entity bean Seam components support all the usual EJB 3.0 lifecycle callback (<literal>@PostConstruct</literal>, <literal>@PreDestroy</literal>, etc). But Seam also supports the use of any of these callbacks with JavaBean components. However, since these annotations are not available in a J2EE environment, Seam defines two additional component lifecycle callbacks, equivalent to <literal>@PostConstruct</literal> and <literal>@PreDestroy</literal>.
fr_fr: Le bean de session et les composants Seam de bean entité supportent tous les rappels du cycle de vie EJB3.0 usuel (<literal>@PostConstruct</literal>, <literal>@PreDestroy</literal>, etc). Mais Seam étend tous ces rappels aux composant JavaBean. Cependant tant que ces annotation ne sont pas disponible dans un environement J2EE, Seam défini deux composants additionnel pour le rappel dans le cycle de vie, équivalent à <literal>@PostConstruct</literal> et à <literal>@PreDestroy</literal>.
it_it: I componenti di Seam session ed entity bean supportano tutte le chiamate del ciclo di vita EJB3.0 (<literal>@PostConstruct</literal>, <literal>@PreDestroy</literal>, ecc). Ma Seam supporta anche l'uso di queste chiamate con i componenti JavaBean. Comunque, poiché queste annotazioni non sono disponibile in un ambiente J2EE, Seam definisce due chiamate aggiuntive al ciclo di vita del componente, equivalenti a <literal>@PostConstruct</literal> e <literal>@PreDestroy</literal>.
ja_jp: セッション Bean とエンティティ Bean Seam コンポーネントは通常の EJB 3.0 のライフサイクルのコールバック (<literal>@PostConstruct</literal>、<literal>@PreDestroy</literal> など) のすべてをサポートしています。 しかも、Seam は JavaBean コンポーネント でのこれらコールバックの使用もサポートしています。 しかし、これらのアノテーションは J2EE 環境では有効とならないため、Seam は <literal>@PostConstruct</literal> と <literal>@PreDestroy</literal> と等価な 2 つの追加コンポーネントライフサイクルコールバックを定義しています。

source: The <literal>@Create</literal> method is called after Seam instantiates a component. Components may define only one <literal>@Create</literal> method.
fr_fr: La méthode <literal>@Create</literal> est appelée après que Seam instancie un composant. Les composants ne peuvent définir seulement qu'une seule méthode <literal>@Create</literal>.
it_it: Il metodo <literal>@Create</literal> viene chiamato dopo che Seam istanzia un componente. I componenti possono definire solo un metodo <literal>@Create</literal>.
ja_jp: <literal>@Create</literal> メソッドは Seam がコンポーネントをインスタンス化した後に呼ばれます。 コンポーネントは 1 つの <literal>@Create</literal >メソッドのみ定義可能です。

source: The <literal>@Destroy</literal> method is called when the context that the Seam component is bound to ends. Components may define only one <literal>@Destroy</literal> method.
fr_fr: La méthode <literal>@Destroy</literal> est appelé quand le contexte qui lie le composant de Seam se termine. Les composants ne peuvent définir qu'une seule méthode <literal>@Destroy</literal>.
it_it: Il metodo <literal>@Destroy</literal> viene chiamato quando termina il contesto a cui è legato il componente Seam. I componenti possono definire solo un metodo <literal>@Destroy</literal>.
ja_jp: <literal>@Destroy</literal> メソッドは Seam コンポーネントがバインドするコンテキストが終了するときに呼ばれます。 コンポーネントは 1 つの <literal>@Destroy</literal> メソッドのみ定義可能です。

source: In addition, stateful session bean components <emphasis>must</emphasis> define a method with no parameters annotated <literal>@Remove</literal>. This method is called by Seam when the context ends.
fr_fr: De plus, les composants bean avec état <emphasis>doivent</emphasis> définir une méthode sans aucun paramètre annotée <literal>@Remove</literal>. Cette méthode est appelé par Seam quand le contexte se termine.
it_it: In aggiunta, i componenti bean stateful session <emphasis>devono</emphasis> definire un metodo senza paramentri annotato con <literal>@Remove</literal>. Questo metodo viene chiamato da Seam quando termina il contesto.
ja_jp: さらに、ステートフルセッション Bean コンポーネントはパラメータ無しの<literal>@Remove</literal>を付けることが<emphasis>必須</emphasis> です。このメソッドはコンテキストが終了するときに Seam により呼ばれます。

source: Finally, a related annotation is the <literal>@Startup</literal> annotation, which may be applied to any application or session scoped component. The <literal>@Startup</literal> annotation tells Seam to instantiate the component immediately, when the context begins, instead of waiting until it is first referenced by a client. It is possible to control the order of instantiation of startup components by specifying <literal>@Startup(depends={....})</literal>.
fr_fr: Finalement, une annotation liée est l’annotation <literal>@Startup</literal> qui peut être appliquée à toutes l’application ou un composant d’étendue session. L’annotation <literal>@Startup</literal> indique à Seam d’instancier le composant immédiatement, quand le contexte commence, au lieu d’attendre avant son premier référencement par un client. Il est possible de controler l’ordre d’instanciation du démarrage des composants en spécifiant <literal>@Startup(depends={....})</literal>.
it_it: Infine, un'annotazione collegata è l'annotazione <literal>@Startup</literal>, che può essere applicata ad ogni componente con scope applicazione o sessione. L'annotazione <literal>@Startup</literal> dice a Seam di istanziare immediatamente il componente, quand inizia il contesto, invece di aspettare che venga referenziato per primo dal client. E' possibile controllare l'ordine di istanziamento dei componenti startup specificando <literal>@Startup(depends={....})</literal>.
ja_jp: 最後に、関連するアノテーションは <literal>@Startup</literal> アノテーションです。 それはアプリケーションやセッションスコープコンポーネントで利用可能です。 <literal>@Startup</literal> アノテーションは、 コンテキストが開始されたときにクライアントによる初めての参照を待つのではなく、 Seam に即座にコンポーネントをインスタンス化させさせます。 <literal>@Startup(depends={....})</literal> を指定することで、 スタートアップコンポーネントのインスタンス化する順序の制御が可能です。

source: Conditional installation
fr_fr: Installation conditionelle
it_it: Installazione condizionale
ja_jp: 条件付きインストール

source: The <literal>@Install</literal> annotation lets you control conditional installation of components that are required in some deployment scenarios and not in others. This is useful if:
fr_fr: L'annotation <literal>@Install</literal> vous permet de contrôler l’installation conditionnelle du composant qui sont requis dans certains scénarios de déploiement et pas dans d’autres. C'est utile si :
it_it: L'annotazione <literal>@Install</literal> consente di controllare l'installazione condizionale di componenti che sono richiesti in alcuni scenari di deploy e non i altri. Questa è utile se:
ja_jp: <literal>@Install</literal> アノテーションは、 特定のデプロイメントシナリオでは必須で別の場合はそうでないようなコンポーネントの条件付インストレーションを可能にします。 これは以下の場合に便利です。

source: You want to mock out some infrastructural component in tests.
fr_fr: Vous voulez singer quelques composants d’infrastructure dans des tests.
it_it: Si vogliono costruire dei mock per qualche componente infrastrutturale da testare.
ja_jp: テストで特定のインフラストラクチャのコンポーネントをモックとしたい。

source: You want change the implementation of a component in certain deployment scenarios.
fr_fr: Vous voulez modifier l’implémentation d’un composant dans certains scénarios de déploiement.
it_it: Si vuole cambiare l'implementazione di un componente in certi scenari di deploy.
ja_jp: 特定のデプロイメントシナリオでコンポーネント実装を変更したい。

source: You want to install some components only if their dependencies are available (useful for framework authors).
fr_fr: Vous voulez installer quelques composants seulement si leurs dépendances sont disponibles (utile pour les auteurs des serveur d’applications).
it_it: Si vogliono installare alcuni componenti solo se le loro dipendenze sono disponibili (utile per gli autori di framework).
ja_jp: 依存性が有効な場合だけに特定のコンポーネントをインストールしたい (フレームワークの作者に便利)。

source: <literal>@Install</literal> works by letting you specify <emphasis>precedence</emphasis> and <emphasis>dependencies</emphasis>.
fr_fr: <literal>@Install</literal> fonctionne en vous laissant spécifier la <emphasis>précédence</emphasis> et les <emphasis>dépendances</emphasis>.
it_it: <literal>@Install</literal> funziona consentendo di specificare <emphasis>precedence</emphasis> e <emphasis>dependencies</emphasis>.
ja_jp: <literal>@Install</literal> は <emphasis>優先順位</emphasis> と <emphasis>依存性</emphasis> を指定することで動作します。

source: The precedence of a component is a number that Seam uses to decide which component to install when there are multiple classes with the same component name in the classpath. Seam will choose the component with the higher precendence. There are some predefined precedence values (in ascending order):
fr_fr: La précédence d’un composant est un numéro que Seam utilise pour décider quel composant est à installer quand il a plusieurs classes avec le même nom de composant dans le classpath. Seam va choisir le composant avec la précédence la plus haute. Il y a quelques valeurs de précédences prédéfinie (dans l’ordre ascendant) :
it_it: La precedenza di un componente è un numero che Seam usa per decidere quale componente installare quando ci sono più classi con lo stesso nome componente nel classpath. Seam sceglierà il componente con la precedenza più elevata. Ci sono alcuni valori di precedenza predefiniti (in ordine ascendente):
ja_jp: コンポーネントの優先順位は、 クラスパス中に同じコンポーネント名を持つ複数のクラスがある場合に、 インストールすべきコンポーネントを決定するために Seam が使用する番号です。 Seam はより優先順位が高いコンポーネントを選択します。 あらかじめ決められた優先順位の値があります (昇順)。

source: <literal>BUILT_IN</literal> &#8212; the lowest precedece components are the components built in to Seam.
fr_fr: <literal>BUILT_IN</literal> &#8212; les composants de précédence la plus faible sont les composants livrés avec Seam.
it_it: <literal>BUILT_IN</literal> &#8212; i componenti con più bassa precedenza sono i componenti predefiniti in Seam.
ja_jp: <literal>BUILT_IN</literal> &#8212; Seam に組み込まれた最も優先順位が低いコンポーネントです。

source: <literal>FRAMEWORK</literal> &#8212; components defined by third-party frameworks may override built-in components, but are overridden by application components.
fr_fr: <literal>FRAMEWORK</literal> &#8212; les composants définis par un serveur d’application tierces peuvent surcharger les composants livrés, mais ils sont surchargés par les composants d’application.
it_it: <literal>FRAMEWORK</literal> &#8212; i componenti definiti da framework di terze parti possono sovrascrivere i componenti predefiniti, ma vengono sovrascritti dai componenti applicazione.
ja_jp: <literal>FRAMEWORK</literal> &#8212; サードパーティフレームワークによって定義されたコンポーネントは組み込みコンポーネントをオーバーライドすることが可能ですが、アプリケーションコンポーネントによってオーバーライドされます。

source: <literal>APPLICATION</literal> &#8212; the default precedence. This is appropriate for most application components.
fr_fr: <literal>APPLICATION</literal> &#8212; la précédence par défaut. C'est la valeurappropriée pour la plus part des composants d’application.
it_it: <literal>APPLICATION</literal> &#8212; la precedenza di default. Questo è appropriato per i componenti delle applicazioni più comuni.
ja_jp: <literal>APPLICATION</literal> &#8212; デフォルト優先順位、 これはほとんどのアプリケーションコンポーネントにおいて適切です。

source: <literal>DEPLOYMENT</literal> &#8212; for application components which are deployment-specific.
fr_fr: <literal>DEPLOYMENT</literal> &#8212; pour les composants d’application qui ont un déploiement spécifique.
it_it: <literal>DEPLOYMENT</literal> &#8212; per i componenti applicazione che sono specifici per un deploy.
ja_jp: <literal>DEPLOYMENT</literal> &#8212; デプロイメント固有のアプリケーションコンポーネント用です。

source: <literal>MOCK</literal> &#8212; for mock objects used in testing.
fr_fr: <literal>MOCK</literal> &#8212; pour les objets singeant qui sont utilisés en test.
it_it: <literal>MOCK</literal> &#8212; per gli oggetti mock usati in fase di test.
ja_jp: <literal>MOCK</literal> &#8212; テストに使用されるモックオブジェクト用です。

source: Suppose we have a component named <literal>messageSender</literal> that talks to a JMS queue.
fr_fr: Supposez que nous avons un composant appelé <literal>messageSender</literal> qui parle à la queue de JMS.
it_it: Si supponga di avere un componente chiamato <literal>messageSender</literal> che dialoga con una coda JMS.
ja_jp: JMS キューと対話する <literal>messageSender</literal> という名前のコンポーネントがあるとします。

source: In our unit tests, we don't have a JMS queue available, so we would like to stub out this method. We'll create a <emphasis>mock</emphasis> component that exists in the classpath when unit tests are running, but is never deployed with the application:
fr_fr: Si dans vos tests unitaires, nous n’avons pas de queue de JMS disponible, mais que nous aimerions simuler cette méthode. Nous allons créer un composant le <emphasis>singeant</emphasis> et qui existe dans le classpath quand les tests unitaires sont exécutés mais il n’est jamais déployé avec l’application:
it_it: Nei test d'unità non si ha una coda JMS disponibile, e quindi si vuole costruire uno stub del metodo. Si creerà un componente <emphasis>mock</emphasis> che esiste nel classpath quando girano i test d'unità, ma non viene mai deployato con l'applicazione:
ja_jp: ユニットテストでは、 有効なJMS キューがないので、このメソッドをスタブにしてしまいたくなります。 ユニットテストが実行されるときにクラスパスに存在するけれどアプリケーションではデプロイされない <emphasis>mock</emphasis> コンポーネントを作成します。

source: The <literal>precedence</literal> helps Seam decide which version to use when it finds both components in the classpath.
fr_fr: La <literal>precedence</literal> aide Seam à décider quel version à utiliser quand il trouve deux composants dans la classpath.
it_it: La <literal>precedenza</literal> aiuta Seam a decide quale versione usare quando vengono trovati entrambi i componenti nel classpath.
ja_jp: <literal>優先順位</literal> はクラスパスで両方のコンポーネントを発見したとき、 Seam がどちらのバージョンを使用するかを助けます。

source: This is nice if we are able to control exactly which classes are in the classpath. But if I'm writing a reusable framework with many dependecies, I don't want to have to break that framework across many jars. I want to be able to decide which components to install depending upon what other components are installed, and upon what classes are available in the classpath. The <literal>@Install</literal> annotation also controls this functionality. Seam uses this mechanism internally to enable conditional installation of many of the built-in components. However, you probably won't need to use it in your application.
fr_fr: C’est bien si vous étiez capable de contrôler exactement quelles classes sont dans le classpath. Mais si j’ai écrit un serveur d’application réutilisable avec beaucoup de dépendances, je ne veux pas à avoir à briser ce serveur d’applications au travers de nombreux jars. Je veux d’être capable de décider quel composants sont à installer selon quel autres composants sont déjà installés et selon quelles classes sont disponibles dans le classpath. L’annotation <literal>@Install</literal> contrôle aussi cette fonctionnalité. Seam utilise ce mécanisme interne pour activer l’installation conditionnelle de beaucoup des composants livrés. Malgré tout, vous n’aurez probablement pas besoin de l’utiliser dans votre application.
it_it: Sarebbe bello poter controllare esattamente quali classi sono nel classpath. Ma se si sta scrivendo un framework riusabile con molte dipendenze, non si vuole dover suddividere tale framework in molti jar. Si vuole poter decidere quali componenti installare a seconda di quali altri componenti sono installati, e a seconda di quali classi sono disponibili nel classpath. Anche l'annotazione <literal>@Install</literal> controlla questa funzionalità. Seam utilizza questo meccanismo internamente per abilitare l'installazione condizionale di molti componenti predefiniti. Comunque con ogni probabilità non lo si utilizzerà nelle applicazioni.
ja_jp: クラスパスにある複数のクラスを正確に制御できるならば、 これはすばらしいことです。 しかし、多くの依存性を持つ再利用可能なフレームワークを記述している場合、 多くの Jar 全体にそのフレームワークを分散させたいとは思わないでしょう。 他にどのようなコンポーネントがインストールされているか、クラスパス中にどんなクラスが使用可能であるかに応じて、 インストールすべきコンポーネントを決める方法の方が好まれるはずです。 <literal>@Install</literal> アノテーションはこの機能も制御しています。 Seam は多くの組み込みコンポーネントの条件付きインストールを実現するために内部でこのメカニズムを使用します。 しかし、アプリケーションでは恐らく使用する必要がないでしょう。

source: Logging
fr_fr: Mettre des traces
ja_jp: ロギング

source: Who is not totally fed up with seeing noisy code like this?
fr_fr: Qui n’en n’a pas assez de voir du code aussi touffu que celui-ci ?
it_it: Chi non è nauseato dal vedere codice incasinato come questo?
ja_jp: 以下のようなうっとうしいコードを見るのに飽き飽きしていませんか。

source: It is difficult to imagine how the code for a simple log message could possibly be more verbose. There is more lines of code tied up in logging than in the actual business logic! I remain totally astonished that the Java community has not come up with anything better in 10 years.
fr_fr: Il est difficile d’imaginer comment le code pour un simple message de log peut devenir beaucoup verbeux. Il y a beaucoup plus de lignes de code dédié à l'affichage des traces plus que de la réelle logique métier! Je reste totalement abasourdie que la communauté Java n’a pas encore trouvé mieux depuis 10 ans.
it_it: E' difficile immaginare come possa essere più prolisso il codice per un semplice messaggio di log. Ci sono più linee di codice per il loggin che per la business logic! Ci meravigliamo come la comunità Java non abbia fatto qualcosa di meglio in 10 anni.
ja_jp: 簡単なログメッセージのためのコードをどうしてこんなに冗長にすることができるのか想像するのは困難です。 実際のビジネスロジックに関連するコード行よりロギングに関連する方がより多くあります。 Java コミュニティが 10 年の間もっと良いものを考え出せなかったことは本当に驚きです。

source: Seam provides a logging API that simplifies this code significantly:
fr_fr: Seam fourni un API d'affichage des traces qui simplifie significativement le code :
it_it: Seam fornisce un'API per il logging che semplifica in modo significativo questo codice:
ja_jp: Seam はたくさんのコードを簡素化するロギング API を提供します。

source: It doesn't matter if you declare the <literal>log</literal> variable static or not &#8212; it will work either way, except for entity bean components which require the <literal>log</literal> variable to be static.
fr_fr: Il n’est pas utile si vous déclarez la variable <literal>log</literal> statique ou non&#8212; elle va fonctionner dans tous les cas, à l’exception des composants bean entité qui demande à la variable de <literal>log</literal> d'être statique.
it_it: Non importa se si dichiara la variabile <literal>log</literal> statica o no &#8212; funzionerà in entrambi i modi, tranne per i componenti entity bean che richiedono la variabile <literal>log</literal> statica.
