Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Configuration.po
Languages: it_it

source: If you want to use the Seam tag library (most Seam applications do), you must include <literal>jboss-seam-ui.jar</literal> in the <literal>WEB-INF/lib</literal> directory of the WAR. If you want to use the PDF or email tag libraries, you need to put <literal>jboss-seam-pdf.jar</literal> or <literal>jboss-seam-mail.jar</literal> in <literal>WEB-INF/lib</literal>.
it_it: Se si vuole usare la libreria dei tag di Seam (come per la maggior parte delle applicazioni), occorre includere <literal>jboss-seam-ui.jar</literal> nella directory <literal>WEB-INF/lib</literal> del WAR. Se si vuole usare la libreria PDF o quella email, occorre mettere <literal>jboss-seam-pdf.jar</literal> o <literal>jboss-seam-mail.jar</literal> in <literal>WEB-INF/lib</literal>.

source: If you want to use the Seam debug page (only works for applications using facelets), you must include <literal>jboss-seam-debug.jar</literal> in the <literal>WEB-INF/lib</literal> directory of the WAR.
it_it: Se si vuole usare la pagina di debug di Seam (funziona solo per applicazioni con facelets), occorre includere <literal>jboss-seam-debug.jar</literal> nella directory <literal>WEB-INF/lib</literal> del WAR.

source: Seam ships with several example applications that are deployable in any Java EE container that supports EJB 3.0.
it_it: Seam porta con sé parecchi esempi di applicazioni che sono deployate in un container Java EE che supporta EJB 3.0.

source: I really wish that was all there was to say on the topic of configuration but unfortunately we're only about a third of the way there. If you're too overwhelmed by all this tedious configuration stuff, feel free to skip over the rest of this section and come back to it later.
it_it: Ci piacerebbe aver terminato l'argomento configurazione, ma sfortunatamente siamo solo ad un terzo. Se si è troppo sopraffatti da questo tedioso argomento, si può saltare alla prossima sezione e tornare qua più tardi.

source: Configuring Seam in J2EE
it_it: Configurare Seam in J2EE

source: Seam is useful even if you're not yet ready to take the plunge into EJB 3.0. In this case you would use Hibernate3 or JPA instead of EJB 3.0 persistence, and plain JavaBeans instead of session beans. You'll miss out on some of the nice features of session beans but it will be very easy to migrate to EJB 3.0 when you're ready and, in the meantime, you'll be able to take advantage of Seam's unique declarative state management architecture.
it_it: Seam è utile anche se non si è ancora pronti per il grande salto in EJB3.0. In questo caso si usa Hibernate3 o JPA invece della persistenza EJB3.0, ed i JavaBean invece dei bean di sessione. Non si avranno a disposizione alcune funzionalità carine per i session bean, ma sarà molto semplice migrare a EJB3.0 quando si sarà pronti ed allora si potrà sfruttare l'architettura unica di Seam per la gestione dichiarativa dello stato.

source: Seam JavaBean components do not provide declarative transaction demarcation like session beans do. You <emphasis>could</emphasis> manage your transactions manually using the JTA <literal>UserTransaction</literal> or declaratively using Seam's <literal>@Transactional</literal> annotation. But most applications will just use Seam managed transactions when using Hibernate with JavaBeans.
it_it: I componenti JavaBean di Seam non forniscono la demarcazione dichiarativa delle transazioni come fanno i session bean. Si <emphasis>possono</emphasis> gestire manualmente le transazioni usando <literal>UserTransaction</literal> di JTA od in modo dichiarativo usando l'annotazione <literal>@Transactional</literal> di Seam. Ma la maggior parte delle applicazioni userà solo le transazioni gestite da Seam con Hibernate ed i JavaBean.

source: The Seam distribution includes a version of the booking example application that uses Hibernate3 and JavaBeans instead of EJB3, and another version that uses JPA and JavaBeans. These example applications are ready to deploy into any J2EE application server.
it_it: La distribuzione Seam include una versione dell'esempio booking che usa Hibernate3 e JavaBean invece di EJB3, ed un'altra versione che usa JPA e JavaBean. Queste applicazioni d'esempio sono pronte per essere deployate in ogni application server J2EE.

source: Boostrapping Hibernate in Seam
it_it: Boostrapping di Hibernate in Seam

source: Seam will bootstrap a Hibernate <literal>SessionFactory</literal> from your <literal>hibernate.cfg.xml</literal> file if you install a built-in component:
it_it: Seam avvierà un <literal>SessionFactory</literal> di Hibernate dal file <literal>hibernate.cfg.xml</literal> se si installa un componente predefinito:

source: You will also need to configure a <emphasis>managed session</emphasis> if you want a Seam managed Hibernate <literal>Session</literal> to be available via injection.
it_it: Occorre anche configurare una <emphasis>sessione gestita</emphasis> se si vuole disponibile via injection una <literal>Session</literal> di Hibernate gestita da Seam.

source: Boostrapping JPA in Seam
it_it: Boostrapping di JPA in Seam

source: Seam will bootstrap a JPA <literal>EntityManagerFactory</literal> from your <literal>persistence.xml</literal> file if you install this built-in component:
it_it: Seam avvierà un <literal>EntityManagerFactory</literal> JPA dal file <literal>persistence.xml</literal> se è stato installato il seguente componente predefinito:

source: You will also need to configure a <emphasis>managed persistence context</emphasis> if you want a Seam managed JPA <literal>EntityManager</literal> to be available via injection.
it_it: Occorre anche configurare un <emphasis>contesto di persistenza gestito</emphasis> se si vuole avere disponibile via injection un <literal>EntityManager</literal> JPA gestito da Seam.

source: We can package our application as a WAR, in the following structure:
it_it: Si può impacchettare l'applicazione come WAR nella seguente struttura:

source: If we want to deploy Hibernate in a non-EE environment like Tomcat or TestNG, we need to do a little bit more work.
it_it: Se si vuole fare ildeploy di Hibernate in un ambiente non EE come Tomcat o TestNG, occorre un pò di lavoro.

source: Configuring Seam in Java SE, without JBoss Embedded
it_it: Configurazione di Seam in java EE 5 senza JBoss Embedded

source: It is possible to use Seam completely outside of an EE environment. In this case, you need to tell Seam how to manage transactions, since there will be no JTA available. If you're using JPA, you can tell Seam to use JPA resource-local transactions, ie. <literal>EntityTransaction</literal>, like so:
it_it: E' possibile usare Seam completamente fuori dall'ambiente EE. In questo caso serve istruire Seam come gestire le transazioni gestire, poiché non sarà disponibile JTA. Se si usa JTA, si può dire a Seam di usare le transazioni resource-local di JTA, cioè <literal>EntityTransaction</literal>, in questo modo:

source: If you're using Hibernate, you can tell Seam to use the Hibernate transaction API like this:
it_it: Se si usa Hibernate, si può dire a Seam di usare l'API transaction di Hibernate in questo modo:

source: Of course, you'll also need to define a datasource.
it_it: Certamente occorre definire un datasource.

source: A better alternative is to use JBoss Embedded to get access to the EE APIs.
it_it: Un'alternativa migliore è usare JBoss Embedded per accedere alle API EE.

source: Configuring Seam in Java SE, with JBoss Embedded
it_it: Configurazione di Seam in java EE 5 con JBoss Embedded

source: JBoss Embedded lets you run EJB3 components outside the context of the Java EE 5 application server. This is especially, but not only, useful for testing.
it_it: JBoss Embedded consente di eseguire i componenti EJB3 fuori dal contesto dell'application server Java EE 5. Questo è utile specialmente, ma non solo, per il testing.

source: The Seam booking example application includes a TestNG integration test suite that runs on JBoss Embedded via <literal>SeamTest</literal>.
it_it: L'applicazione d'esempio booking include la suite d'integrazione per TestNG che esegue JBoss Embedded via <literal>SeamTest</literal>.

source: The booking example application may even be deployed to Tomcat.
it_it: L'applicazione d'esempio booking può essere deployata via Tomcat.

source: Installing Embedded JBoss
it_it: Installare JBoss Embedded

source: Embedded JBoss must by installed into Tomcat for Seam applications to run correctly on it. Embedded JBoss runs with JDK 5 or JDK 6 ( see <xref linkend="jdk_dependencies"/> for details on using JDK 6). Embedded JBoss can be downloaded <ulink url="http://sourceforge.net/project/showfiles.php?group_id=22866&amp;package_id=228977">here</ulink>. The process for installing Embedded JBoss into Tomcat 6 is quite simple. First, you should copy the Embedded JBoss JARs and configuration files into Tomcat.
it_it: Embedded JBoss deve essere installato in Tomcat per le eseguire correttamente le applicazioni Seam. Embedded JBoss gira con JDK 5 o JDK 6 (si veda <xref linkend="jdk_dependencies"/> per i dettagli con JDK 6). Embedded JBoss può essere scaricato <ulink url="http://sourceforge.net/project/showfiles.php?group_id=22866&amp;package_id=228977">qua</ulink>. Il processo di installazione di Embedded JBoss in Tomcat 6 è abbastanza semplice. Innanzitutto bisogna copiare i jar di Embedded JBoss ed i file di configurazione in Tomcat.

source: Copy all files and directories under the Embedded JBoss <literal>bootstrap</literal> and <literal>lib</literal> directories, except for the <literal>jndi.properties</literal> file, into the Tomcat <literal>lib</literal> directory.
it_it: Copiare tutti i file e le directory di Embedded JBoss <literal>bootstrap</literal> e la directory <literal>lib</literal>, tranne il file <literal>jndi.properties</literal>, nella directory di Tomcat <literal>lib</literal>.

source: Remove the <literal>annotations-api.jar</literal> file from the Tomcat <literal>lib</literal> directory.
it_it: Rimuovere il file <literal>annotations-api.jar</literal> dalla directory Tomcat <literal>lib</literal>.

source: Next, two configuration files need to be updated to add Embedded JBoss-specific functionality.
it_it: Poi devono essere aggiornati due file di configurazione per poter aggiungere funzionalità specifiche di JBoss Embedded.

source: Add the Embedded JBoss listener <literal>EmbeddedJBossBootstrapListener</literal> to <literal>conf/server.xml</literal>. It must appear after all other listeners in the file:
it_it: Aggiungere il listener Embedded JBoss <literal>EmbeddedJBossBootstrapListener</literal> a <literal>conf/server.xml</literal>. Deve apparire dopo tutti gli altri listener nel file:

source: WAR file scanning should be enabled by adding the <literal>WebinfScanner</literal> listener to <literal>conf/context.xml</literal>:
it_it: La scansione del file WAR può essere abilitata aggiungendo il listener <literal>WebinfScanner</literal> in <literal>conf/context.xml</literal>:

source: If you are using Sun JDK 6, you need to set the Java option <literal>sun.lang.ClassLoader.allowArraySyntax</literal> to <literal>true</literal> in the JAVA_OPTS environment variable used by the Catalina startup script (catalina.bat on Windows or catalina.sh on Unix).
it_it: Se si usa Sun JDK 6, occorre impostare l'opzione Java <literal>sun.lang.ClassLoader.allowArraySyntax</literal> a <literal>true</literal> nella variabile d'ambiente JAVA_OPTS usata dallo script di avvio Catalina (catalina.bat in Windows o catalina.sh in Unix).

source: Open the script appropriate for your operating system in a text editor. Add a new line immediately below the comments at the top of the file where you will define the JAVA_OPTS environment variable. On Windows, use the following syntax:
it_it: Aprire in un editor lo script appropriato per il proprio sistema operativo. Aggiungere una nuova linea immediatamente sotto i commenti in cima al file dove verrà definita la variabile d'ambiente JAVA_OPTS. Su Windows, usare la seguente sintassi:

source: On Unix, use this syntax instead:
it_it: In Unix, usare invece questa sintassi:

source: For more configuration options, please see the Embedded JBoss Tomcat integration <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=EmbeddedAndTomcat">wiki entry</ulink>.
it_it: Per ulteriorio opzioni di configurazione, si prega di vedere l'integrazione con Embedded JBoss Tomcat <ulink url="http://wiki.jboss.org/wiki/Wiki.jsp?page=EmbeddedAndTomcat">wiki entry</ulink>.

source: The archive structure of a WAR-based deployment on an servlet engine like Tomcat will look something like this:
it_it: La struttura dell'archivio di un deploy basato su WAR per un servlet engine come Tomcat appare in questo modo:

source: Most of the Seam example applications may be deployed to Tomcat by running <literal>ant deploy.tomcat</literal>.
it_it: La maggior parte delle applicazioni d'esempio può essere deployata in Tomcat eseguendo <literal>ant deploy.tomcat</literal>.

source: Configuring jBPM in Seam
it_it: Configurazione jBPM in Seam

source: Seam's jBPM integration is not installed by default, so you'll need to enable jBPM by installing a built-in component. You'll also need to explicitly list your process and pageflow definitions. In <literal>components.xml</literal>:
it_it: L'integrazione jBPM di Seam non è installata di default, quindi occorre abilitare jBPM installando il componente predefinito. Serve anche elencare esplicitamente le definizioni di processo ed i pageflow. In <literal>components.xml</literal>:

source: No further special configuration is needed if you only have pageflows. If you do have business process definitions, you need to provide a jBPM configuration, and a Hibernate configuration for jBPM. The Seam DVD Store demo includes example <literal>jbpm.cfg.xml</literal> and <literal>hibernate.cfg.xml</literal> files that will work with Seam:
it_it: Non servono ulteriori configurazioni se si usano solo i pageflow. Se si hanno definizioni di processi di business, bisogna fornire una configurazione jBPM ed una configurazione Hibernate per jBPM. La demo Seam DVD Store include i file d'esempio <literal>jbpm.cfg.xml</literal> e <literal>hibernate.cfg.xml</literal> che funzionano con Seam:

source: The most important thing to notice here is that jBPM transaction control is disabled. Seam or EJB3 should control the JTA transactions.
it_it: La cosa più importante da notare è che il controllo della transazione jBPM è disabilitato. Seam o EJB3 dovrebbero controllare le transazioni JTA.

source: There is not yet any well-defined packaging format for jBPM configuration and process/pageflow definition files. In the Seam examples we've decided to simply package all these files into the root of the EAR. In future, we will probably design some other standard packaging format. So the EAR looks something like this:
it_it: Non c'è ancora un formato di impacchettamento ben-definito per la configurazione jBPM ed i file di definizione processo/pageflow. Negli esempi Seam si è deciso di impacchettare semplicemente tutti questi file nella directory radice dell'EAR. In future, si progetterà probabilmente un formato standard di impacchettamento. Quindi l'EAR appare così:

source: Configuring SFSB and Session Timeouts in JBoss AS
it_it: Configurazione di SFSB e dei timeout di sessione in JBoss AS

source: It is very important that the timeout for Stateful Session Beans is set higher than the timeout for HTTP Sessions, otherwise SFSB's may time out before the user's HTTP session has ended. JBoss Application Server has a default session bean timeout of 30 minutes, which is configured in <literal>server/default/conf/standardjboss.xml</literal> (replace <emphasis>default</emphasis> with your own configuration).
it_it: E' molto importante che il timeout per i bean di sessione stateful sia impostato ad un tempo maggiore del timeout per le sessioni HTTP, altrimenti SFSB può andare in timeout primache la sessione HTTP sia terminata. JBoss AS ha un timeout di default di 30 minuti, che è impostato nel file <literal>server/default/conf/standardjboss.xml</literal> (sostituire <emphasis>default</emphasis>con la propria configurazione).

source: The default SFSB timeout can be adjusted by modifying the value of <literal>max-bean-life</literal> in the <literal>LRUStatefulContextCachePolicy</literal> cache configuration:
it_it: Il timeout di default di SFSB può essere impostato modificando il valore di <literal>max-bean-life</literal> nella configurazione della cache <literal>LRUStatefulContextCachePolicy</literal>:

source: The default HTTP session timeout can be modified in <literal>server/default/deploy/jbossweb-tomcat55.sar/conf/web.xml</literal> for JBoss 4.0.x, or in <literal>server/default/deploy/jboss-web.deployer/conf/web.xml</literal> for JBoss 4.2.x or later. The following entry in this file controls the default session timeout for all web applications:
it_it: Il timeout di default per la sessione HTTP può essere modificato in <literal>server/default/deploy/jbossweb-tomcat55.sar/conf/web.xml</literal> per JBoss 4.0.x, o in <literal>server/default/deploy/jboss-web.deployer/conf/web.xml</literal> per JBoss 4.2.x o successivi. La seguente riga in questo file controlla il timeout di default per la sessione di tutte le applicazioni web:

source: To override this value for your own application, simply include this entry in your application's own <literal>web.xml</literal>.
it_it: Per sovrascrivere questo valore per la propria applicazione, si includa semplicemente questa riga nel proprio <literal>web.xml</literal>.

source: Running Seam in a Portlet
it_it: Esecuzione di Seam in un Portlet

source: If you want to run your Seam application in a portlet, take a look at the JBoss Portlet Bridge, an implementation of JSR-301 that supports JSF within a portlet, with extensions for Seam and RichFaces. See <ulink url="http://labs.jboss.com/portletbridge">http://labs.jboss.com/portletbridge</ulink> for more.
it_it: Se si vogliono eseguire le applicazioni in un portlet, si guardi JBoss Portlet Bridge, un'implementazione di JSR-301 che supporta JSF con i portlet, con estensioni per Seam e RichFaces. Si veda <ulink url="http://labs.jboss.com/portletbridge">http://labs.jboss.com/portletbridge</ulink>.

source: Deploying custom resources
it_it: Deploy di risorse personalizzate

source: Seam scans all jars containing <literal>/seam.properties</literal>, <literal>/META-INF/components.xml</literal> or <literal>/META-INF/seam.properties</literal> on startup for resources. For example, all classes annotated with <literal>@Name</literal> are registered with Seam as Seam components.
it_it: Seam scansiona all'avvio tutti i jar contenenti <literal>/seam.properties</literal>, <literal>/META-INF/components.xml</literal> o <literal>/META-INF/seam.properties</literal>. Per esempio, tutte le classi annotate con <literal>@Name</literal> vengono registrate da Seam come componenti Seam.

source: You may also want Seam to handle custom resources. A common use case is to handle a specific annotation and Seam provides specific support for this. First, tell Seam which annotations to handle in <literal>/META-INF/seam-deployment.properties</literal>:
it_it: Si potrebbe volere fare gestire a Seam delle risorse personalizzate. Un comune caso d'uso è gestire una specifica annotazione, Seam fornisce un supporto specifico per questo. Innanzitutto, dire a Seam quali annotazioni gestire in <literal>/META-INF/seam-deployment.properties</literal>:

source: Then, during application startup you can get hold of all classes annotated with <literal>@Foo</literal>:
it_it: Poi durante l'avvio dell'applicazione si può comunicare con tutte le classi annotate con <literal>@Foo</literal>:

source: You can also handle <emphasis>any</emphasis> resource. For example, you process any files with the extension <literal>.foo.xml</literal>. To do this, we need to write a custom deployment handler:
it_it: Si può gestire <emphasis>qualsiasi</emphasis> risorsa. Per esempio, si processano i file con estensione <literal>.foo.xml</literal>. Per fare questo occorre scrivere un deployment handler personalizzato:

source: Here we are just building a list of any files with the suffix <literal>.foo.xml</literal>.
it_it: Qua viene costruita una lista di file con il suffisso <literal>.foo.xml</literal>.

source: Then, we need to register the deployment handler with Seam in <literal>/META-INF/seam-deployment.properties</literal>. You can register multiple deployment handler using a comma separated list.
it_it: Poi occorre registrare il deployment handler con Seam in <literal>/META-INF/seam-deployment.properties</literal>. Si possono registrare più deployment handler usando una lista separata da virgola.

source: Seam uses deployment handlers internally to install components and namespaces. You can easily access the deployment handler during an <literal>APPLICATION</literal> scoped component's startup:
it_it: Seam utilizza internamente dei deployment handler per installare componenti e namespace. Si può facilmente accedere ad un deployment handler durante l'avvio di un componente con scope <literal>APPLICATION</literal>:
