Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Configuration.po
Languages: it_it

source: Configuring Seam and packaging Seam applications
it_it: Configurare Seam ed impacchettare le applicazioni Seam

source: Configuration is a very boring topic and an extremely tedious pastime. Unfortunately, several lines of XML are required to integrate Seam into your JSF implementation and servlet container. There's no need to be too put off by the following sections; you'll never need to type any of this stuff yourself, since you can just use seam-gen to start your application or you can copy and paste from the example applications!
it_it: La configurazione è un argomento molto noioso ed un passatempo estremamente tedioso. Sfortunatamente sono richieste parecchie linee di XML per integrare Seam con l'implementazione JSF ed il servlet container. Non c'è bisogno di soffermarsi sulle seguenti sezioni; non si dovrà mai scrivere queste cose a mano, poiché basta usare seam-gen per creare ed avviare l'applicazione oppure basta copiare ed incollare il codice dagli esempi di applicazione!

source: Basic Seam configuration
it_it: Configurazione base di Seam

source: First, let's look at the basic configuration that is needed whenever we use Seam with JSF.
it_it: In primo luogo si cominci col guardare alla configurazione base che serve ogni volta che si usa Seam con JSF.

source: Integrating Seam with JSF and your servlet container
it_it: Integrazione di Seam con JSF ed il servlet container

source: Of course, you need a faces servlet!
it_it: Certamente occorre un servlet faces!

source: (You can adjust the URL pattern to suit your taste.)
it_it: (Si può sistemare il pattern dell'URL a proprio piacimento.)

source: In addition, Seam requires the following entry in your <literal>web.xml</literal> file:
it_it: In aggiunta, Seam richiede la seguente voce nel file <literal>web.xml</literal>:

source: This listener is responsible for bootstrapping Seam, and for destroying session and application contexts.
it_it: Questo listener è responsabile dell'avvio di Seam e della distruzione dei contesti di sessione e di applicazione.

source: Some JSF implementations have a broken implementation of server-side state saving that interferes with Seam's conversation propagation. If you have problems with conversation propagation during form submissions, try switching to client-side state saving. You'll need this in <literal>web.xml</literal>:
it_it: Alcune implementazioni JSF hanno un'implementazione erronea della conservazione dello stato lato server, che interferisce con la propagazione della conversazione di Seam. Se si hanno problemi con la propagazione della conversazione durante l'invio di form, si provi a cambiare impostanto la conservazione lato client. Occorre impostare questo in <literal>web.xml</literal>:

source: There is a minor gray area in the JSF specification regarding the mutability of view state values. Since Seam uses the JSF view state to back its PAGE scope this can become an issue in some cases. If you're using server side state saving with the JSF-RI and you want a PAGE scoped bean to keep its exact value for a given view of a page you will need to specify the following context-param. Otherwise if a user uses the "back" button a PAGE scoped component will have the latest value if it has changed not the value of the "back" page. (see <ulink url="https://javaserverfaces-spec-public.dev.java.net/issues/show_bug.cgi?id=295"> Spec Issue </ulink> ). This setting is not enabled by default because of the performance hit of serializing the JSF view with every request.
it_it: C'è una piccola parte grigia nella specifica JSF riguardante la mutabilità dei valore dello stato della vista. Poiché Seam usa lo stato della vista JSF per tornare allo scope PAGE, questo in alcuni casi può diventare un problema. Se si usa la conservazione dello stato lato server con JSF-RI e si vuole che il bean con scope PAGE mantenga l'esatto valore per una data vista di pagina, occorre specificare il seguente parametro di contesto. Altrimenti se un utente usa il pulsante "indietro", un componente con scope PAGE avrà l'ultimo valore se questo non è cambiato nella pagina "indietro". (si veda <ulink url="https://javaserverfaces-spec-public.dev.java.net/issues/show_bug.cgi?id=295"> Spec Issue </ulink> ). Quest'impostazione non è abilitata di default a causa della performance nella serializzazione della vista JSF ad ogni richiesta.

source: Using Facelets
it_it: Usare Facelets

source: If you want follow our advice and use Facelets instead of JSP, add the following lines to <literal>faces-config.xml</literal>:
it_it: Se si vuole seguire il consiglio ed usare Facelets invece di JSP, si aggiungano le seguenti linee a <literal>faces-config.xml</literal>:

source: And the following lines to <literal>web.xml</literal>:
it_it: E le seguenti linee a <literal>web.xml</literal>:

source: If you are using facelets in JBoss AS, you'll find that Facelets logging is broken (the log messages don't make it to the server log). Seam provides a bridge to fix this, to use it copy <literal>lib/interop/jboss-seam-jul.jar</literal> to <literal>$JBOSS_HOME/server/default/deploy/jboss-web.deployer/jsf-libs/</literal> and include the <literal>jboss-seam-ui.jar</literal> in the <literal>WEB-INF/lib</literal> of your application. The Facelets logging catagories are itemized in the <ulink url="https://facelets.dev.java.net/nonav/docs/dev/docbook.html#config-logging">Facelets Developer Documentation</ulink>.
it_it: Se si usa facelets in JBoss AS, si noterà che il logging di Facelets è guasto (i messaggi di log non appaiono nel log del server). Seam fornisce un modo per sistemare questo problema, per usarlo si copi <literal>lib/interop/jboss-seam-jul.jar</literal> in <literal>$JBOSS_HOME/server/default/deploy/jboss-web.deployer/jsf-libs/</literal> e si includa <literal>jboss-seam-ui.jar</literal> nel <literal>WEB-INF/lib</literal> dell'applicazione. Le categorie di logging di Facelets sono elencate nella <ulink url="https://facelets.dev.java.net/nonav/docs/dev/docbook.html#config-logging">Documentazione per lo sviluppatore Facelets</ulink>.

source: Seam Resource Servlet
it_it: Resource Servlet di Seam

source: The Seam Resource Servlet provides resources used by Seam Remoting, captchas (see the security chapter) and some JSF UI controls. Configuring the Seam Resource Servlet requires the following entry in <literal>web.xml</literal>:
it_it: Seam Resource Servlet fornisce le risorse usate da Seam Remoting, captchas (si veda il capitolo sulla sicurezza) ed altri controlli JSF UI. Configurare Seam Resource Servlet richiede la seguente riga in <literal>web.xml</literal>:

source: Seam servlet filters
it_it: Filtri servlet di Seam

source: Seam doesn't need any servlet filters for basic operation. However, there are several features which depend upon the use of filters. To make things easier, Seam lets you add and configure servlet filters just like you would configure other built-in Seam components. To take advantage of this feature, we must first install a master filter in <literal>web.xml</literal>:
it_it: Seam non ha bisogno di filtri servlet per le operazioni base. Comunque ci sono parecchie caratteristiche che dipendono dall'uso dei filtri. Per facilitare le cose, Seam lascia aggiungere e configurare i filtri servlet così come si configurano gli altri componenti predefiniti di Seam. Per sfruttare questa caratteristica occorre installa un filtro master in <literal>web.xml</literal>:

source: The Seam master filter <emphasis>must</emphasis> be the first filter specified in <literal>web.xml</literal>. This ensures it is run first.
it_it: Il filtro master di Seam <emphasis>deve</emphasis> essere il primo filtro specificato in <literal>web.xml</literal>. Questo assicura che venga eseguito per primo.

source: The Seam filters share a number of common attributes, you can set these in <literal>components.xml</literal> in addition to any parameters discussed below:
it_it: I filtri Seam condividono un numero di attributi comuni, si possono impostare questi in <literal>components.xml</literal> in aggiunto ai parametri discussi sotto:

source: <literal>url-pattern</literal> &#8212; Used to specify which requests are filtered, the default is all requests. <literal>url-pattern</literal> is a Tomcat style pattern which allows a wildcard suffix.
it_it: <literal>url-pattern</literal> &#8212; Usato per specificare quali richieste vengono filtrate, il default è tutte le richieste. <literal>url-pattern</literal> è un pattern di stile di Tomcat che consente un suffisso wildcard.

source: <literal>regex-url-pattern</literal> &#8212; Used to specify which requests are filtered, the default is all requests. <literal>regex-url-pattern</literal> is a true regular expression match for request path.
it_it: <literal>regex-url-pattern</literal> &#8212; Usato per specificare quali richieste vengono filtrate, il default è tutte le richieste. <literal>regex-url-pattern</literal> è una vera espressione regolare per il percorso di richiesta.

source: <literal>disabled</literal> &#8212; Used to disable a built in filter.
it_it: <literal>disabled</literal> &#8212; Usato per disabilitare il filtro predefinito.

source: Note that the patterns are matched against the URI path of the request (see <literal>HttpServletRequest.getURIPath()</literal>) and that the name of the servlet context is removed before matching.
it_it: Si noti che i pattern corrispondono al percorso URI della richiesta (si veda <literal>HttpServletRequest.getURIPath()</literal>) e che il nome del contesto servlet viene rimosso prima del matching.

source: Adding the master filter enables the following built-in filters.
it_it: L'aggiunta del filtro master abilita i seguenti filtri predefiniti.

source: Exception handling
it_it: Gestione delle eccezioni.

source: This filter provides the exception mapping functionality in <literal>pages.xml</literal> (almost all applications will need this). It also takes care of rolling back uncommitted transactions when uncaught exceptions occur. (According to the Java EE specification, the web container should do this automatically, but we've found that this behavior cannot be relied upon in all application servers. And it is certainly not required of plain servlet engines like Tomcat.)
it_it: Questo filtro fornisce la funzionalità di mappaturadelle eccezioni in <literal>pages.xml</literal> (quasi tutte le applicazioni ne hanno bisogno). Inoltre il filtro si preoccupa del rolling back delle transazioni non eseguite quando avviene un'eccezione non catturata. (In accordo alle specifiche Java EE, il web container dovrebbe fare questo in modo automatico, ma noi abbiamo visto che questo comportamento non può essere dato per scontato su tutti gli application server. E certamente non è richiesto sugli engine servlet come Tomcat.)

source: By default, the exception handling filter will process all requests, however this behavior may be adjusted by adding a <literal>&lt;web:exception-filter&gt;</literal> entry to <literal>components.xml</literal>, as shown in this example:
it_it: Di default il filtro di gestione eccezioni processerà tutte le richieste, comunque questo comportamento può essere sistemato aggiungendo una riga <literal>&lt;web:exception-filter&gt;</literal> a <literal>components.xml</literal>, come mostrato in quest'esempio:

source: Conversation propagation with redirects
it_it: Propagazione delle conversazioni con i redirect

source: This filter allows Seam to propagate the conversation context across browser redirects. It intercepts any browser redirects and adds a request parameter that specifies the Seam conversation identifier.
it_it: Questo filtro consente a Seam di propagare il contesto conversazione attraverso i redirect del browser. Intercetta qualsiasi redirect ed aggiunge un parametro di richiesta che specifica l'identificatore della conversazione di Seam.

source: The redirect filter will process all requests by default, but this behavior can also be adjusted in <literal>components.xml</literal>:
it_it: Il filtro redirect processerà tutte le richieste di default, ma questo comportamento può essere aggiustato in <literal>components.xml</literal>:

source: URL rewriting
it_it: Riscrittura dell'URL

source: This filter allows Seam to apply URL rewriting for views based on configuration in the <literal>pages.xml</literal> file. This filter is not activate by default, but can be activated by adding the configuration to <literal>components.xml</literal>:
it_it: Questo filtro consente aSeam di applicare la riscrittura URL per le viste basate sulla configurazione nel file <literal>pages.xml</literal>. Questo filtro non è attivato di default, ma può essere attivato aggiungendo la configurazione in <literal>components.xml</literal>:

source: The <literal>view-mapping</literal> parameter must match the servlet mapping defined for the Faces Servlet in the <literal>web.xml</literal> file. If ommitted, the rewrite filter assumes the pattern <literal>*.seam</literal>.
it_it: Il parametro <literal>view-mapping</literal>deve corrispondere alla mappatura del servlet definita per Faces Servlet nel file <literal>web.xml</literal>. Se omesso, il filtro rewrite assume il pattern <literal>*.seam</literal>.

source: Multipart form submissions
it_it: Invio di form multipart

source: This feature is necessary when using the Seam file upload JSF control. It detects multipart form requests and processes them according to the multipart/form-data specification (RFC-2388). To override the default settings, add the following entry to <literal>components.xml</literal>:
it_it: Questa caratteristica è necessaria per usare il controllo JSF di upload dei file. Esso rileva le richieste form multipart e le processa in accordo con la specifica multipart/form-data (RFC-2388). Per sovrascrivere queste impostazioni di default si aggiunga la seguente riga a <literal>components.xml</literal>:

source: <literal>create-temp-files</literal> &#8212; If set to <literal>true</literal>, uploaded files are written to a temporary file (instead of held in memory). This may be an important consideration if large file uploads are expected. The default setting is <literal>false</literal>.
it_it: <literal>create-temp-files</literal> &#8212; Se impostato a <literal>true</literal>, i file caricati vengono scritti in un file temporaneo (invece di essere mantenuti in memoria). Questa può essere una considerazione importante se ci si aspettano upload di file grandi. L'impostazione di default è <literal>false</literal>.

source: <literal>max-request-size</literal> &#8212; If the size of a file upload request (determined by reading the <literal>Content-Length</literal> header in the request) exceeds this value, the request will be aborted. The default setting is 0 (no size limit).
it_it: <literal>max-request-size</literal> &#8212; Se la dimensione della richiesta di file upload (determinata leggendo l'intestazione <literal>Content-Length</literal> nella richiesta) eccede questo valore, la richiesta verrà annullata. L'impostazione di default è 0 (nessun limite di dimensioni).

source: Character encoding
it_it: Codifica dei caratteri

source: Sets the character encoding of submitted form data.
it_it: Imposta la codifica caratteri dei dati della form inviata.

source: This filter is not installed by default and requires an entry in <literal>components.xml</literal> to enable it:
it_it: Questo filtro non è installato di default e richiede una riga in <literal>components.xml</literal> per essere abilitato:

source: <literal>encoding</literal> &#8212; The encoding to use.
it_it: <literal>encoding</literal> &#8212; La codifica da usare.

source: <literal>override-client</literal> &#8212; If this is set to <literal>true</literal>, the request encoding will be set to whatever is specified by <literal>encoding</literal> no matter whether the request already specifies an encoding or not. If set to <literal>false</literal>, the request encoding will only be set if the request doesn't already specify an encoding. The default setting is <literal>false</literal>.
it_it: <literal>override-client</literal> &#8212; Se questo è impostato a <literal>true</literal>, la codifica della richiesta sarà impostata a ciò che è specificato da <literal>encoding</literal> non importa se la richiesta già specifica una codifica o no. Se impostato a <literal>false</literal>, la codifica della richiesta sarà impostata solo se la richiesta non specifica già una codifica. L'impostazione di default è <literal>false</literal>.

source: If RichFaces is used in your project, Seam will install the RichFaces Ajax filter for you, making sure to install it before all other built-in filters. You don't need to install the RichFaces Ajax filter in <literal>web.xml</literal> yourself.
it_it: Se RichFaces viene usato nel progetto, Seam installerà il filtro RichFaces Ajax, assicurandosi di installarlo prima di tutti gli altri filtri predefiniti. Non occorre che voi installiate il filtro RichFaces Ajax in <literal>web.xml</literal>.

source: The RichFaces Ajax filter is only installed if the RichFaces jars are present in your project.
it_it: Il filtro RichFaces Ajax è installato solo se i jar di RichFaces sono presenti nel progetto.

source: To override the default settings, add the following entry to <literal>components.xml</literal>. The options are the same as those specified in the RichFaces Developer Guide:
it_it: Per sovrascrivere le impostazioni di default aggiungere la seguente riga a <literal>components.xml</literal>. Le opzioni sono le stesse di quelle specificate nella guida RichFaces Developer:

source: <literal>force-parser</literal> &#8212; forces all JSF pages to be validated by Richfaces's XML syntax checker. If <literal>false</literal>, only AJAX responses are validated and converted to well-formed XML. Setting <literal>force-parser</literal> to <literal>false</literal> improves performance, but can provide visual artifacts on AJAX updates.
it_it: <literal>force-parser</literal> &#8212; forza tutte le pagine JSF ad essere validate dal controllore di sintassi XML di RichFaces. Se <literal>false</literal>, solo le risposte AJAX vengono validate e convertite in XML ben-formato. Impostando <literal>force-parser</literal> a <literal>false</literal> si migliorano le performance, ma può portare ad imperfezioni visuali durante gli aggiornamenti AJAX.

source: <literal>enable-cache</literal> &#8212; enables caching of framework-generated resources (e.g. javascript, CSS, images, etc). When developing custom javascript or CSS, setting to true prevents the browser from caching the resource.
it_it: <literal>enable-cache</literal> &#8212; abilita il caching delle risorse generate dal framework (es. javascript, CSS, immagini, ecc). Sviluppando javascript o CSS personalizzati, impostare a true previene il browser dal caching delle risorse.

source: <literal>log4j-init-file</literal> &#8212; is used to setup per-application logging. A path, relative to web application context, to the log4j.xml configuration file should be provided.
it_it: <literal>log4j-init-file</literal> &#8212; è usato per impostare il logging per applicazione. Deve essere fornito un path al file di configurazione log4j.xml, relativo al contesto dell'applicazione web.

source: Identity Logging
it_it: Log delle identità

source: This filter adds the authenticated user name to the log4j mapped diagnostic context so that it can be included in formatted log output if desired, by adding %X{username} to the pattern.
it_it: Questo filtro aggiunge il nome dell'utente autenticato al contesto diagnostico mappato di loj4j affinché possa essere incluso nell'output formattato del log se desiderato, aggiungendo %X{username} al pattern.

source: By default, the logging filter will process all requests, however this behavior may be adjusted by adding a <literal>&lt;web:logging-filter&gt;</literal> entry to <literal>components.xml</literal>, as shown in this example:
it_it: Di default il filtro di logging processerà tutte le richieste, comunque questo comportamento può essere sistemato aggiungendo l'entry <literal>&lt;web:logging-filter&gt;</literal> a <literal>components.xml</literal>, come mostrato in quest'esempio:

source: Context management for custom servlets
it_it: Gestione del contesto per servlet personalizzati

source: Requests sent direct to some servlet other than the JSF servlet are not processed through the JSF lifecycle, so Seam provides a servlet filter that can be applied to any other servlet that needs access to Seam components.
it_it: Le richieste inviate direttamente a servlet diversi dal servlet JSF non vengono processate attraverso il ciclo di vita JSF, in questo modo Seam fornisce un filtro servlet che può essere applicato ad altri servlet che necessitano dell'accesso ai componenti Seam.

source: This filter allows custom servlets to interact with the Seam contexts. It sets up the Seam contexts at the beginning of each request, and tears them down at the end of the request. You should make sure that this filter is <emphasis>never</emphasis> applied to the JSF <literal>FacesServlet</literal>. Seam uses the phase listener for context management in a JSF request.
it_it: Questo filtro consente ai servlet personalizzati di interagire con i contesti Seam. Questo imposta i contesti Seam all'inizio di ogni richiesta e li elimina alla fine della richiesta. Occorre assicurarsi che il filtro non venga <emphasis>mai</emphasis> applicato al <literal>FacesServlet</literal> JSF.

source: The context filter expects to find the conversation id of any conversation context in a request parameter named <literal>conversationId</literal>. You are responsible for ensuring that it gets sent in the request.
it_it: Il filtro del contesto si aspetta di trovare l'id della conversazione di ogni contesto di conversazione in un parametro di richiesta nominato <literal>conversationId</literal>. Occorre assicurarsi che questo venga inviato nella richiesta.

source: You are also responsible for ensuring propagation of any new conversation id back to the client. Seam exposes the conversation id as a property of the built in component <literal>conversation</literal>.
it_it: Si è responsabili della propagazione di ogni nuovo id della conversazione attraverso il client. Seam espone l'id di conversazione come proprietà del componente predefinito <literal>conversation</literal>.

source: Adding custom filters
it_it: Aggiunta di filtri personalizzati

source: Seam can install your filters for you, allowing you to specify <emphasis>where</emphasis> in the chain your filter is placed (the servlet specification doesn't provide a well defined order if you specify your filters in a <literal>web.xml</literal>). Just add the <literal>@Filter</literal> annotation to your Seam component (which must implement <literal>javax.servlet.Filter</literal>):
it_it: Seam può installare i filtri per voi, consentendo di specificare <emphasis>dove</emphasis> debba essere collocato il filtro nella catena (la specifica servlet non fornisce un ordine ben definito se si specificano i filtri in <literal>web.xml</literal>). Si aggiunga l'annotazione <literal>@Filter</literal> al componente Seam (che deve implementare <literal>javax.servlet.Filter</literal>):
