Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Configuration.po
Languages: it_it

source: Adding the <literal>@Startup</literal> annotation means thar the component is available during Seam startup; bijection isn't available here (<literal>@BypassInterceptors</literal>); and the filter should be further down the chain than the RichFaces filter (<literal>@Filter(within="org.jboss.seam.web.ajax4jsfFilter")</literal>).
it_it: Aggiungere l'annotazione <literal>@Startup</literal> significa che il componente è disponibile durante lo startup di Seam; la bijection non è disponibile qua (<literal>@BypassInterceptors</literal>); ed il filtro dovrebbe essere più in fondo alla catena rispetto al filtro RichFaces (<literal>@Filter(within="org.jboss.seam.web.ajax4jsfFilter")</literal>).

source: Integrating Seam with your EJB container
it_it: Integrazione di Seam con l'EJB container

source: In a Seam application, EJB components have a certain duality, as they are managed by both the EJB container and Seam. Actually, it's more that Seam resolves EJB component references, manages the lifetime of stateful session bean components, and also participates in each method call via interceptors. Let's start with the configuration of the Seam interceptor chain.
it_it: Nelle applicazioni Seam i componenti EJB hanno una certa dualità, poiché sono gestiti da entrambi: il container EJB e Seam. In verità Seam risolve i riferimenti ai componenti EJB, gestisce il ciclo di vita dei componenti bean con sessione stateful, e partecipa anche ad ogni chiamata di metodo via interceptor. Iniziamo con la configurazione della catena interceptor di Seam.

source: We need to apply the <literal>SeamInterceptor</literal> to our Seam EJB components. This interceptor delegates to a set of built-in server-side interceptors that handle such concerns as bijection, conversation demarcation, and business process signals. The simplest way to do this across an entire application is to add the following interceptor configuration in <literal>ejb-jar.xml</literal>:
it_it: Occorre applicare <literal>SeamInterceptor</literal> ai componenti EJB di Seam. Quest'interceptor delega ad un set di interceptor predefiniti lato server che gestiscono i concern quali la bijection, la demarcazione delle conversazioni ed i segnali del processo di business. Il modo più semplice per fare questo in tutta l'applicazione è aggiungere la seguente configurazione per l'interceptor in <literal>ejb-jar.xml</literal>:

source: Seam needs to know where to go to find session beans in JNDI. One way to do this is specify the <literal>@JndiName</literal> annotation on every session bean Seam component. However, this is quite tedious. A better approach is to specify a pattern that Seam can use to calculate the JNDI name from the EJB name. Unfortunately, there is no standard mapping to global JNDI defined in the EJB3 specification, so this mapping is vendor-specific (and may depend on your own naming conventions as well). We usually specify this option in <literal>components.xml</literal>.
it_it: Seam necessita di sapere dove trovare i session bean in JNDI. Un modo per farlo è specificare l'annotazione <literal>@JndiName</literal> su ogni componente session bean. Comunque questa modalità è abbastanza noiosa. Un approccio migliore è specificare un pattern che Seam usa per calcolare il nome JNDI dal nome EJB. Sfortunatamente nella specifica EJB3 non è definita una mappatura standard al JNDI globale, quindi questa mappatura è specificata dal venditore (e può dipendere anche dalle proprie convenzioni di nome). Solitamente si specifica quest'opzione in <literal>components.xml</literal>.

source: For JBoss AS, the following pattern is correct:
it_it: Per JBoss AS ilseguente pattern è corretto:

source: In this case, <literal>earName</literal> is the name of the EAR in which the bean is deployed, Seam replaces <literal>#{ejbName}</literal> with the name of the EJB, and the final segment represents the type of interface (local or remote).
it_it: In questo caso <literal>earName</literal> è il nome dell'EAR in cui viene deployato il bean, Seam sostituisce <literal>#{ejbName}</literal> con il nome dell'EJB ed il segmento finale rappresenta il tipo di interfaccia (locale o remota).

source: Outside the context of an EAR (when using the JBoss Embeddable EJB3 container), the first segment is dropped since there is no EAR, leaving us with the following pattern:
it_it: Fuori dal contesto di un EAR (quando si usa il container JBoss Embeddable EJB3) il primo segmento viene ignorato poiché non c'è alcun EAR, rimanendo quindi con il seguente pattern:

source: How these JNDI names are resolved and somehow locate an EJB component might appear a bit like black magic at this point, so let's dig into the details. First, let's talk about how the EJB components get into JNDI.
it_it: Come questi nomi JNDI vengono risolti e come localizzare un componente EJB potrebbe apparire a questo punto un pò una questione di magia, quindi indaghiamo meglio i dettagli. Innanzitutto vediamo come i componenti EJB entrano in JNDI.

source: The folks at JBoss don't care much for XML, if you can't tell. So when they designed JBoss AS, they decided that EJB components would get assigned a global JNDI name automatically, using the pattern just described (i.e., EAR name/EJB name/interface type). The EJB name is the first non-empty value from the following list:
it_it: Le persone di JBoss non si preoccupano molto di XML. Quindi quando hanno progettato JBoss AS, hanno deciso che i componenti EJB avrebbero visto assegnarsi automaticamente un nome JNDI globale, usando il pattern appena descritto (cioè nome EAR/nome EJB/tipo interfaccia). Il nome EJB è il primo valore non vuoto della seguente lista:

source: The value of the <literal>&lt;ejb-name&gt;</literal> element in ejb-jar.xml
it_it: Il valore dell'elemento <literal>&lt;ejb-name&gt;</literal> in ejb-jar.xml

source: The value of the <literal>name</literal> attribute in the @Stateless or @Stateful annotation
it_it: Il valore dell'attributo <literal>name</literal> nell'annotazione @Stateless o @Stateful

source: The simple name of the bean class
it_it: Il semplice nome della classe bean

source: Let's look at an example. Assume that you have the following EJB bean and interface defined.
it_it: Guardiamo un esempio. Si assuma di avere definiti il seguente bean EJB ed un'interfaccia.

source: Assuming your EJB bean class is deployed in an EAR named myapp, the global JNDI name myapp/AuthenticatorBean/local will be assigned to it on JBoss AS. As you learned, you can reference this EJB component as a Seam component with the name <literal>authenticator</literal> and Seam will take care of finding it in JNDI according to the JNDI pattern (or <literal>@JndiName</literal> annotation).
it_it: Assumendo che la classe del bean EJB sia deployata in un'applicazione EAR chiamata myapp, il nome JNDI globale myapp/AuthenticatorBean/local verrà assegnato a lei in JBoss AS. Come visto, si può fare riferimento a questo componente EJB come componente Seam con il nome <literal>authenticator</literal> e Seam si preoccuperà di trovarlo in JNDI secondo il pattern JNDI (o l'annotazione <literal>@JndiName</literal>).

source: So what about the rest of the application servers? Well, according to the Java EE spec, which most vendors try to adhere to religiously, you have to declare an EJB reference for your EJB in order for it to be assigned a JNDI name. That requires some XML. It also means that it is up to you to establish a JNDI naming convention so that you can leverage the Seam JNDI pattern. You might find the JBoss convention a good one to follow.
it_it: Ma cosa dire rispetto ai restanti application server? In accordo alla specifica Java EE, alla quale la maggior parte dei venditori cerca di aderire in modo religioso, si deve dichiarare un riferimento EJB per il proprio EJB affinché gli venga assegnato un nome JNDI. Questo richiede un pò di XML. Significa che sta a voi stabilire una convenzione di nomi JNDI per poter sfruttare il pattern JNDI di Seam. Si potrebbe ritenere buona e usare la convenzione JBoss.

source: There are two places you have to define the EJB reference when using Seam on non-JBoss application servers. If you are going to be looking up the Seam EJB component through JSF (in a JSF view or as a JSF action listener) or a Seam JavaBean component, then you must declare the EJB reference in web.xml. Here is the EJB reference for the example component just shown:
it_it: Ci sono due posti dove poter definire il riferimento EJB usando Seam su application server non-JBoss. Se si cercheranno i componenti EJB di Seam attraverso JSF (in una vista JSF o in un action listener JSF) od un componente JavaBean di Seam, allora occorre dichiarare il riferimento EJB in web.xml. Ecco qua il riferimento EJB per il componente d'esempio appena mostrato:

source: This reference will cover most uses of the component in a Seam application. However, if you want to be able to inject a Seam EJB component into another Seam EJB component using <literal>@In</literal>, you need to define this EJB reference in another location. This time, it must be defined in ejb-jar.xml, and it's a bit tricker.
it_it: Questo riferimento coprirà la maggior parte degli usi dei componenti in un'applicazione Seam. Comunque se si vuole essere in grado di iniettare un componente EJB di Seam in un altro componente usando <literal>@In</literal>, occorre definire questo riferimento EJB in un'altra posizione. Questa volta deve essere definito in ejb-jar.xml, ed è un pò più complicato.

source: Within the context of an EJB method call, you have to deal with a somewhat sheltered JNDI context. When Seam attempts to find another Seam EJB component to satisfy an injection point defined using <literal>@In</literal>, whether or not it finds it depends on whether an EJB reference exists in JNDI. Strictly speaking, you cannot simply resolve JNDI names as you please. You have to define the references explicitly. Fortunately, JBoss recognized how aggrevating this would be for the developer and all versions of JBoss automatically register EJBs so they are always available in JNDI, both to the web container and the EJB container. So if you are using JBoss, you can skip the next few paragraphs. However, if you are deploying to GlassFish, pay close attention.
it_it: Dentro il contesto di una chiamata di metodo EJB, occorre avere a che fare con un contesto JNDI protetto. Quando Seam tenta di trovare un altro componente EJB Seam per soddisfare un punto d'iniezione definito con <literal>@In</literal>, il fatto che Seam lo trovi oppure no dipende dal fatto che esista un riferimento EJB in JNDI. In senso letterale non si può semplicemente risolvere i nomi JNDI a proprio piacimento. Occorre definire esplicitamente i riferimenti. Fortunatamente JBoss ha capito come questo sarebbe aggravante per lo sviluppatore e quindi tutte le versioni di JBoss registrano automaticamente gli EJB cosicché siano sempre disponibili in JNDI, sia nel web container sia nell'EJB container. In definitiva se si usa JBoss, si possono saltare i prossimi paragrafi. Comunque, se si usa GlassFish, si presti molta attenzione.

source: For application servers that stubbornly adhere to the EJB specification, EJB references must always be defined explicitly. But unlike with the web context, where a single resource reference covers all uses of the EJB from the web environment, you cannot declare EJB references globally in the EJB container. Instead, you have to specify the JNDI resources for a given EJB component one-by-one.
it_it: Per gli application server che aderiscono testardamente alla specifica EJB, i riferimenti EJB devono sempre essere definititi esplicitamente. Ma diversamente dal contesto web, dove un singolo riferimento di una risorsa copre tutti gli usi di EJB, non si possono dichiarare i riferimenti EJB in modo globale nel container EJB. Invece si devono specificare le risorse JNDI per un dato componente EJB una per una.

source: Let's assume that we have an EJB named RegisterAction (the name is resolved using the three steps mentioned previously). That EJB has the following Seam injection:
it_it: Si assuma di avere un EJB chiamato RegisterAction (nome che viene risolto usando i tre passi menzionati prima). Questo EJB ha la seguente injection Seam:

source: In order for this injection to work, the link must be established in the ejb-jar.xml file as follows:
it_it: Per fare funzionare quest'injection, il link deve essere messo nel file ejb-jar.xml come mostrato:

source: Notice that the contents of the <literal>&lt;ejb-local-ref&gt;</literal> are identical to what we defined in web.xml. What we are doing is bringing the reference into the EJB context where it can be used by the RegisterAction bean. You will need to add one of these references for any injection of a Seam EJB compoenent into another Seam EJB component using <literal>@In</literal>. (You can see an example of this setup in the jee5/booking example).
it_it: Si noti che i contenuti di <literal>&lt;ejb-local-ref&gt;</literal> sono identici a ciò che viene definito in web.xml. Ciò che viene fatto è portare il riferimento nel contesto EJB dove può essere usato dal bean RegisterAction. Occorre aggiungere uno di questi riferimenti per qualsiasi injection di componente EJB Seam in un altro componente EJB Seam con <literal>@In</literal>. (Vedere l'esempio di setup di jee5/booking).

source: But what about <literal>@EJB</literal>? It's true that you can inject one EJB into another using <literal>@EJB</literal>. However, by doing so, you are injecting the actual EJB reference rather than the Seam EJB component instance. In this case, some Seam features will work, while others won't. That's because Seam's interceptor is invoked on any method call to an EJB component. But that only invokes Seam's server-side interceptor chain. What you lose is Seam's state management and Seam's client-side interceptor chain. Client-side interceptors handle concerns such as security and concurrency. Also, when injecting a SFSB, there is no guarantee that you will get the SFSB bound to the active session or conversation, whatever the case may be. Thus, you definitely want to inject the Seam EJB component using <literal>@In</literal>.
it_it: E riguardo <literal>@EJB</literal>? E' vero che si può iniettare un EJB in un altro usando <literal>@EJB</literal>. Comunque, facendo così, si sta iniettando il riferimento EJB piuttosto che l'istanza del componente EJB Seam. In questo caso, alcune funzionalità di Seam funzioneranno, mentre altre no. Questo perchè l'interceptor di Seam viene invocato ad ogni chiamata di metodo in un componente EJB. Ma questo invoca solo la catena dell'interceptor Seam lato server. Ciò che viene persa è la gestione dello stato di Seam e la catena dell'interceptor lato client. Gli interceptor lato client gestiscono i concern quali sicurezza e concorrenza. Inoltre, quando si inietta un SFSB, non c'è garanzia che il SFSB venga associato alla conversazione o sessione attiva, qualunque sia il caso. Quindi si inietterà il componente EJB Seam usando <literal>@In</literal>.

source: That covers how JNDI names are defined and used. The lesson is that with some application servers, such as GlassFish, you are going to have to specify JNDI names for all EJB components explicitly, and sometimes twice! And even if you are following the same naming convention as JBoss AS, the JNDI pattern in Seam may need to be altered. For instance, the global JNDI names are automatically prefixed with java:comp/env on GlassFish, so you need to define the JNDI pattern as follows:
it_it: Vediamo ora come vengono definiti ed usati i nomi JNDI. La lezione riguarda alcuni application server, come GlassFish, con cui occorre specificare i nomi JNDI esplicitamente per tutti i componenti EJB, ed alcune volte in modo doppio! Ed anche se si segue la stessa convenzione di nomi di JBoss AS, il pattern JNDI in Seam deve essere alterato. Per esempio in GlasshFish ai nomi JNDI viene automaticamente aggiunto il prefisso java:comp/env, e quindi occorre definire il pattern JNDI come segue:

source: Finally, let's talk about transactions. In an EJB3 environment, we recommend the use of a special built-in component for transaction management, that is fully aware of container transactions, and can correctly process transaction success events registered with the <literal>Events</literal> component. If you don't add this line to your <literal>components.xml</literal> file, Seam won't know when container-managed transactions end:
it_it: Infine parliamo di transazioni. In un ambiente EJB3 si raccomanda l'uso di un componente speciale predefinito per la gestione delle transazioni, che sia pienamente consapevole delle transazioni del container e possa correttamente processare gli eventi di successo legati alle transazioni registrato con il componente <literal>Events</literal>. Se non viene aggiunta questa linea al file <literal>components.xml</literal>, Seam non saprà quando finiscono le transazioni gestite dal container:

source: Don't forget!
it_it: Non dimenticare!

source: There is one final item you need to know about. You must place a <literal>seam.properties</literal>, <literal>META-INF/seam.properties</literal> or <literal>META-INF/components.xml</literal> file in any archive in which your Seam components are deployed (even an empty properties file will do). At startup, Seam will scan any archives with <literal>seam.properties</literal> files for seam components.
it_it: C'è un ulteriore punto finale da sapere. Occorre mettere un file <literal>seam.properties</literal>, <literal>META-INF/seam.properties</literal> o <literal>META-INF/components.xml</literal> in qualsiasi archivio in cui vengono deployati componenti Seam (anche un file vuoto). All'avvio Seam scansionerà ogni archivio con il file <literal>seam.properties</literal> per cercare componenti seam.

source: In a web archive (WAR) file, you must place a <literal>seam.properties</literal> file in the <literal>WEB-INF/classes</literal> directory if you have any Seam components included here.
it_it: Nel file WAR occorre mettere il file <literal>seam.properties</literal> nella directory <literal>WEB-INF/classes</literal> qualora si abbiano componenti Seam da includere.

source: That's why all the Seam examples have an empty <literal>seam.properties</literal> file. You can't just delete this file and expect everything to still work!
it_it: E' questo il motivo per cui tutti gli esempi Seam hanno un file <literal>seam.properties</literal> vuoto. Non si può cancellare questo file ed attendersi che tutto funzioni!

source: You might think this is silly and what kind of idiot framework designers would make an empty file affect the behavior of their software?? Well, this is a workaround for a limitation of the JVM &#8212; if we didn't use this mechanism, our next best option would be to force you to list every component explicitly in <literal>components.xml</literal>, just like some other competing frameworks do! I think you'll like our way better.
it_it: Si potrebbe ritenere che ciò sia stupido e chiedersi quale stupida razza di designer di framework farebbe influenzare il proprio software da un file vuoto? Questo è un workaroundper una limitazione della JVM &#8212; se non venisse usato questo meccanismo la migliore opzione sarebbe quella di obbligarvi ad elencare esplicitamente in <literal>components.xml</literal> ciascun componente, proprio come fanno gli altri framework! Riflettete su quale sia il modo migliore.

source: Using Alternate JPA Providers
it_it: Uso di provider JPA alternativi

source: Seam comes packaged and configured with Hibernate as the default JPA provider. If you require using a different JPA provider you must tell <literal>seam</literal> about it.
it_it: Seam viene assemblato e configurato con Hibernate in qualità di provider JPA. Se si vuole usare un diverso provider JPA occorre dirlo a <literal>seam</literal>.

source: This is a workaround
it_it: Questo è un workaround

source: Configuration of the JPA provider will be easier in the future and will not require configuration changes, unless you are adding a custom persistence provider implementation.
it_it: La configurazione del provider JPA sarà più semplice in futuro e non richiederà cambiamenti nella configurazione, amenoché non si aggiunga un'implementazione personalizzata del provider di persistenza.

source: Telling seam about a different JPA provider can be be done in one of two ways:
it_it: Comunicare a Seam di usare un altro provider JPA può essere realizzato in uno dei due modi:

source: Update your application's <literal>components.xml</literal> so that the generic <literal>PersistenceProvider</literal> takes precedence over the hibernate version. Simply add the following to the file:
it_it: Si aggiorni il <literal>components.xml</literal> della propria applicazione affinché <literal>PersistenceProvider</literal> abbia la precedenza sulla versione Hibernate. Semplicemente si aggiunga al file:

source: If you want to take advantage of your JPA provider's non-standard features you will need to write you own implementation of the <literal>PersistenceProvider</literal>. Use <literal>HibernatePersistenceProvider</literal> as a starting point (don't forget to give back to the community :). Then you will need to tell <literal>seam</literal> to use it as before.
it_it: Se si vogliono sfruttare le caratteristiche nonstandard del proprio provider JPA occorre scrivere la propria implementazione di <literal>PersistenceProvider</literal>. Si usa <literal>HibernatePersistenceProvider</literal> come punto di partenza (si ricordi di dare qualcosa alla comunità :). Quindi occorrerà dire a <literal>seam</literal> di usarlo come prima.

source: All that is left is updating the <literal>persistence.xml</literal> file with the correct provider class, and what ever properties your provider needs. Don't forget to package your new provider's jar files in the application if they are needed.
it_it: Ciò che rimane da fare è aggiornare il file <literal>persistence.xml</literal> come la giusta classe del provider e quelle proprietà che il provider richiede. Non dimenticare di impacchettare nell'applicazione i file jar del provider se richiesti.

source: Configuring Seam in Java EE 5
it_it: Configurazione di Seam in java EE 5

source: If you're running in a Java EE 5 environment, this is all the configuration required to start using Seam!
it_it: Se si esegue il software in ambiente Java EE 5, questa è tutta la configurazione richiesta per usare Seam!

source: Once you've packaged all this stuff together into an EAR, the archive structure will look something like this:
it_it: Una volta impacchettato assieme tutte queste cose in un EAR, la struttura dell'archivio apparirà così:

source: You should declare <literal>jboss-seam.jar</literal> as an ejb module in <literal>META-INF/application.xml</literal>; <literal>jboss-el.jar</literal> should be placed in the EAR's lib directory (putting it in the EAR classpath.
it_it: Si dovrebbe dichiarare <literal>jboss-seam.jar</literal> come modulo ejb in <literal>META-INF/application.xml</literal>; <literal>jboss-el.jar</literal> dovrebbe essere collocato nella directory lib dell'EAR (mettendolo nel classpath dell'EAR).

source: If you want to use jBPM or Drools, you must include the needed jars in the EAR's lib directory.
it_it: Se si vuole usare jBPM o Drools, occorre includere i jar necessari nella directory lib di EAR.

source: If you want to use facelets (our recommendation), you must include <literal>jsf-facelets.jar</literal> in the <literal>WEB-INF/lib</literal> directory of the WAR.
it_it: Se si vuole usare facelets (consigliato), occorre includere <literal>jsf-facelets.jar</literal> nella directory <literal>WEB-INF/lib</literal> del WAR.
