Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Controls.po
Languages: fr_fr, it_it

source: <literal>#{invalid}</literal> and <literal>#{required}</literal> are available inside <literal>s:decorate</literal>; <literal>#{required}</literal> evaluates to <literal>true</literal> if you have set the input component being decorated as required, and <literal>#{invalid}</literal> evaluates to <literal>true</literal> if a validation error occurs.
fr_fr: <literal>#{invalid}</literal> et <literal>#{required}</literal> sont disponible dans <literal>s:decorate</literal>; <literal>#{required}</literal> est évalué à <literal>true</literal> si vous avez défini que le composant de saisie est décoré comme prévus , et <literal>#{invalid}</literal> évalué à <literal>true</literal> si une erreur de validation apparait.
it_it: <literal>#{invalid}</literal> e <literal>#{required}</literal> sono disponibili dentro <literal>s:decorate</literal>; <literal>#{required}</literal> valuta <literal>true</literal> se si è impostato il componente input da decorare come richiesto, e <literal>#{invalid}</literal> valuta <literal>true</literal> se avviene un errore di validazione.

source: Render a HTML <literal>&lt;div&gt;</literal>.
fr_fr: Rends un<literal>&lt;div&gt;</literal> HTML.
it_it: Genera un <literal>&lt;div&gt;</literal> HTML.

source: Render a HTML <literal>&lt;span&gt;</literal>.
fr_fr: Rend un <literal>&lt;span&gt;</literal> HTML.
it_it: Generare <literal>&lt;span&gt;</literal> HTML.

source: <literal>title</literal> &#8212; Title for a span.
fr_fr: <literal>title</literal> &#8212; Le titre d'un span.
it_it: <literal>title</literal> &#8212; Fornisce un titolo per uno span.

source: A non-rendering component useful for enabling/disabling rendering of it's children.
fr_fr: Un composant non-rendu utile pour activer/désactiver le rendu de ces enfants.
it_it: Un componente non -rendering utile per abilitare/disabilitare il rendering dei suoi figli.

source: "Decorate" a JSF input field with the label. The label is placed inside the HTML <literal>&lt;label&gt;</literal> tag, and is associated with the nearest JSF input component. It is often used with <literal>&lt;s:decorate&gt;</literal>.
fr_fr: "Décore" un champs de saisie JSF avec ce label. Ce label sera placé dans un <literal>&lt;label&gt;</literal>de la balise HTM, et il sera associé avec le composant de saisie JSF le plus proche. C'est souvent utilisé avec <literal>&lt;s:decorate&gt;</literal>.
it_it: "Decora" un campo d'input JSF con l'etichetta. L'etichetta è messa dentro il tag HTML <literal>&lt;label&gt;</literal>, ed è associato al componente d'input JSF più vicino. E' spesso usato con <literal>&lt;s:decorate&gt;</literal>.

source: <literal>style</literal> &#8212; The control's style
fr_fr: <literal>style</literal> &#8212; Le style du controle
it_it: <literal>style</literal> &#8212; Lo stile del controllo

source: <literal>styleClass</literal> &#8212; The control's style class
fr_fr: <literal>styleClass</literal> &#8212; La classe du style du controle
it_it: <literal>styleClass</literal> &#8212; La classe di stile del controllo

source: "Decorate" a JSF input field with the validation error message.
fr_fr: "Décore" un champs de saisie JSF avec le mesage d'erreur de la validation.
it_it: "Decora" un campo d'input JSF con il messaggio d'errore di validazione.

source: Seam Text
fr_fr: Le texte de Seam

source: Checks that the submitted value is valid Seam Text
fr_fr: La vérification que les valeurs soumises sont du Texte de Seam valide
it_it: Controlla che il valore inviato sia un Testo Seam valido.

source: Outputs <emphasis>Seam Text</emphasis>, a rich text markup useful for blogs, wikis and other applications that might use rich text. See the Seam Text chapter for full usage.
fr_fr: Affiche un <emphasis>Seam Text</emphasis>, un texte avec un formatage riche contenant des balises très utiles pour les blogs, les wikis and toute application qui pourait avoir besoin de textes avec un formatage riche. Allez voir le chapitre sur Seam Text pour voir toutes les utilisations.
it_it: Mostra come output <emphasis>Seam Text</emphasis>, un markup di testo utile per blog, wiki ed altre applicazioni che possono usare rich text. Vedere il capitolo di Seam Text per ulteriori informazioni.

source: <literal>value</literal> &#8212; an EL expression specifying the rich text markup to render.
fr_fr: <literal>value</literal> &#8212; un expréssion EL spécifiant que le texte avec un formatage riche à rendre.
it_it: <literal>value</literal> &#8212; un'espressione EL che specifica il markup del testo rich da renderizzare.

source: Example
fr_fr: L'exemple
it_it: Esempio

source: Form support
fr_fr: Le support de formulaire
it_it: Supporto per le form

source: Produces a random token that is inserted into a hidden form field to help to secure JSF form posts against cross-site request forgery (XSRF) attacks. Note that the browser must have cookies enabled to submit forms that include this component.
fr_fr: Produit un jeton aléatoire qui doit être inséré dans un champs caché de formulaire pour aider à sécuriser l'envoie de 'un formulaire contre les attaques "cross-site request forgery (XSRF)". Notez que le navigateur doit avoir les cookies actifs pour permettre de soumettre le formulaire qui est inlus avec ce composant.
it_it: Produce un token casuale che viene inserito in un campo di form nascosta per aiutare rendere sicuro i post della form JSF contro attacchi cross-site request forgery (XSRF). Si noti che il browser deve avere abilitati i cookie per poter eseguire il submit delle form che includono questo componente.

source: <literal>requireSession</literal> &#8212; indicates whether the session id should be included in the form signature, hence binding the token to the session. This value can be set to false if the "build before restore" mode of Facelets is activated (the default in JSF 2.0). (default: false)
fr_fr: <literal>requireSession</literal> &#8212; indique que l'identifiant de session devrait être inclus dans la signature du formulaire, améliorant la liaison entre le jeton et la session. Cette valeur peut être défini à faux si le mode "construire avant de restorer" des Facelets est activé (par défaut en JSF 2.0). (par défaut: false)
it_it: <literal>requireSession</literal> &#8212; indica se l'id di sessione debba essere incluso nella signature della form, da qui il binding del token alla sessione. Questo valore può essere impostato a false se viene attivata la modalità "build before restore" dei Facelets (di default in JSF 2.0). (Default: false)

source: <literal>enableCookieNotice</literal> &#8212; indicates that a JavaScript check should be inserted into the page to verify that cookies are enabled in the browser. If cookies are not enabled, present a notice to the user that form posts will not work. (default: false)
fr_fr: <literal>enableCookieNotice</literal> &#8212; indiqye que la vérification en JavaScript peut être insérée dans la page pour vérifier que les cookies sont activés dans le navigateur. Si les cookies ne sont pas activés, affiche une information pour l'utilisateur ques les formulaires postées ne font pas fonctionner. (par déefaut: false)
it_it: <literal>enableCookieNotice</literal> &#8212; indica che deve essere inserito nella pagina un check JavaScript per verificare che i cookie siano abilitati nel browser. Se i cookie non sono abilitati, viene presentata all'utente una nota riportante che l'invio della form non è avvenuto. (Default: false)

source: <literal>allowMultiplePosts</literal> &#8212; indicates whether to allow the same form to be submitted multiple times with the same signature (as long as the view does not change). This is a common need if the form is perform Ajax calls but not rerendering itself or, at the very least, the UIToken component. The preferred approach is to have the UIToken component rerendered on any Ajax call where the UIToken component would be processed. (default: false)
fr_fr: <literal>allowMultiplePosts</literal> &#8212; indique que cela autorise le même formulaire à être soumis plusieurs fois avec la même signature (aussi longtemps qye la vue ne change pas). C'est un besoin classique dans le formulaire qui réalise des appels Ajax mais ne se ré-affiche pas lui-même ou, en dernière extrémitée, le composant UIToken. TM'approche a préférer est d'avoir le composant UIToken ré-affichant tout appel à Ajax où le composant UIToken devrait être exécuté. (par défaut: false)
it_it: <literal>allowMultiplePosts</literal> &#8212; indica se consentire che la stessa form venga inviata più volte con la stessa signature (finché non cambia la vista). Questa è una necessità comune se la form esegue chiamate Ajax ma non rigenera se stessa o, almeno, il componente UIToken. L'approccio migliore è avere il componente UIToken rigenerato su ogni chiamata Ajax in cui il componente UIToken viene processato. (Default: false)

source: Creates a <literal>SelectItem</literal> from an enum value.
fr_fr: Création d'un <literal>SelectItem</literal> depuis une valeur énumérée.
it_it: Crea un <literal>SelectItem</literal> da un valore enum.

source: <literal>enumValue</literal> &#8212; the string representation of the enum value.
fr_fr: <literal>enumValue</literal> &#8212; la représentation en texte d'une valeur énumérée.
it_it: <literal>enumValue</literal> &#8212; la rappresentazione stringa di un valore enum.

source: <literal>label</literal> &#8212; the label to be used when rendering the <literal>SelectItem</literal>.
fr_fr: <literal>label</literal> &#8212; le label à utiliser pendant le rendu de <literal>SelectItem</literal>.
it_it: <literal>label</literal> &#8212; l'etichetta da usare per renderizzare il <literal>SelectItem</literal>.

source: Creates a <literal>List&lt;SelectItem&gt;</literal> from a List, Set, DataModel or Array.
fr_fr: Créer un <literal>List&lt;SelectItem&gt;</literal> depuis un type suivant List, Set, DataModel ou Array.
it_it: Crea una <literal>List&lt;SelectItem&gt;</literal> daList, Set, DataModel o Array.

source: <literal>value</literal> &#8212; an EL expression specifying the data that backs the <literal>List&lt;SelectItem&gt;</literal>
fr_fr: <literal>value</literal> &#8212; une expression EL spécifiant que les données qui encadrent le <literal>List&lt;SelectItem&gt;</literal>
it_it: <literal>value</literal> &#8212; un'espressione EL che specifica i dati retrostanti a <literal>List&lt;SelectItem&gt;</literal>

source: <literal>var</literal>&#8212; defines the name of the local variable that holds the current object during iteration
fr_fr: <literal>var</literal>&#8212; défini le nom de la variable locale qui conserve l'objet courrant pendant l'itération
it_it: <literal>var</literal>&#8212; definisce il nome della variabile locale che mantiene l'oggetto corrente durante l'iterazione

source: <literal>label</literal> &#8212; the label to be used when rendering the <literal>SelectItem</literal>. Can reference the <literal>var</literal> variable.
fr_fr: <literal>label</literal> &#8212; le label à utiliser pendant le rendue de <literal>SelectItem</literal>. Peut référencer la variable <literal>var</literal>.
it_it: <literal>label</literal> &#8212; l'etichetta da usare per generare <literal>SelectItem</literal>. Può fare riferimento alla variabile <literal>var</literal>.

source: <literal>itemValue</literal> &#8212; Value to return to the server if this option is selected. Optional, by default the <literal>var</literal> object is used. Can reference the <literal>var</literal> variable.
fr_fr: <literal>itemValue</literal> &#8212; La valeur à retourner au serveur si l'option est sélectionné. Optionnellement, par défaut l'objet <literal>var</literal> est utilisé. Peut référencer la variable <literal>var</literal>.
it_it: <literal>itemValue</literal> &#8212; Il valore da restituire al server se quest'opzione è selezionata. E' opzionale, di default viene usato l'oggetto <literal>var</literal>. Può fare riferimento alla variabile <literal>var</literal>.

source: <literal>disabled</literal> &#8212; if true the <literal>SelectItem</literal> will be rendered disabled. Can reference the <literal>var</literal> variable.
fr_fr: <literal>disabled</literal> &#8212; si vrai le <literal>SelectItem</literal> sera rendu désactivé. Peut référencer la variable <literal>var</literal>.
it_it: <literal>disabled</literal> &#8212; se true il <literal>SelectItem</literal> verrà generato disabilitato. Può fare riferimento alla variabile <literal>var</literal>.

source: <literal>noSelectionLabel</literal> &#8212; specifies the (optional) label to place at the top of list (if <literal>required="true"</literal> is also specified then selecting this value will cause a validation error).
fr_fr: <literal>noSelectionLabel</literal> &#8212; spécifie le label (optionnel) à placer en haut de la liste (si <literal>required="true"</literal> est aussi spécifié alors la sélection de la valeur déclenchera une erreur de validation).
it_it: <literal>noSelectionLabel</literal> &#8212; specifica l'etichetta (opzionale) da mettere in cima alla lista (se è specificato anche <literal>required="true"</literal> allora selezionando questo valore può causare una validazione d'errore).

source: <literal>hideNoSelectionLabel</literal> &#8212; if true, the <literal>noSelectionLabel</literal> will be hidden when a value is selected
fr_fr: <literal>hideNoSelectionLabel</literal> &#8212; si vrai, le <literal>noSelectionLabel</literal> sera masqué quand une valeur est sélectionné
it_it: <literal>hideNoSelectionLabel</literal> &#8212; se true, <literal>noSelectionLabel</literal>verrà nascosto quando viene selezionato il valore.

source: Renders a file upload control. This control must be used within a form with an encoding type of <literal>multipart/form-data</literal>, i.e:
fr_fr: Rend un control de téléchargement de fichier. Ce control doit être utilisé dans un formulaire avec un type d'encodage <literal>multipart/form-data</literal>, autrement dit:
it_it: Renderizza un controllo per l'upload del file. Questo controllo deve essere usato dentro la form con tipo di codifica <literal>multipart/form-data</literal>, cioè:

source: For multipart requests, the Seam Multipart servlet filter must also be configured in <literal>web.xml</literal>:
fr_fr: Pour les requêtes multipart, le filtre de servlet Multipart de Seam doit aussi être configuré dans <literal>web.xml</literal>:
it_it: Per richieste multiple, in <literal>web.xml</literal> deve essere configurato il filtro servlet Seam Multipart :

source: The following configuration options for multipart requests may be configured in components.xml:
fr_fr: Les options de configurations suivant pour les requêtes multipart peuvent être configuré dans components.xml:
it_it: Le seguenti opzioni di configurazioni per richieste multipart possono essere configurate in components.xml:

source: <literal>createTempFiles</literal> &#8212; if this option is set to true, uploaded files are streamed to a temporary file instead of in memory.
fr_fr: <literal>createTempFiles</literal> &#8212; si cette option est définie à true, les fichiers téléchargé seront stocké dans un fichier temporaire au lieu d'être en mémoire.
it_it: <literal>createTempFiles</literal> &#8212; se quest'opzione è impostata a true, i file caricati vengono accodati in un file temporaneo invece che in memoria.

source: <literal>maxRequestSize</literal> &#8212; the maximum size of a file upload request, in bytes.
fr_fr: <literal>maxRequestSize</literal> &#8212; la taille maximale de la requête de téléchargement de fichier, en octets.
it_it: <literal>maxRequestSize</literal> &#8212; dimensione massima della richiesta di upload file, in byte.

source: Here's an example:
fr_fr: Voici un exemple:
it_it: Ecco un esempio:

source: <literal>data</literal> &#8212; this value binding receives the binary file data. The receiving field should be declared as a <literal>byte[]</literal> or <literal>InputStream</literal> (required).
fr_fr: <literal>data</literal> &#8212; ette valeur correspondante reçoit les données binaire du fichier. Le champs de réception doit êtree déclaré comme un <literal>byte[]</literal> ou un <literal>InputStream</literal> (nécéssaire).
it_it: <literal>data</literal> &#8212; questo value binding riceve i dati binari. Il campo ricevente deve essere dichiarato come <literal>byte[]</literal> o <literal>InputStream</literal> (richiesto).

source: <literal>contentType</literal> &#8212; this value binding receives the file's content type (optional).
fr_fr: <literal>contentType</literal> &#8212; cette valeur correspondante recoit le type du contenu de fichier (optionnel).
it_it: <literal>contentType</literal> &#8212; questo value binding riceve il contenuto del file (opzionale).

source: <literal>fileName</literal> &#8212; this value binding receives the filename (optional).
fr_fr: <literal>fileName</literal> &#8212; cette valeur correspondate reçois le nom du fichier (optionnel).
it_it: <literal>fileName</literal> &#8212; questo value binding riceve il nome del file (opzionale).

source: <literal>fileSize</literal> &#8212; this value binding receives the file size (optional).
fr_fr: <literal>fileSize</literal> &#8212; cette valeur correspondante reçois la taille du fichier (optionnelle).
it_it: <literal>fileSize</literal> &#8212; questo valore di binding riceve la dimensione del file (opzionale).

source: <literal>accept</literal> &#8212; a comma-separated list of content types to accept, may not be supported by the browser. E.g. <literal>"images/png,images/jpg"</literal>, <literal>"images/*"</literal>.
fr_fr: <literal>accept</literal> &#8212; une liste séparée de virgules de types de contenu, peut ne pas être supporté par le navigateur. Par exemple <literal>"images/png,images/jpg"</literal>, <literal>"images/*"</literal>.
it_it: <literal>accept</literal> &#8212; una lista separata da virgola con i tipi di contenuto da accettare, può non essere supportata dal browser. Esempio: <literal>"images/png,images/jpg"</literal>, <literal>"images/*"</literal>.

source: Other
fr_fr: Divers
it_it: Altro

source: Cache the rendered page fragment using JBoss Cache. Note that <literal>&lt;s:cache&gt;</literal> actually uses the instance of JBoss Cache managed by the built-in <literal>pojoCache</literal> component.
fr_fr: Met en cache le fragment de page rendue en utilisant JBoss Cache. Notez que <literal>&lt;s:cache&gt;</literal> utilise actuellement l'instance de JBoss Cache géré par le composant livré <literal>pojoCache</literal>.
it_it: Mette nella cache il frammento di pagina renderizzato usando JBoss Cache. Si noti che <literal>&lt;s:cache&gt;</literal> in verità usa l'istanza di JBoss Cache gestita dal componente predefinito <literal>pojoCache</literal>.

source: <literal>key</literal> &#8212; the key to cache rendered content, often a value expression. For example, if we were caching a page fragment that displays a document, we might use <literal>key="Document-#{document.id}"</literal>.
fr_fr: <literal>key</literal> &#8212; la clef vers le contenu rendu mit en cache, souvent une expression de valeur. Par exemple, si nous mettons en cache un fragment de page qui affiche un document, nous devrions utiliser <literal>key="Document-#{document.id}"</literal>.
it_it: <literal>key</literal> &#8212; la chiave per memorizzare (cache) il contenuto renderizzato, spesso un'espressione di valore. Per esempio, se si mette nella cache un frammento di pagina che mostra un documento, si può usare <literal>key</literal> &#8212;

source: <literal>enabled</literal> &#8212; a value expression that determines if the cache should be used.
fr_fr: <literal>enabled</literal> &#8212; une expression de valeur qui détermine si le couche devrait être utilisé.
it_it: <literal>enabled</literal> &#8212; un'espressione di valore che determina se la cache debba essere usata.

source: <literal>region</literal> &#8212; a JBoss Cache node to use (different nodes can have different expiry policies).
fr_fr: <literal>region</literal> &#8212; un noeud JBoss Cache à utiliser (differents noeuds peuvent avoir des politiques d'expirations différentes).
it_it: <literal>region</literal> &#8212; un node JBoss Cache da usare (nodi differenti possono avere differenti policy di scadenza).

source: A tag that acts a file download provider. It must be alone in the JSF page. To be able to use this contol, web.xml must be set up as follows.
fr_fr: Ue balise qui fonctionne comme un fournissuer de téléchargement de fichier. Elle doit être seule dans la page JSF. Pour pouvoir utiliser ce control, web.xml doit être configuré comme ceci.
it_it: Un tag che agisce come fornitore di download dei file. Deve essere il solo nella pagina JSF. Per essere in grado di usare questo controllo, web.xml deve essere impostato come segue.

source: <literal>data</literal> &#8212; Data that should be downloaded. May be a java.util.File, an InputStream or a byte array.
fr_fr: <literal>data</literal> &#8212; Les données qui devrait être téléchargées. Peuvent être un java.util.File, un InputStream ou un tableau d'octet.
it_it: <literal>data</literal> &#8212; I dati da downloadare. Può essere java.util.File, InputStream o un byte array.

source: <literal>fileName</literal> &#8212; Filename of the file to be served
fr_fr: <literal>fileName</literal> &#8212; Nom de fichier qui doit être servis
it_it: <literal>fileName</literal> &#8212; Nome del file da servire

source: <literal>contentType</literal> &#8212; content type of the file to be downloaded
fr_fr: <literal>contentType</literal> &#8212; type contenu du fichier à télécharger
it_it: <literal>contentType</literal> &#8212; tipo di contenuto del file da scaricare

source: <literal>disposition</literal> &#8212; disposition to use. Default is inline
fr_fr: <literal>disposition</literal> &#8212; la disposition à utiliser. Par défaut c'est inline
it_it: <literal>disposition</literal> &#8212; disposizione da usare. Di default è inline

source: Here is an example on how to use the tag:
fr_fr: Voici un exemple de comment utiliser ces balises:
it_it: Ecco un esempio su come usare il tag:

source: The bean named <literal>resources</literal> is some backing bean that given some request parameters servers a specific file, see <literal>s:download</literal>.
fr_fr: Le bean dénommé <literal>resources</literal> est le bean de renfort qui donne des paramètres de requête et délivre un fichier spécifique, voir <literal>s:download</literal>.
it_it: Il bean chiamato <literal>resources</literal> fornisce al file i parametri di richiesta del server, si veda <literal>s:download</literal>.

source: Builds a RESTful link to a <literal>&lt;s:resource&gt;</literal>. Nested <literal>f:param</literal> build up the url.
fr_fr: Construit un lien RESTful vers une <literal>&lt;s:resource&gt;</literal>. Encapsule <literal>f:param</literal> pour construire l'url.
it_it: Costruisce un link RESTful a <literal>&lt;s:resource&gt;</literal>. <literal>f:param</literal> innestati costruiscono l'url.

source: <literal>src</literal> &#8212; Resource file serving files.
fr_fr: <literal>src</literal> &#8212; Fichier de ressource distribuant les fichiers.
it_it: <literal>src</literal> &#8212; I file che servono al file di risorsa.

source: Will produce something like: <literal><![CDATA[http://localhost/resources.seam?fileId=1]]></literal>
fr_fr: Sera produira quelque chose comme: <literal><![CDATA[http://localhost/resources.seam?fileId=1]]></literal>
it_it: Genererà qualcosa di simile a: <literal><![CDATA[http://localhost/resources.seam?fileId=1]]></literal>
