Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Controls.po
Languages: fr_fr, it_it

source: An extended <literal>&lt;h:graphicImage&gt;</literal> that allows the image to be created in a Seam Component; further transforms can be applied to the image.
fr_fr: Une extension de <literal>&lt;h:graphicImage&gt;</literal> qui permet à l'image d'être cré dans un Seam Component; d'autres transformation peuvent être appliqué à l'image.
it_it: Un <literal>&lt;h:graphicImage&gt;</literal> esteso che consente all'immagine di essere creata in un componente Seam; possono essere applicate all'immagine altre trasformazioni.

source: All attributes for <literal>&lt;h:graphicImage&gt;</literal> are supported, as well as:
fr_fr: Tous les attributs de <literal>&lt;h:graphicImage&gt;</literal> sont supportés, à l'identique:
it_it: Tutti gli attributi per <literal>&lt;h:graphicImage&gt;</literal> sono supportati, così come:

source: <literal>value</literal> &#8212; image to display. Can be a path <literal>String</literal> (loaded from the classpath), a <literal>byte[]</literal>, a <literal>java.io.File</literal>, a <literal>java.io.InputStream</literal> or a <literal>java.net.URL</literal>. Currently supported image formats are <literal>image/png</literal>, <literal>image/jpeg</literal> and <literal>image/gif</literal>.
fr_fr: <literal>value</literal> &#8212; image à afficher. Peut être un chemin<literal>String</literal> (chargé depuis le classpath), un <literal>byte[]</literal>, un <literal>java.io.File</literal>, un <literal>java.io.InputStream</literal> ou un <literal>java.net.URL</literal>. Les formats d'images courrant supportés sont <literal>image/png</literal>, <literal>image/jpeg</literal> et <literal>image/gif</literal>.
it_it: <literal>value</literal> &#8212; immagine da visualizzare. Può essere un path <literal>String</literal> (caricato dal classpath), un <literal>byte[]</literal>, un <literal>java.io.File</literal>, un <literal>java.io.InputStream</literal> o un <literal>java.net.URL</literal>. I formati d'immagine supportati sono <literal>image/png</literal>, <literal>image/jpeg</literal> e <literal>image/gif</literal>.

source: <literal>fileName</literal> &#8212; if not specified the served image will have a generated file name. If you want to name your file, you should specify it here. This name should be unique
fr_fr: <literal>fileName</literal> &#8212; s'il n'est pas indiqué l'image servie aura un nom de fichier générée. Si vous voulez nommé votre fichier, vous devriez l'indiquer ici. Ce nom devrait être unique
it_it: <literal>fileName</literal> &#8212; se non specificato l'immagine servita avrà un nome di file generato. Se si vuole nominare il file, occorre specificarlo in questo attributo. Il nome deve essere univoco.

source: Transformations
fr_fr: Les transformations
it_it: Trasformazioni

source: To apply a transform to the image, you would nest a tag specifying the transform to apply. Seam currently supports these transforms:
fr_fr: Pour appliquer une transormation à une image, vous pouvez inclure une balise spécifiant la transformation à appliquer. Seam supporte actuellement ces transformations:
it_it: Per applicare una trasformazione all'immagine, occorre innestare un tag specificando la trasformazione da applicare. Seam attualmente supporta queste trasformazioni:

source: <literal>width</literal> &#8212; new width of the image
fr_fr: <literal>width</literal> &#8212; nouvelle largeur de l'image
it_it: <literal>width</literal> &#8212; nuova larghezza dell'immagine

source: <literal>height</literal> &#8212; new height of the image
fr_fr: <literal>height</literal> &#8212;nouvelle hauteur de l'image
it_it: <literal>height</literal> &#8212; nuova altezza dell'immagine

source: <literal>maintainRatio</literal> &#8212; if <literal>true</literal>, and <emphasis>one</emphasis> of <literal>width</literal>/<literal>height</literal> are specified, the image will be resized with the dimension not specified being calculated to maintain the aspect ratio.
fr_fr: <literal>maintainRatio</literal> &#8212; Si <literal>true</literal>, et <emphasis>one</emphasis> de <literal>width</literal>/<literal>height</literal> sont spécifiés, l'image sera retaillée, la dimension non-identiquée sera calculé pour maintenir le ratio.
it_it: <literal>maintainRatio</literal> &#8212; se vengono specificati <literal>true</literal>, ed <emphasis>uno</emphasis> fra <literal>width</literal>/<literal>height</literal>, l'immagine sarà ridimensionata con la dimensione non specificata che viene calcolata per mantenere l'aspect ratio.

source: <literal>factor</literal> &#8212; scale the image by the given factor
fr_fr: <literal>factor</literal> &#8212; met à l'echelle l'image du facteur indiqué
it_it: <literal>factor</literal> &#8212; scala l'immagine col dato fattore

source: <literal>radius</literal> &#8212; perform a convolution blur with the given radius
fr_fr: <literal>radius</literal> &#8212; réaliser un flou de convolution avec un rayon donné
it_it: <literal>radius</literal> &#8212; esegue una convolution blur con il raggio dato

source: <literal>contentType</literal> &#8212; alter the type of the image to either <literal>image/jpeg</literal> or <literal>image/png</literal>
fr_fr: <literal>contentType</literal> &#8212; altère le type de l'image à <literal>image/jpeg</literal> ou à <literal>image/png</literal>
it_it: <literal>contentType</literal> &#8212; modifica il tipo d'immagine in <literal>image/jpeg</literal> o <literal>image/png</literal>

source: It's easy to create your own transform - create a <literal>UIComponent</literal> which implements <literal>org.jboss.seam.ui.graphicImage.ImageTransform</literal>. Inside the <literal>applyTransform()</literal>method use <literal>image.getBufferedImage()</literal> to get the original image and <literal>image.setBufferedImage()</literal> to set your transformed image. Transforms are applied in the order specified in the view.
fr_fr: Il est facile de créer votre propre transformation - créez un <literal>UIComponent</literal> qui implémente <literal>org.jboss.seam.ui.graphicImage.ImageTransform</literal>. A l'intérieur d'une méthode <literal>applyTransform()</literal> utilisant <literal>image.getBufferedImage()</literal> pour obtenir l'image originelle et <literal>image.setBufferedImage()</literal> pour affecter votre image transformée. Les transformations sont appliqué dans l'odre spécifié dans la vue.
it_it: E' facile creare una trasformazione - si crei un <literal>UIComponent</literal> che implementi <literal>org.jboss.seam.ui.graphicImage.ImageTransform</literal>. Dentro il metodo <literal>applyTransform()</literal> si usi <literal>image.getBufferedImage()</literal> per recuperare l'immagine originale e <literal>image.setBufferedImage()</literal> per impostare l'immagine trasformata. Le trasformazioni sono applicare nell'ordine specificato nella vista.

source: Generates the Javascript stubs required to use Seam Remoting.
fr_fr: Génération des squelettes Javascript nécéssaire pour l'utilisation de Seam Remoting.
it_it: Genera gli stub Javascript richiesti per usare Seam Remoting.

source: <literal>include</literal> &#8212; a comma-separated list of the component names (or fully qualified class names)for which to generate Seam Remoting Javascript stubs. See <xref linkend="remoting"/> for more details.
fr_fr: <literal>include</literal> &#8212; une liste séparée par des virrgules de noms de composants (ou de nomes de classe pleinement qualifiés) pour lesquels il faut générer les squelettes de Seam Remoting Javascript stubs. Voir <xref linkend="remoting"/> pour plus de détails.
it_it: <literal>include</literal> &#8212; una lista separata da virgola di nomi di componenti (o nome pienamente qualificati) per i quali generare stub Seam Remoting Javascript. Si veda <xref linkend="remoting"/> per maggiori dettagli.

source: Annotations
fr_fr: Les annotations
it_it: Annotazioni

source: Seam also provides annotations to allow you to use Seam components as JSF converters and validators:
fr_fr: Seam fourni aussi des annotations pour vous permettre d'utiliser les composants de Seam comme un convertisseur de JSF et les validateurs:
it_it: Seam fornisce anche annotazioni che permettono di impiegare i componenti Seam come convertitori JSF e validatori:

source: Registers the Seam component as a JSF converter. Shown here is a converter which is able to access the JPA EntityManager inside a JTA transaction, when converting the value back to it's object representation.
fr_fr: Enregistre le composant de Seam comme un convertisseur JSF. Visible ici un convertisseur qui est capable d'accéder au JPA EntityManager dans une transaction JTA, pendant la conversion d'une valeur vers sa représentation comme objet.
it_it: Registra il componente Seam come converter JSF. Qua è mostrato un converter capace di accedere all'EntityManager JPA dentro ad una transazione JTA, quando converte il valore legato alla rappresentazione del suo oggetto.

source: Registers the Seam component as a JSF validator. Shown here is a validator which injects another Seam component; the injected component is used to validate the value.
fr_fr: Enregistre le composant de Seam comme un validateur JSF. Visible ici une validateur qui injecte un autre composant de Seam, le composant injecté est utilisé pour valider la valeur.
it_it: Registra il componente Seam come validatore JSF. Qua è mostrato un validatore che inietta un altro componente Seam; il componente iniettato è usato per validare il valore.

source: Description
it_it: Descrizione
