Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Controls.po
Languages: fr_fr, it_it

source: Seam JSF controls
fr_fr: Les contrôles JSF de Seam
it_it: Controlli JSF di Seam

source: Seam includes a number of JSF controls that are useful for working with Seam. These are intended to complement the built-in JSF controls, and controls from other third-party libraries. We recommend JBoss RichFaces, ICEsoft ICEfaces and Apache MyFaces Trinidad tag libraries for use with Seam. We do not recommend the use of the Tomahawk tag library.
fr_fr: Seam inclus de nombreux contrôles JSF qui sont très utile pour travailler avec Seam. Leur but est d'essayer de compléter les contrôles JSF livrés, et les contrôles provenant de bibliothèques tierces partites. Nous recommandons les bibliothèques de balises Ajax4JSF et ADF faces (maintenant Trinidad) à utiliser avec Seam. Nous ne recommandons pas l'utilisation de la bibliothèque de balises Tomahawk.
it_it: Seam include un numero di controlli JSF che sono utili per lavorare con Seam. Sono intesi comecomplemento ai controlli predefiniti JSF, e ai controlli di librerie di terze parti. Si raccomanda l'uso in Seam dei tag presenti nelle librerie di JBoss RichFaces, ICEsoft ICEfaces e Apache MyFaces Trinidad. Non si raccomanda l'uso dei tag della libreria Tomahawk.

source: Tags
fr_fr: Les balises
it_it: Tag

source: To use these tags, define the "<literal>s</literal>" namespace in your page as follows (facelets only):
fr_fr: Pour utiliser ces balises, définissez l'espace de nommage "<literal>s</literal>" dans votre page comme ci-dessous (seulement pour les facelets):
it_it: Per usare questi tag si definisce il namespace "<literal>s</literal>" nella propria pagina come segue (solo facelets):

source: The ui example demonstrates the use of a number of these tags.
fr_fr: L'exemple ui (NdT: user interface=interface utilisateur) montre l'utilisation de nombreuses balises.
it_it: L'esempio ui mostra l'uso di diversi tag.

source: Navigation Controls
fr_fr: Les contrôle de navigation
it_it: Controlli di navigazione

source: A button that supports invocation of an action with control over conversation propagation. <emphasis>Does not submit the form.</emphasis>
fr_fr: Un bouton qui permet l'invication d'un action qui prends le control sur la propagation de la conversation.<emphasis>Ne soumet pas le formulaire.</emphasis>
it_it: Un pulsante che supporta l'invocazione di un'azione con controllo sulla propagazione della conversazione. <emphasis>Non effettua il submit della form.</emphasis>

source: Attributes
fr_fr: Attribus
it_it: Attributi

source: <literal>value</literal> &#8212; the label.
fr_fr: <literal>value</literal> &#8212; le label.
it_it: <literal>value</literal> &#8212; l'etichetta.

source: <literal>action</literal> &#8212; a method binding that specified the action listener.
fr_fr: <literal>action</literal> &#8212; une méthode en liaison qui spécifie l'écouteur d'action.
it_it: <literal>action</literal> &#8212; un metodo di binding che specifica l'action listener.

source: <literal>view</literal> &#8212; the JSF view id to link to.
fr_fr: <literal>view</literal> &#8212; l'identifiant de vue JSF à lier avec.
it_it: <literal>view</literal> &#8212; l'id della vista JSF a cui fare riferimento.

source: <literal>fragment</literal> &#8212; the fragment identifier to link to.
fr_fr: <literal>fragment</literal> &#8212; l'identifier de fragment à lier avec.
it_it: <literal>fragment</literal> &#8212; l'identificatore del frammento a cui fare riferimento.

source: <literal>disabled</literal> &#8212; is the link disabled?
fr_fr: <literal>disabled</literal> &#8212; ce lien est il désactivé?
it_it: <literal>disabled</literal> &#8212; il link è disabilitato?

source: <literal>propagation</literal> &#8212; determines the conversation propagation style: <literal>begin</literal>, <literal>join</literal>, <literal>nested</literal>, <literal>none</literal>, <literal>end</literal> or <literal>endRoot</literal>.
fr_fr: <literal>propagation</literal> &#8212; détermine le style de propagation de la conversation: <literal>begin</literal>, <literal>join</literal>, <literal>nested</literal>, <literal>none</literal>, <literal>end</literal> ou <literal>endRoot</literal>.
it_it: <literal>propagation</literal> &#8212; determina lo stile della propagazione della conversazione: <literal>begin</literal>, <literal>join</literal>, <literal>nested</literal>, <literal>none</literal>, <literal>end</literal> o <literal>endRoot</literal>.

source: <literal>pageflow</literal> &#8212; a pageflow definition to begin. (This is only useful when <literal>propagation="begin"</literal> or <literal>propagation="join"</literal> is used).
fr_fr: <literal>pageflow</literal> &#8212; une définition d'enchainement de page pour démarrer. (Ceci est seulement utile quand <literal>propagation="begin"</literal> ou <literal>propagation="join"</literal> sont utilisés).
it_it: <literal>pageflow</literal> &#8212; una definizione di pageflow da avviare. (E' utile solamente quando vengono usati <literal>propagation="begin"</literal> oppure <literal>propagation="join"</literal>).

source: Usage
fr_fr: Utilisation
it_it: Utilizzo

source: You can specify both <literal>view</literal> and <literal>action</literal> on <literal>&lt;s:link /&gt;</literal>. In this case, the action will be called once the redirect to the specified view has occured.
fr_fr: Viys oiuvez spécifier à la fois la <literal>view</literal> et l'<literal>action</literal> sur un <literal>&lt;s:link /&gt;</literal>. Dans ce cas, l'action ne sera appelée qu'une fois quand la rediction vers la vue spécifique interviendra.
it_it: Si possono specificare sia <literal>view</literal> sia <literal>action</literal> in <literal>&lt;s:link /&gt;</literal>. In questo caso, l'azione verrà chiamata non appena avviene il redirect alla vista specificata.

source: The use of action listeners (including the default JSF action listener) is not supported with <literal>&lt;s:button /&gt;</literal>.
fr_fr: L'utilisation d'écouteurs d'action (incluant l'écouteur d'action par défaut de JSF ) n'est pas supporté avec <literal>&lt;s:button /&gt;</literal>.
it_it: L'uso degli action listener (incluso l'action listener di default JSF) non è supportato da <literal>&lt;s:button /&gt;</literal>.

source: Add the conversation id to JSF link or button (e.g. <literal>&lt;h:commandLink /&gt;</literal> , <literal>&lt;s:button /&gt;</literal>).
fr_fr: Ajoute l'identifiant de conversation au lien JSF ou au bouton (autrement dit. <literal>&lt;h:commandLink /&gt;</literal> , <literal>&lt;s:button /&gt;</literal>).
it_it: Aggiunge l'id di conversazione al link o bottone JSF (es. <literal>&lt;h:commandLink /&gt;</literal> , <literal>&lt;s:button /&gt;</literal>).

source: None
fr_fr: Aucun
it_it: Nessuno

source: Add the task id to an output link (or similar JSF control), when the task is available via <literal>#{task}</literal>.
fr_fr: Ajoute l'identifiant de tâche à un lien sortant (ou à un controle JSF similaire) quand la tâche est disponible via <literal>#{task}</literal>.
it_it: Aggiunge l'id del task all'output link (o controllo JSF simile), quando il task è disponibile via <literal>#{task}</literal>.

source: None.
fr_fr: Aucun.
it_it: Nessuno.

source: A link that supports invocation of an action with control over conversation propagation. <emphasis>Does not submit the form.</emphasis>
fr_fr: Un lien qui permet l'invocation d'une action avec un contrôle sur la propagation de la conversation. <emphasis>Ne soumet pas le formulaire.</emphasis>
it_it: Un link che supporta l'invocazione di un'azione con controllo sulla propagazione della conversazione. <emphasis>Non esegue il submit della form.</emphasis>

source: The use of action listeners (including the default JSF action listener) is not supported with <literal>&lt;s:link /&gt;</literal>.
fr_fr: L'utilisation d'écouteurs d'action (incluant l'écouteur d'action par défaut de JSF ) n'est pas supporté avec <literal>&lt;s:link /&gt;</literal>.
it_it: L'uso degli action listener (incluso l'action listener di default JSF) non è supportato da <literal>&lt;s:link /&gt;</literal>.

source: <literal>pageflow</literal> &#8212; a pageflow definition to begin. (This is only useful when using <literal>propagation="begin"</literal> or <literal>propagation="join"</literal>.)
fr_fr: <literal>pageflow</literal> &#8212; un définition d'enchainement de page commence. (C'est seulement utile avec l'utilisation <literal>propagation="begin"</literal> ou <literal>propagation="join"</literal>.)
it_it: <literal>pageflow</literal> &#8212; una definizione di pageflow da avviare. (E' utile solamente quando vengono usati <literal>propagation="begin"</literal> oppure <literal>propagation="join"</literal>).

source: Customize the conversation propagation for a command link or button (or similar JSF control). <emphasis>Facelets only.</emphasis>
fr_fr: Personnalise la propagation de la conversation d'un lien de commande ou d'un bouton (ou d'un control JSF similaire). <emphasis>seulement avec les Facelets.</emphasis>
it_it: Personalizza la propagazione della conversazione per un command link/button (o controllo JSF simile). <emphasis>Solo Facelets.</emphasis>

source: <literal>type</literal> &#8212; determines the conversation propagation style: <literal>begin</literal>, <literal>join</literal>, <literal>nested</literal>, <literal>none</literal>, <literal>end</literal> or <literal>endRoot</literal>.
fr_fr: <literal>type</literal> &#8212; détermine le style de la propagation de la conversation : <literal>begin</literal>, <literal>join</literal>, <literal>nested</literal>, <literal>none</literal>, <literal>end</literal> ou <literal>endRoot</literal>.
it_it: <literal>type</literal> &#8212; determina lo stile della propagazione della conversazione: <literal>begin</literal>, <literal>join</literal>, <literal>nested</literal>, <literal>none</literal>, <literal>end</literal> o <literal>endRoot</literal>.

source: Specify the default action to run when the form is submitted using the enter key.
fr_fr: Spécifie l'action par défaut à exécuter quand le formulaire est soumis en utilisant la touche entrée.
it_it: Specifica l'azione di default daeseguire quando viene fatto il submit della form usando il tasto invio.

source: Currently you can only nest it inside buttons (e.g. <literal>&lt;h:commandButton /&gt;</literal>, <literal>&lt;a:commandButton /&gt;</literal> or <literal>&lt;tr:commandButton /&gt;</literal>).
fr_fr: Actuellement, vous ne pouvez l'embarquer qu'au sein des boutons (autrement dit. <literal>&lt;h:commandButton /&gt;</literal>, <literal>&lt;a:commandButton /&gt;</literal> ou <literal>&lt;tr:commandButton /&gt;</literal>).
it_it: Attualmente lo si può innestare solo dentro i pulsanti (es. <literal>&lt;h:commandButton /&gt;</literal>, <literal>&lt;a:commandButton /&gt;</literal> o <literal>&lt;tr:commandButton /&gt;</literal>).

source: You must specify an id on the action source. You can only have one default action per form.
fr_fr: Vous devez spécifier un identifiant pour la source de l'action. Vous pouvez seulement avoir une action par défaut par formulaire.
it_it: Occorre specificare un id sulla sorgente d'azione. Si può avere soltanto un'azione di default per form.

source: Converters and Validators
fr_fr: Les convertisseurs et les validateurs
it_it: Convertitori e Validatori

source: Perform date or time conversions in the Seam timezone.
fr_fr: Réalise les conversation de date et d'horaire dans le fuseau horaire de Seam.
it_it: Esegue conversioni di data o orario nella timezone di Seam.

source: Assigns an entity converter to the current component. This is useful for radio button and dropdown controls.
fr_fr: Affecte un convertisseur d'entité au composant courrant. C'est vraiment utile pour un bouton radio ou un controle de type combobox.
it_it: Assegna un entity converter al componente corrente. Questo è utile per pulsanti radio e controlli dropdown.

source: The converter works with any managed entity - either simple or composite. The converter should be able to find the items declared in the JSF controls on form submission, otherwise you will receive a validation error.
fr_fr: Le convertisseur fonctionne avec des entités gérées - qu'elle soit simple ou composée. Le convertisseur devrait être capable de trouver les éléments déclaré dans le controle de JSF dans la soumission du formulaire, autrement vous allez recevoir une erreur de validation.
it_it: Il converter funziona con qualsiasi entity gestita - sia semplice che composta. Il converter deve essere in grado di trovare gli item dichiarati nei controlli JSF durante la sottomissione della form, altrimenti si riceverà un errore di validazione.

source: Configuration
fr_fr: La configuration.
it_it: Configurazione

source: You must use <emphasis>Seam managed transactions</emphasis> (see <xref linkend="persistence.seam-managed-transactions"/>) with <literal>&lt;s:convertEntity /&gt;</literal>.
fr_fr: Vous devez utiliser <emphasis>des transactions géré par Seam </emphasis> (voir <xref linkend="persistence.seam-managed-transactions"/>) avec le <literal>&lt;s:convertEntity /&gt;</literal>.
it_it: Si devono usare le <emphasis>transazioni di Seam gestite</emphasis> (vedere <xref linkend="persistence.seam-managed-transactions"/>) con <literal>&lt;s:convertEntity /&gt;</literal>.

source: If your <emphasis>Managed Persistence Context</emphasis> isn't called <literal>entityManager</literal>, then you need to set it in components.xml:
fr_fr: Si votre <emphasis>Contexte du Managed Persistence</emphasis> n'appelle pas <literal>entityManager</literal>, alors vous allez avoir besoin de le définir dans components.xml:
it_it: Se il <emphasis>Managed Persistence Context</emphasis> non viene chiamato <literal>entityManager</literal>, allora occorre impostarlo in components.xml:

source: If you are using a <emphasis>Managed Hibernate Session</emphasis> then you need to set it in components.xml:
fr_fr: Si votre <emphasis>Session du Managed Persistence</emphasis> n'appelle pas <literal>entityManager</literal>, alors vous allez avoir besoin de le définir dans components.xml:
it_it: Se si usa una <emphasis>Managed Hibernate Session</emphasis> allora occorre impostarla in components.xml:

source: If your <emphasis>Managed Hibernate Session</emphasis> isn't called <literal>session</literal>, then you need to set it in components.xml:
fr_fr: Si votre <emphasis>Session du Managed Persistence</emphasis> n'appelle pas <literal>session</literal>, alors vous allez avoir besoin de le définir dans components.xml:
it_it: Se il <emphasis>Managed Hibernate Session</emphasis> non viene chiamato <literal>session</literal>, allora occorre impostarla in components.xml:

source: If you want to use more than one entity manager with the entity converter, you can create a copy of the entity converter for each entity manager in <literal>components.xml</literal> - note how the entity converter delegates to the entity loader to perform persistence operations:
fr_fr: Si vous voulez utiliser plus d'un gestionnaire d'entité avec le convertisseur d'entité, vous devez créer une copie du convertisseur d'entité pour chaque gestionnaire d'entité dans <literal>components.xml</literal> - notez comment le convertisseur d'entité va déléguer au chargeur de l'entité la réalisation des opérations de persistance:
it_it: Se si vuole usare più di un entity manager con l'entity converter, si può creare una copia dell'entity converter per ciascun entity manager in <literal>components.xml</literal> - si noti come l'entity converter deleghi all'entity loader l'esecuzione delle operazioni di persistenza:

source: Assigns an enum converter to the current component. This is primarily useful for radio button and dropdown controls.
fr_fr: Affecte un convertisseur d'enumérateur au composant courrant. C'est en premier lieu utile pour les boutons radio et les controles de type combobox.
it_it: Assegna un enum converter al componente corrente. Questo è utile per i pulsanti radio e i controlli dropdown.

source: <literal>javax.faces.convert.Converter</literal> for <literal>java.util.concurrent.atomic.AtomicBoolean</literal>.
fr_fr: <literal>javax.faces.convert.Converter</literal> pour <literal>java.util.concurrent.atomic.AtomicBoolean</literal>.

source: <literal>javax.faces.convert.Converter</literal> for <literal>java.util.concurrent.atomic.AtomicInteger</literal>.
fr_fr: <literal>javax.faces.convert.Converter</literal> pour <literal>java.util.concurrent.atomic.AtomicInteger</literal>.

source: <literal>javax.faces.convert.Converter</literal> for <literal>java.util.concurrent.atomic.AtomicLong</literal>.
fr_fr: <literal>javax.faces.convert.Converter</literal> pour <literal>java.util.concurrent.atomic.AtomicLong</literal>.

source: Tag to nest inside an input control to validate that its parent's value is equal (or not equal!) to the referenced control's value.
fr_fr: La balise à insérer dans un controle de saisie pour valider que la valeur parente est équale (ou différente) à la valeur du controle référencé.
it_it: Tag da innestare dentro un controllo 'input per validare che il valore del suo padre sia uguale (o non uguale!) al valore del controllo referenziato.

source: <literal>for</literal> &#8212; The id of a control to validate against.
fr_fr: <literal>for</literal> &#8212; L'identifiant du controle à comparer pour validation.
it_it: <literal>for</literal> &#8212; L'id di un controllo da validare.

source: <literal>message</literal> &#8212; Message to show on failure.
fr_fr: <literal>message</literal> &#8212; Le message à afficher en cas d'echec.
it_it: <literal>message</literal> &#8212; Messaggio da mostrare in presenza di errori.

source: <literal>required</literal> &#8212; False will disable a check that a value at all is inputted in fields.
fr_fr: <literal>required</literal> &#8212; Faux va désactiver la validation d'une valeur pour toutes les champs de saisies.
it_it: <literal>required</literal> &#8212; False disabiliterà un controllo per cui un valore viene inserito nei campi.

source: <literal>messageId</literal> &#8212; Message id to show on failure.
fr_fr: <literal>messageId</literal> &#8212; L'identifiant de message à afficher en cas d'echec.
it_it: <literal>messageId</literal> &#8212; L'id del messaggio da mostrare in presenza di errori.

source: <literal>operator</literal> &#8212; What operator to use when comparing the values Valid operators are:
fr_fr: <literal>operator</literal> &#8212; Quel opérateur à utiliser avec la comparaison des valeurs. Les opérateurs valident sont :
it_it: <literal>operator</literal> &#8212; Quale operatore usare quando si comparano i valori. Gli operatori sono:

source: <literal>equal</literal> &#8212; Validates that value.equals(forValue)
fr_fr: <literal>equal</literal> &#8212; Valide que value.equals(forValue)
it_it: <literal>equal</literal> &#8212; Valida che value.equals(forValue)

source: <literal>not_equal</literal> &#8212; Validates that !value.equals(forValue)
fr_fr: <literal>not_equal</literal> &#8212; Valide que !value.equals(forValue)
it_it: <literal>not_equal</literal> &#8212; Valida che !value.equals(forValue)

source: <literal>greater</literal> &#8212; <![CDATA[Validates that ((Comparable)value).compareTo(forValue)> 0]]>
fr_fr: <literal>greater</literal> &#8212; <![CDATA[Valide que ((Comparable)value).compareTo(forValue)> 0]]>
it_it: <literal>greater</literal> &#8212; <![CDATA[Valida che sia ((Comparable)value).compareTo(forValue)> 0]]>

source: <literal>greater_or_equal</literal> &#8212; <![CDATA[Validates that ((Comparable)value).compareTo(forValue)>= 0]]>
fr_fr: <literal>greater_or_equal</literal> &#8212; <![CDATA[Valide que ((Comparable)value).compareTo(forValue)>= 0]]>
it_it: <literal>greater_or_equal</literal> &#8212; <![CDATA[Valida che sia ((Comparable)value).compareTo(forValue)>= 0]]>

source: <literal>less</literal> &#8212; <![CDATA[Validates that ((Comparable)value).compareTo(forValue) <0]]>
fr_fr: <literal>less</literal> &#8212; <![CDATA[Valide que ((Comparable)value).compareTo(forValue) <0]]>
it_it: <literal>less</literal> &#8212; <![CDATA[Valida che sia ((Comparable)value).compareTo(forValue) <0]]>

source: <literal>less_or_equal</literal> &#8212; <![CDATA[Validates that ((Comparable)value).compareTo(forValue) <= 0]]>
fr_fr: <literal>less_or_equal</literal> &#8212; <![CDATA[Valide que ((Comparable)value).compareTo(forValue) <= 0]]>
it_it: <literal>less_or_equal</literal> &#8212; <![CDATA[Valida che sia ((Comparable)value).compareTo(forValue) <= 0]]>

source: A non-visual control, validates a JSF input field against the bound property using Hibernate Validator.
fr_fr: Un controle sans partie visible, qui valide un champ de saisi JSF par rapport à une propriété liée en utilisant un Validator d'Hibernate.
it_it: Un controllo non visuale, valida un campo d'input JSF con la proprietà collegata usando Hibernate Validator.

source: A non-visual control, validates all child JSF input fields against their bound properties using Hibernate Validator.
fr_fr: Un controle sans partie visible, qui valide tous les champs de saisie enfants de JSF par rapport à une propriété liée en utilisant un Validator d'Hibernate.
it_it: Un controllo non visuale, valida tutti i campi d'input JSF con le proprietà collegate usando Hibernate Validator.

source: Formatting
fr_fr: Le formatage
it_it: Formattazione

source: "Decorate" a JSF input field when validation fails or when <literal>required="true"</literal> is set.
fr_fr: "Décore" un champs de saisie JSF quand la validation échoue ou quand <literal>required="true"</literal> est définie.
it_it: "Decora" un campo d'input JSF quando la validazione fallisce o quando è impostato <literal>required="true"</literal>.

source: <literal>template</literal> &#8212; the facelets template to use to decorate the component
fr_fr: <literal>template</literal> &#8212; le modèle de facelets à utiliser pour décorer le composant
it_it: <literal>template</literal> &#8212; il template facelets da usare per decorare il componente

source: <literal>enclose</literal> &#8212; if true, the template used to decorate the input field is enclosed by the element specified with the "element" attribute. By default this is a div element.
fr_fr: <literal>enclose</literal> &#8212; si vrai, le modèle utilisé pour décorer le champs de saisie est encadré par l'élément spécifié par l'attribut "element". Par défaut, c'est un élément div.
it_it: <literal>enclose</literal> &#8212; se true, il template usato per decorare il campo d'input è racchiuso dall'elemento specificato con l'attributo "element". Di default questo è un elemento div.

source: <literal>element</literal> &#8212; the element to enclose the template used to decorate the input field. By default, the template is enclosed with a div element.
fr_fr: <literal>element</literal> &#8212; l'élément qui englobe ce modèle utilisé pour décorer le champs de sasie. Par défaut, le modèl esr inclus dans un élément div.
it_it: <literal>element</literal> &#8212; l'elemento con cui racchiudere il template usato per decorare il campo d'input. Di default, il template è racchiuso con un elemento div.
