Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Excel.po
Languages: fr_fr, it_it

source: <literal>rowSpan</literal> &#8212; The row span of the image. The default is the one resulting in the default height of the image. The value is a float.
fr_fr: <literal>rowSpan</literal> &#8212; L'étendue en ligne de l'image. Par défaut est un le résultat de la hauteur par défaut de l'image. La valeur est un nombre flottant.
it_it: <literal>rowSpan</literal> &#8212; Lo span di colonna dell'immagine. Il default è quello risultante nella altezza di default dell'immagine. Il default è un float.

source: <literal>URI</literal> &#8212; The URI to the image. The value is a string.
fr_fr: <literal>URI</literal> &#8212; L'URI de l'image. La valeur est une chaine de caractères.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: defines an image in A1:E5 based on the given data
fr_fr: définie une image dans A1:E5 basée sur les données transmisses
it_it: definisce un'immagine in A1:A5 basato sui dati in questione

source: Hyperlinks
fr_fr: Les hyperliens

source: Hyperlinks are nested within columns (for iteration) or inside worksheets (for direct placement using the <literal>startColumn/startRow</literal> and <literal>endColumn/endRow</literal> attributes). They add link navigation to URIs
fr_fr: Les hyperliens sont regroupé dans les colonnes (pour l'itération) ou dans les classeurs (pour un placement direct en utilisant les attributs <literal>startColumn/startRow</literal> et <literal>endColumn/endRow</literal>). Ils ajoutent des liens de navigations aux URIs
it_it: Gli hyperlink sono innestati dentro le colonne (per iterazione) o dentro i worksheet (per collocazione diretta usando gli attributi <literal>startColumn/startRow</literal> e <literal>endColumn/endRow</literal>). Aggiungono agli URI una navigazione tramite link.

source: <literal>startColumn</literal> &#8212; The starting column of the hyperlink. The default is the internal counter. The value is a number. Note that the value is 0-based.
fr_fr: <literal>startColumn</literal> &#8212; La colonne de départ de l'hyperlien. Par défaut est un compteur interne. La valeur est un nombre. Notez que la valeur est un index basée zéro.
it_it: <literal>startColumn</literal> &#8212; La colonna iniziale del hyperlink. Il default è un contatore interno. Il valore è un numero. Si noti che il valore parte da zero.

source: <literal>startRow</literal> &#8212; The starting row of the hyperlink. The default is the internal counter. The value is a number. Note that the value is 0-based.
fr_fr: <literal>startRow</literal> &#8212; La ligne de départ de l'hyperlien. Par défaut c'est un compteur interne. La valeur est un nombre. Notez que la valeur est basée sur un index zéro.
it_it: <literal>startRow</literal> &#8212; La riga iniziale del hyperlink. Il default è un contatore interno. Il valore è un numero. Si noti che il valore parte da zero.

source: <literal>endColumn</literal> &#8212; The ending column of the hyperlink. The default is the internal counter. The value is a number. Note that the value is 0-based.
fr_fr: <literal>endColumn</literal> &#8212; La colonne de fin de l'hyperlien. Par défaut c'est un compteur interne. La valeur est un nombre. Notez que la valeur est basée sur un index zéro.
it_it: <literal>endColumn</literal> &#8212; La colonna finale del hyperlink. Il default è un contatore interno. Il valore è un numero. Si noti che il valore parte da zero.

source: <literal>endRow</literal> &#8212; The ending row of the hyperlink. The default is the internal counter. The value is a number. Note that the value is 0-based.
fr_fr: <literal>endRow</literal> &#8212; La ligne de fin de l'hyperlien. Par défaut c'est un compteur interne. La valeur est un nombre. Notez que la valeur est basée sur un index zéro.
it_it: <literal>endRow</literal> &#8212; La riga finale del hyperlink. Il default è un contatore interno. Il valore è un numero. Si noti che il valore parte da zero.

source: <literal>URL</literal> &#8212; The URL to link. The value is a string.
fr_fr: <literal>URL</literal> &#8212; L'URL du lien. La valeur est une chaine de caractères.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>description</literal> &#8212; The description of the link. The value is a string.
fr_fr: <literal>description</literal> &#8212; La description du lien. La valeur est une chaine de caractères.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: defines a described hyperlink pointing to SFWK in the area A1:E5
fr_fr: défini un hyperlien et sa description qui point vers SFWK dans la zone A1:E5
it_it: definisce un hyperlink che punta a SFWK nell'area A1:E5

source: Headers and footers
fr_fr: Les entêtes et les pieds de page
it_it: Intestazioni e pié di pagina

source: Headers and footers are childrens of worksheets and contain facets which in turn contains a string with commands that are parsed.
fr_fr: Les entêtes et les pieds-de-pages sont des enfants des classeurs et contients les facets qui à leur tour contiennent les commandes qui sont analysées.
it_it: Intestazioni e pié di pagina sono figli dei fogli di lavoro e contengono facet che a loro volta contengono una stringa con i comandi da analizzare.

source: <literal>left</literal> &#8212; The contents of the left header/footer part.
fr_fr: <literal>left</literal> &#8212; Le contenu de la partie gauche de l'entête/du pied de page.
it_it: <literal>left</literal> &#8212; I contenuti della parte sinistra di intestazione/pié di pagina.

source: <literal>center</literal> &#8212; The contents of the center header/footer part.
fr_fr: <literal>center</literal> &#8212; Le contenu de la partie centrale de l'entête/du pied de page.
it_it: <literal>center</literal> &#8212; i contenuti della parte centrale di intestazione/pié di pagina.

source: <literal>right</literal> &#8212; The contents of the right header/footer part.
fr_fr: <literal>right</literal> &#8212; Le contenu de la partie droite de l'entête/du pied de page.
it_it: <literal>right</literal> &#8212; i contenuti della parte destra di intestazione/pié di pagina.

source: The content of the facets is a string that can contain various #-delimited commands as follows:
fr_fr: Le contenu de la facets est dans une chaine de caractères qui peut contenir plusieurs commandes délimitées par # comme ci-dessous:
it_it: Il contenuto dei facets è una stringa che può contenere vari comandi delimitati da # come segue:

source: Inserts the current date
fr_fr: Insère la date courante
it_it: Inserisce la data corrente

source: Inserts the current page number
fr_fr: Insère le numéro de la page courante
it_it: Inserisce il numero della pagina corrente

source: Inserts the current time
fr_fr: Insère l'heure actuelle
it_it: Inserisce l'orario corrente

source: Inserts the total page count
fr_fr: Insère le nombre total de page
it_it: Inserisce il conteggio totale della pagina

source: Inserts the worksheet name
fr_fr: Insère le nom de la feuille de calcul
it_it: Inserisce il nome del worksheet

source: Inserts the workbook name
fr_fr: Insère le nom du classeur
it_it: Inserisce il nome del workbook

source: Toggles bold font, use another #bold# to turn it off
fr_fr: Activer la police en gras, ustilisez un autre #bold# pour le désactiver.
it_it: Attiva il font in grassetto, usare un altro #bold# per disattivarlo

source: Toggles italic font, use another #italic# to turn it off
fr_fr: Activer la police en italique, ustilisez un autre #italic# pour le désactiver.
it_it: Attiva il font in corsivo, usare un altro #italic# per disattivarlo

source: Toggles underlining, use another #underline# to turn it off
fr_fr: Basculer le soulignement, utilisez un autre #underline# pour désactiver
it_it: Attiva la sottolineatura, usare un altro #underline# per disattivarla

source: Toggles double underlining, use another #double_underline# to turn it off
fr_fr: Basculez le double soulignement, utilisez un autre #double_underline# pour désactiver
it_it: Attiva la doppia sottolineatura, usare un altro #double_underline# per disattivarla

source: Toggles outlined font, use another #outline# to turn it off
fr_fr: Basculez la police surlignée, utilisez un autre #outline# pour désactiver
it_it: Attiva il font outline, usare un altro #outline# per disattivarlo

source: Toggles shadowed font, use another #shadow# to turn it off
fr_fr: Basculez la police ombrée, utilisez un autre #shadow# pour désactiver
it_it: Attiva il font ombreggiato, usare un altro #shadow# per disattivarlo

source: Toggles strikethrough font, use another #strikethrough# to turn it off
fr_fr: Basculez la police barrée, utilisez un autre #strikethrough# pour désactiver
it_it: Attiva il font barrato, usare un altro #strikethrough# per disattivarlo

source: Toggles subscripted font, use another #subscript# to turn it off
fr_fr: Basculez la police en indice, utilisez un autre #subscript# pour désactiver
it_it: Attiva il font subscripted, usare un altro #subscript# per disattivarlo

source: Toggles superscript font, use another #superscript# to turn it off
fr_fr: Basculez la police en exposant, utilisez un autre #superscript# pour désactiver
it_it: Attiva il font superscript, usare un altro #superscript# per disattivarlo

source: Sets font name, used like #font_name=Verdana"
fr_fr: Définir le nom de la police, utilisez quelquechose comme #font_name=Verdana"
it_it: Imposta il nome dei font, si usa come #font_name=Verdana#

source: Sets font size, use like #font_size=12#
fr_fr: Défini une taille de police, utilisez quelquechose comme #font_size=12#
it_it: Imposta la dimensione dei font, si usa come #font_size=12#

source: Print areas and titles
fr_fr: Les zones d'impressions et les titres
it_it: Stampa di aree e titoli

source: Print areas and titles childrens of worksheets and worksheet templates and provide... print areas and titles.
fr_fr: Les zones d'impression et les titres sont les enfants des feuilles de calculs et des modèles de classeur et fournissent... zones d'impressions et titres.
it_it: Stampa le aree ed i titoli figli dei worksheet e dei templatee fornisce...stampa aree e titoli.

source: <literal>firstColumn</literal> &#8212; The column of the top-left corner of the area. The parameter is a number. Note that the value is 0-based.
fr_fr: <literal>firstColumn</literal> &#8212; La colonne dans le coin supérieur gauche de la zone. Le paramètre est un nombre. Notez que la valeur est un index basée sur zéro.
it_it: <literal>firstColumn</literal> &#8212; La colonna dell'angolo in alto a sinistra dell'area. Il parametro è un numero. Si noti che il valore parte da zero.

source: <literal>firstRow</literal> &#8212; The row of the top-left corner of the area. The parameter is a number. Note that the value is 0-based.
fr_fr: <literal>firstRow</literal> &#8212; La ligne dans le coin supérieur gauche de la zone. Le paramètre est un nombre. Notez que la valeur est un index basée sur zéro.
it_it: <literal>firstRow</literal> &#8212; La riga dell'angolo in alto a sinistra dell'area. Il parametro è un numero. Si noti che il valore parte da zero.

source: <literal>lastColumn</literal> &#8212; The column of the bottom-right corner of the area. The parameter is a number. Note that the value is 0-based.
fr_fr: <literal>lastColumn</literal> &#8212; La colonne dans le coin inférieur droit de la zone. Le paramètre est un nombre. Notez que la valeur est basé sur un index zéro.
it_it: <literal>lastColumn</literal> &#8212; La colonna dell'angolo in basso a destra dell'area. Il parametro è un numero. Si noti che il valore parte da zero.

source: <literal>lastRow</literal> &#8212; The row of the bottom-right corner of the area. The parameter is a number. Note that the value is 0-based.
fr_fr: <literal>lastRow</literal> &#8212; La ligne du coin inférieur droit de la zone. Le paramètre est un nombre. Notez que la valeur est basé sur un index zéro.
it_it: <literal>lastRow</literal> &#8212; La riga dell'angolo in basso a destra dell'area. Il parametro è un numero. Si noti che il valore parte da zero.

source: defines a print title between A1:A10 and a print area between B2:J10.
fr_fr: définie un titre d'impression entre A1:A10 et une zone d'impression entre B2:J10.
it_it: definisce un titolo di stampa tra A1:A10 ed un'area di stampa tra B2:J10.

source: Worksheet Commands
fr_fr: Les commandes du classeur de calcul
it_it: Comandi per i fogli di lavoro (worksheet)

source: Worksheet commands are children of workbooks and are usually executed only once.
fr_fr: Les commandes de la feuille de calculs sont les enfant des classeurs et habituellement exécuté seulement une fois.
it_it: I comandi per i fogli di lavoro sono figli dei workbook e vengono solitamente eseguiti solo una volta.

source: Grouping
fr_fr: Le regroupement
it_it: Raggruppamento

source: Provides grouping of columns and rows.
fr_fr: Fournir le regroupement de colonnes et de lignes.
it_it: Fornisce un raggruppamento di colonne e righe.

source: <literal>startRow</literal> &#8212; The row to start the grouping at. The value is a number. Note that the value is 0-based.
fr_fr: <literal>startRow</literal> &#8212; la ligne qui indique le commencent du regroupement La valeur est un nombre. Notez que la valeur est un index basé sur zéro.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>endRow</literal> &#8212; The row to end the grouping at. The value is a number. Note that the value is 0-based.
fr_fr: <literal>endRow</literal> &#8212; La ligne qui indique la fin du regroupement. La valeur est un nombre. Notez que la valeur est un basé sur un index zéro.
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>collapse</literal> &#8212; Should the grouping be collapsed initially? The value is a boolean.
fr_fr: <literal>collapse</literal> &#8212; Faut il que le regroupement soit replié initiallement? La valeur est un booléen.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>startColumn</literal> &#8212; The column to start the grouping at. The value is a number. Note that the value is 0-based.
fr_fr: <literal>startColumn</literal> &#8212; La colonne de départ du regroupement. La valeur est un nombre. Notez que la valeur est un index basé sur zéro.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>endColumn</literal> &#8212; The column to end the grouping at. The value is a number. Note that the value is 0-based.
fr_fr: <literal>endColumn</literal> &#8212; La colonne de fin du regroupement. La valeur est un nombre. Notez que la valeur est un index basé sur zéro.
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: groups rows 5 through 10 and columns 5 through 10 so that the rows are initially collapsed (but not the columns).
fr_fr: les lignes groupées de 5 à 10 et les colonnes de 5 à 10 ainsi les lignes sont initiallement repliées (mais pas les colonnes).
it_it: raggruppa dalla riga 5 alla 10 e dalla colonna 5 alla 10 in modo che le righe siano inizialmente collassate (ma non le colonne).

source: Page breaks
fr_fr: Saut de page
it_it: Interruzioni di pagina

source: Provides page breaks
fr_fr: Fournir des sauts de page
it_it: Fornisce interruzioni di pagina

source: <literal>row</literal> &#8212; The row to break at. The value is a number. Note that the value is 0-based.
fr_fr: <literal>row</literal> &#8212; La ligne de l'endroit de saut. La valeur est un nombre. Notez que la valeur est un index basé sur zéro.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: breaks page at row 5.
fr_fr: saut de page à la ligne 5.
it_it: interrompe la pagina alla riga 5.

source: Merging
fr_fr: La fusion
it_it: Fusione (merge)

source: Provides cell merging
fr_fr: Fournir le regroupement de cellule
it_it: Fornisce l'unione delle celle

source: <literal>startRow</literal> &#8212; The row to start the merging from. The value is a number. Note that the value is 0-based.
fr_fr: <literal>startRow</literal> &#8212; La ligne de départ pour la fusion. La valeur est un nombre. Notez que la valeur est un index basé sur zéro.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>startColumn</literal> &#8212; The column to start the merging from. The value is a number. Note that the value is 0-based.
fr_fr: <literal>startColumn</literal> &#8212; La colonne de départ pour la fusion. La valeur est un nombre. Notez que la valeur est un index basé sur zéro.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>endRow</literal> &#8212; The row to end the merging at. The value is a number. Note that the value is 0-based.
fr_fr: <literal>endRow</literal> &#8212; La ligne de fin pour la fusion. La valeur est un nombre. Notez que la valeur est un index basé sur zéro.
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>endColumn</literal> &#8212; The column to end the merging at. The value is a number. Note that the value is 0-based.
fr_fr: <literal>endColumn</literal> &#8212; La colonne de fin de la fusion. La valeur est un nombre. Notez que la valeur est un index basé sur zéro.
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: merges the cells in the range A1:J10
fr_fr: fusions des cellules dans la zone A1:J10
it_it: unisce le celle nel range A1:J10

source: Datatable exporter
fr_fr: Exportateur de tableau de données
it_it: Esportatore di datatable

source: If you prefer to export an existing JSF datatable instead of writing a dedicated XHTML document, this can also be achieved easily by executing the <literal>org.jboss.seam.excel.excelExporter.export</literal> component, passing in the id of the datatable as an Seam EL parameter. Consider you have a data table
fr_fr: Si vou préférez exporter une table de données JSF existante au lieu d'écrire un document XHTML dédié, ce qui peut aussi être réalisé facilement en exécutant le composant <literal>org.jboss.seam.excel.excelExporter.export</literal>, en passant l'identifiant de la table de données comme un paramètre EL de Seam. Considerant que vous avez une table de données
it_it: Se si preferisce esportare una datatable JSF esistente invece di scrivere un apposito documento XHTML, si può eseguire il componente <literal>org.jboss.seam.excel.excelExporter.export</literal>, passando l'id della datatable come parametro Seam EL. Si presuma di avere una datatable

source: that you want to view as an <trademark class="registered">Microsoft</trademark> <trademark class="registered">Excel</trademark> spreadsheet. Place a
fr_fr: que vous voulez voir coomme un classeur <trademark class="registered">Excel</trademark> <trademark class="registered">Microsoft</trademark> . Placez un
it_it: che si vuole visualizzare come foglio <trademark class="registered">Microsoft</trademark> <trademark class="registered">Excel</trademark>. Si collochi un

source: in the form and you're done. You can of course execute the exporter with a button, s:link or other preferred method. There are also plans for a dedicated export tag that can be placed inside the datatable tag so you won't have to refer to the datatable by ID.
fr_fr: dans le formulaire et c'est fait. VOus pouvez bien sûr exécuter l'exportateur avec un bouton s:link ou toute méthode préférée. Il y a aussi des plans pour un tag d'exportation qui peut être placé dans la balise table de données ainsi vous n'avez pas à indiquer la table de données par son ID.
it_it: nella form e si è già finito. Si può certamente eseguire l'exporter con un pulsante, s: link oppure con un altro metodo preferito. Ci sono anche piani per un tag dedicato all'export che possa essere messo nel tag della datatable per non dover più fare riferimento all'id della datatable.

source: See <xref linkend="excel.fontsandlayout"/> for formatting.
fr_fr: Voir <xref linkend="excel.fontsandlayout"/> pour le formatage.
it_it: Si veda <xref linkend="excel.fontsandlayout"/> per la formattazione.

source: Fonts and layout
fr_fr: Les polices et les calques
it_it: Font e layout

source: Controlling how the output look is done with a combination of CSSish style attributes and tag attributes. The most common ones (fonts, borders, backgrounds etc) are CSS and some more general settings are in tag attributes.
fr_fr: Le control de comment l'affichage est fait est une combinaison d'attributs de style CSS et d'attributs de tag. Les plus communs (polices, bordures, arrières plan, etc) sont CSS et quelques réglages généraux sont des attributs de tag.
it_it: Il controllo dell'aspetto dell'output è fatto con una combinazione di attributi stile-CSS e di attributi tag. I più comuni (font, bordi, background, ecc.) sono CSS ed alcune impostazioni generali sono negli attributi tag.

source: The CSS attributes cascade down from parent to children and within one tag cascades over the CSS classes referenced in the <literal>styleClass</literal> attributes and finally over the CSS attributes defined in the <literal>style</literal> attribute. You can place them pretty much anywhere but e.g. placing a column width setting in a cell nested within that column makes little sense.
fr_fr: Les attributs CSS en cascade depuis les parents vers les enfants et avec un tag surcharge les classes CSS référencés dans l'attribut <literal>styleClass</literal> et finallement surcharge les attributs CSS définis dans l'attribut <literal>style</literal>. Vous pouvez les placer dans presque partout mais en indiquant une largeur de colonne défini une cellule incluse dans la colonne est assez évident.
it_it: Gli attributi CSS vanno in cascata dal padre ai figli e da un tag si scende in cascata attraverso classi CSS referenziate negli attributi <literal>styleClass</literal> ed infine lungo gli attributi CSS definiti nell'attributo <literal>style</literal>. Si può collocarli ovunque, ma ad esempio impostare la larghezza di colonna in una cella innestata dentro tale colonna ha poco senso.

source: If you have format masks or fonts that use special characters, such as spaces and semicolons, you can escape the css string with '' characters like xls-format-mask:'$;$'
fr_fr: Si vous avez un masque de formatage ou des polices qui utiliser des caractères spéciaux, comme des espaces ou des points virgules, vous pouvez déspécialiser des caractères css avec le caractère '' comme xls-format-mask:'$;$'

source: Stylesheet links
fr_fr: Les liens vers les feuilles de styles
it_it: Link ai fogli di stile

source: External stylesheets are references with the e:link tag. They are placed as children of the workbook.
fr_fr: Les feuilles de styles externes sont référencés dans la balise e:link. Ils sont placé comme enfant du classeur.
it_it: Gli stylesheet esterni sono referenziati con il tag e:link. Vengono messi come figli del workbook.

source: <literal>URL</literal> &#8212; The URL to the stylesheet
fr_fr: <literal>URL</literal> &#8212; L'URL vers la feuille de style
it_it: <literal>URL</literal> &#8212; l'URL al foglio di stile

source: References a stylesheet that can be found at /css/excel.css
fr_fr: Référence une feuille de style qui peut ête trouvé dans /css/excel.css
it_it: Fa riferimento allo stylesheet che può essere trovato in /css/excel.css

source: Fonts
fr_fr: Les polices
it_it: Font
