Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Excel.po
Languages: fr_fr, it_it

source: <literal>&lt;e:link/&gt;</literal> &#8212; Zero or more stylesheet links (see <xref linkend="excel.fontsandlayout.link"/> ).
fr_fr: <literal>&lt;e:link/&gt;</literal> &#8212; Zéro ou plusieurs liens vers des feuilles de styles (voir <xref linkend="excel.fontsandlayout.link"/> ).
it_it: <literal>&lt;e:link/&gt;</literal> &#8212; Zero o più link a fogli di stile (vedere <xref linkend="excel.fontsandlayout.link"/> ).

source: <literal>&lt;e:worksheet/&gt;</literal> &#8212; Zero or more worksheets (see <xref linkend="excel.worksheet"/> ).
fr_fr: <literal>&lt;e:worksheet/&gt;</literal> &#8212; Zéro ou plusieurs feuilles de calculs (voir <xref linkend="excel.worksheet"/> ).
it_it: <literal>&lt;e:worksheet/&gt;</literal> &#8212; Zero or più fogli di lavoro (see <xref linkend="excel.worksheet"/> ).

source: Facets
fr_fr: Les Facets

source: none
fr_fr: aucun
it_it: nessuno

source: defines a workbook with a worksheet and a greeting at A1
fr_fr: définie un classeur avec une feuille de calcul et format A1
it_it: definisce un workbook con un foglio di lavoro ed un saluto in A1

source: Worksheets
fr_fr: Les feuilles de calculs

source: Worksheets are the children of workbooks and the parent of columns and worksheet commands. They can also contain explicitly placed cells, formulas, images and hyperlinks. They are the pages that make up the workbook.
fr_fr: Les feuilles de calculs sont les enfant des classeurs et les parents des colonnes et des commandes des feuilles de calculs. Ils contiennents aussi les cellules placé explicitement, les formules, les images et les liens hypertextes. Ils sont les pages qui font le classeurs.
it_it: I worksheet sono figli dei workbook e padri delle colonne e dei comandi worksheet. Possono anche contenere celle, formule, immagini e collegamenti esplicitamente collocati. Sono le pagine che creano il workbook.

source: <literal>value</literal> &#8212; An EL-expression to the backing data. The value is a string. The target of this expression is examined for an Iterable. Note that if the target is a Map, the iteration is done over the Map.Entry entrySet(), so you should use a .key or .value to target in your references.
fr_fr: <literal>value</literal> &#8212; Une expression EL pour les données en réserve. La valeur est une chaine de caractères. La cible de cette expression est de trouver un Iterable. Noez que si la cible est une Map, l'itération se fait sur le Map.Entry entrySet(), et donc vous devez utilize un .key ou un .value pour cibler vos références.
it_it: <literal>value</literal> &#8212; Espressione-EL sui dati retrostanti. Il valore è una stringa. Il target di quest'espressione è esaminato per un Iterable. Si noti che se il target è una Map, l'iterazione viene fatta su Map.Entry entrySet(), e quindi occorre usare un .key o un .value per individuare i riferimenti.

source: <literal>var</literal> &#8212; The current row iterator variable name that can later be referenced in cell value attributes. The value is a string.
fr_fr: <literal>var</literal> &#8212; Le nom de la variable de la ligne courrant itérée qui peut êtree plus tard référencée dans la cellule comme des attributs de valeur de cellule. La valeur est une chaine de caractères.
it_it: <literal>var</literal> &#8212; Il nome della variabile della riga iteratore corrente che può successivamente essere referenziata negli attributi di valore della cella. Il valore è una stringa.

source: <literal>name</literal> &#8212; The name of the worksheet. The value is a string. Defaults to Sheet# where # is the worksheet index. If the given worksheet name exists, that sheet is selected. This can be used for merging several data sets into a single worksheet, just define the same name for them (using <literal>startRow</literal> and <literal>startCol</literal> to make sure that they don't occupy the same space).
fr_fr: <literal>name</literal> &#8212; Le nom du classeur. La valeur est une cahine de caractères. Par défaut à Sheet# quand # est l'index de la feuille de calcul. Si le nom donné de classeur existe, la feuille est sélectionné. Ceci peut être utilisé pour fusionner des groupes de données dans une seule feuille de calcul, en définissant juste le même nom pour eux (en utilisant<literal>startRow</literal> et <literal>startCol</literal> pour être sur que cela ne va pas occuper le même emplacement).
it_it: <literal>name</literal> &#8212; Il nome del worksheet. Il valore è una stringa. Il default è Sheet# dove # è l'indice del worksheet. Se esiste il nome del worksheet dato, tale foglio viene selezionato. Questo può essere usato per unire diversi set di dati in un singolo worksheet, solamente definendo lo stesso nome per questi (usando <literal>startRow</literal> e <literal>startCol</literal> per assicurarsi che non occupino lo stesso spazio).

source: <literal>startRow</literal> &#8212; Defines the starting row for the data. The value is a number. Used for placing the data in other places than the upper-left corner (especially useful if having multiple data sets for a single worksheet). The defaults is 0.
fr_fr: <literal>startRow</literal> &#8212; Définie la ligne de départ pour les données. La valeur est un nombre. Utilisé pour positioner les données dans les différents endroits que le coin supérieur gauche (particulièrement utile s'il y a des groupes de données multiples pour une seule feuille de calcul). Par défaut à 0.
it_it: <literal>startRow</literal> &#8212; Definisce la riga di inizio dei dati. Il valore è un numero. Usato per collocare i dati in altri posti rispetto all'angolo in alto a sinistra (è utile in particolare se si hanno set di dati multipli per un singolo worksheet). Il default è 0.

source: <literal>startColumn</literal> &#8212; Defines the starting column for the data. The value is a number. Used for placing the data in other places than the upper-left corner (especially useful if having multiple data sets for a single worksheet). The default is 0.
fr_fr: <literal>startColumn</literal> &#8212; Définie la colonne de démarrage pour les données. La valeur est un nombre. Utilisé pour placer les données dans un autre endroit que le coij suppérieur gauche (particulièrement utile si on a plusieurs groupes de données pour une seule feuille de calcul). Par défaut à 0.
it_it: <literal>startColumn</literal> &#8212; Definisce la colonna di inizio dei dati. Il valore è un numero. Usato per collocare i dati in altri posti rispetto all'angolo in alto a sinistra (è utile in particolare se si hanno set di dati multipli per un singolo worksheet). Il default è 0.

source: <literal>automaticFormulaCalculation</literal> &#8212; Should formulas be automatically calculated? The value is a boolean.
fr_fr: <literal>automaticFormulaCalculation</literal> &#8212; Faut-il automatiquementy calculé les formules? La valeur est un booléen.
it_it: <literal>automaticFormulaCalculation</literal> &#8212; Le formule devono essere automaricamente ricalcolate? Il valore è un booleano.

source: <literal>bottomMargin</literal> &#8212; The bottom margin. The value is a number (inches).
fr_fr: <literal>bottomMargin</literal> &#8212; La marge du bas. La valeur est un nombre (en pouces).
it_it: <literal>bottomMargin</literal> &#8212; Il margine inferiore. Il valore è un numero (pollici).

source: <literal>copies</literal> &#8212; The number of copies. The value is a number.
fr_fr: <literal>copies</literal> &#8212; Le nombre de copies. la valeur est un nombre.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>defaultColumnWidth</literal> &#8212; The default column width. The value is a number (characters * 256).
fr_fr: <literal>defaultColumnWidth</literal> &#8212; La largeur de la colonne par défaut. La valeur est un nombre (nombre de caractères * 256).
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>defaultRowHeight</literal> &#8212; The default row height. The value is a number (1/20ths of a point).
fr_fr: <literal>defaultRowHeight</literal> &#8212; La hauteur par défaut de la ligne. La valeur est un nombre (1/20ième d'un point).
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>displayZeroValues</literal> &#8212; Should zero-values be displayed? The value is a boolean.
fr_fr: <literal>displayZeroValues</literal> &#8212; Faut-il afficher les valeur zéro? La valeur est un booléen.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>fitHeight</literal> &#8212; The number of pages vertically that this sheet will be printed into. The value is a number.
fr_fr: <literal>fitHeight</literal> &#8212; Le nombre de pages verticales qui imprimera la feuille. La valeur est un nombre.
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>fitToPages</literal> &#8212; Should printing be fit to pages? The value is a boolean.
fr_fr: <literal>fitToPages</literal> &#8212; Faut-il en imprimer en faisant du sur-mesures pour les pages? La valeur est un booléen.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>fitWidth</literal> &#8212; The number of pages widthwise which this sheet should be printed into. The value is a number.
fr_fr: <literal>fitWidth</literal> &#8212; La nombre de page de largeur que cette feuille va utilisé pour s'imprimer. La valeur est un nombre.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>footerMargin</literal> &#8212; The margin for any page footer. The value is a number (inches).
fr_fr: <literal>footerMargin</literal> &#8212; La marge pour tout pied-de-page. La valeur est un nombre (en pouces).
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>headerMargin</literal> &#8212; The margin for any page headers. The value is a number (inches).
fr_fr: <literal>headerMargin</literal> &#8212; La marge pour tous les entêtes de pages. La valeur est un nombre (en pouces).
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>hidden</literal> &#8212; Should the worksheet be hidden? The value is a boolean.
fr_fr: <literal>hidden</literal> &#8212; La feuille de calcul doit-elle être cachée? La valeur est un booléen.
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>horizontalCentre</literal> &#8212; Should the worksheet be centered horizontally? The value is a boolean.
fr_fr: <literal>horizontalCentre</literal> &#8212; La feuille de calcul doit-elle être centrée horizontallement? La valeur est un booléen.
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>horizontalFreeze</literal> &#8212; The row at which the pane is frozen vertically. The value is a number.
fr_fr: <literal>horizontalFreeze</literal> &#8212; La ligne à partir de laquelle le volet est bloquée verticallement. La valeur est un nombre.
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>horizontalPrintResolution</literal> &#8212; The horizontal print resolution. The value is a number.
fr_fr: <literal>horizontalPrintResolution</literal> &#8212; La résolution d'impression horizontale. La valeur est un nombre.
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>leftMargin</literal> &#8212; The left margin. The value is a number (inches).
fr_fr: <literal>leftMargin</literal> &#8212; La marge de gauche. La valeur est un nombre (en pouces).
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>normalMagnification</literal> &#8212; The normal magnification factor (not zoom or scale factor). The value is a number (percentage).
fr_fr: <literal>normalMagnification</literal> &#8212; Le facteur de zoom normal (sans zoom ou sans facteur d'echelle). La valeur est un nombre (en pourcentage).
it_it: <literal>normalMagnification</literal> &#8212; Il fattore di ingrandimento normale (non zoom o fattore di scala). Il valore è un numero (percentuale).

source: <literal>orientation</literal> &#8212; The paper orientation for printing this sheet. The value is a string that can be either "landscape" or "portrait".
fr_fr: <literal>orientation</literal> &#8212; Le sens d'orientation du papier pour l'impression de la feuille. La valeur est une chaine de caractères qui peut être aussi bien"landscape" que "portrait".
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>pageBreakPreviewMagnification</literal> &#8212; The page break preview magnification factor (not zoom or scale factors). The value is a number (percentage).
fr_fr: <literal>pageBreakPreviewMagnification</literal> &#8212; Le facteur de zoom en prévisualisation du saut de page (aucun zoom ou de facteurs d'échelle). La valeur est un nombre (en pourcentage).
it_it: <literal>pageBreakPreviewMagnification</literal> &#8212; Il fattore di ingrandimento dell'anteprima per l'interruzione di pagina (non fattori di zoom o di scala). Il valore è un numero (percentuale).

source: <literal>pageBreakPreviewMode</literal> &#8212; Show page in preview mode? The value is a boolean.
fr_fr: <literal>pageBreakPreviewMode</literal> &#8212; Faut-il montrer les page en mode prévisualisation? La valeur est un booléen.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>pageStart</literal> &#8212; The page number at which to commence printing. The value is a number.
fr_fr: <literal>pageStart</literal> &#8212; Le numéro de page à partir duquel commencer à imprimer. La valeur est un nombre.
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>paperSize</literal> &#8212; The paper size to be used when printing this sheet. The value is a string that can be one of "a4", "a3", "letter", "legal" etc (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/PaperSize.html"> jxl.format.PaperSize </ulink> ).
fr_fr: <literal>paperSize</literal> &#8212; La taille du papier à utiliser pour l'impression de cette feuille. La valeur est une chaine de caractères qui peut être soit "a4", "a3", "letter", "legal" etc (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/PaperSize.html"> jxl.format.PaperSize </ulink> ).
it_it: <literal>paperSize</literal> &#8212; La dimensione dellapagina da usare quando si stampa questo foglio. Il valore è una stringa che può essere un valore tra "a4", "a3", "letter", "legal" ecc. (Si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/PaperSize.html"> jxl.format.PaperSize </ulink> ).

source: <literal>password</literal> &#8212; The password for this sheet. The value is a string.
fr_fr: <literal>password</literal> &#8212; Le mot de passe pour cette feuille. La valeur est une chaine de caractères.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>passwordHash</literal> &#8212; The password hash - used only when copying sheets. The value is a string.
fr_fr: <literal>passwordHash</literal> &#8212; Le type de hash du mot de passe - utilisation avec la copie de feuilles. La valeur est une chaine de caractères.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>printGridLines</literal> &#8212; Should grid lines be printed? The value is a boolean.
fr_fr: <literal>printGridLines</literal> &#8212; Faut-il imprimer les lignes de la grille? La valeur est un booléen.
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>printHeaders</literal> &#8212; Should headers be printed? The value is a boolean.
fr_fr: <literal>printHeaders</literal> &#8212; Faut-il imprimer les entêtes? La valeur est un booléen.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>sheetProtected</literal> &#8212; Should the sheet be protected (read-only)? The value is a boolean.
fr_fr: <literal>sheetProtected</literal> &#8212; Faut-il que la feuille soit protégé (en lecture seule)? La valeur est un booléen.
it_it: <literal>bottomMargin</literal> &#8212; Il margine inferiore. Il valore è un numero (pollici).

source: <literal>recalculateFormulasBeforeSave</literal> &#8212; Should the formulas be re-calculated when the sheet is saved? The value is a boolean. Default value is false.
fr_fr: <literal>recalculateFormulasBeforeSave</literal> &#8212; Faut-il que les formules soit recalculées quand la feuille est sauvegardée? La valeur est un booléen. Par fdéfaut la valeur est false.
it_it: <literal>recalculateFormulasBeforeSave</literal> &#8212; Le formule devono essere ricalcolate quando viene salvato il foglio? Il valore è un boolean. Il default è false.

source: <literal>rightMargin</literal> &#8212; The right margin. The value is a number (inches).
fr_fr: <literal>rightMargin</literal> &#8212; La marge de droit. La valeur est un nombre (en pouces).
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>scaleFactor</literal> &#8212; The scale factor for this sheet to be used when printing. The value is a number (percent).
fr_fr: <literal>scaleFactor</literal> &#8212; Le facteur de zoom pour cette feuille à utiliser pour l'impression. la valeur est un nombre (en pourcentage).
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>selected</literal> &#8212; Should the sheet be selected when the workbook opens? The value is a boolean.
fr_fr: <literal>selected</literal> &#8212; Faut-il que la feuille soit sélectionné quand le classeur s'ouvre? La valeur est un booléen.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>showGridLines</literal> &#8212; Should gridlines be shown? The value is a boolean.
fr_fr: <literal>showGridLines</literal> &#8212; Faut-il montrer la grille ? La valeur est un booléen.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>topMargin</literal> &#8212; The top margin. The value is a number (inches).
fr_fr: <literal>topMargin</literal> &#8212; La marge du haut. La valeur est un nombre (en pouces).
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>verticalCentre</literal> &#8212; Center verically? The value is a boolean.
fr_fr: <literal>verticalCentre</literal> &#8212; Centrer verticallement? La valeur est un booléen.
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>verticalFreeze</literal> &#8212; The row at which the pane is frozen vertically. The value is a number.
fr_fr: <literal>verticalFreeze</literal> &#8212; La ligne à partir de laquelle le volet est bloqué verticallement. La valeur est un nombre.
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>verticalPrintResolution</literal> &#8212; The vertical print resolution. The value is a number.
fr_fr: <literal>verticalPrintResolution</literal> &#8212; La résolution d'impression verticale. La valeur est un nombre.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>zoomFactor</literal> &#8212; The zoom factor. Do not confuse zoom factor (which relates to the on screen view) with scale factor (which refers to the scale factor when printing). The value is a number (percentage).
fr_fr: <literal>zoomFactor</literal> &#8212; Le facteur de zoom. Ne pas confondre avec le facteur de zoom (qui est relatif à la vue écran) et le facteur d'échelle (qui se réfère au facteur d'échelle pour l'impression). La valeur est un nombre (en pourcentage).
it_it: <literal>zoomFactor</literal> &#8212; Fattore di zoom. Da non confondere con il fattore di zoom (che è relazionato alla vista dello schermo) con il fattore di scala (che si riferisce al fattore di scala in fase di stampa). Il valore è un numero (percentuale).

source: Child elemenents
fr_fr: Les élements enfants
it_it: Elementi figli

source: <literal>&lt;e:printArea/&gt;</literal> &#8212; Zero or more print area definitions (see <xref linkend="excel.printareatitles"/> ).
fr_fr: <literal>&lt;e:printArea/&gt;</literal> &#8212; Zéro ou plusieurs définitions des zones d'impressions (voir <xref linkend="excel.printareatitles"/> ).
it_it: <literal>&lt;e:printArea/&gt;</literal> &#8212; Zero o più definizioni di area di stampa (Si veda <xref linkend="excel.printareatitles"/> ).

source: <literal>&lt;e:printTitle/&gt;</literal> &#8212; Zero or more print title definitions (see <xref linkend="excel.printareatitles"/> ).
fr_fr: <literal>&lt;e:printTitle/&gt;</literal> &#8212; Zéro ou plusieurs définitions de titres pour l'impression (voir <xref linkend="excel.printareatitles"/> ).
it_it: <literal>&lt;e:printTitle/&gt;</literal> &#8212; Zero o più definizioni di titolo di stampa(Si veda <xref linkend="excel.printareatitles"/> ).

source: <literal>&lt;e:headerFooter/&gt;</literal> &#8212; Zero or more header/footer definitions (see <xref linkend="excel.headersfooters"/> ).
fr_fr: <literal>&lt;e:headerFooter/&gt;</literal> &#8212; Zéroou plusieurs définitions d'entêtes/pieds de pages (voir <xref linkend="excel.headersfooters"/> ).
it_it: <literal>&lt;e:headerFooter/&gt;</literal> &#8212; Zero o più definizioni di header/footer (Si veda <xref linkend="excel.headersfooters"/>).

source: Zero or more worksheet commands (see <xref linkend="excel.worksheetcommands"/> ).
fr_fr: Zéro ou plusieurs commandes de feuilles de calculs (voir <xref linkend="excel.worksheetcommands"/> ).
it_it: Zero o più comandi di worksheet (si veda <xref linkend="excel.worksheetcommands"/>).

source: <literal>header</literal>&#8212; Contents that will be placed at the top of the data block, above the column headers (if any).
fr_fr: <literal>header</literal>&#8212; Contenu qui sera placé dans le haut de bloc de données, au dessus des entêtes de colonnes (s'il y en a).
it_it: <literal>header</literal>&#8212; I contenuti che verranno messi in cima al blocco di dati, sopra le intestazioni della colonna (se presenti).

source: <literal>footer</literal>&#8212; Contents that will be placed at the bottom of the data block, below the column footers (if any).
fr_fr: <literal>footer</literal>&#8212; Contenu qui sera placé en bas du bloc de données, au dessous du bas des colonnes (s'il y en a).
it_it: <literal>footer</literal>&#8212; I contenuti che verranno messi in fondo al blocco di dati, sotto i pié di pagina della colonna (se presenti).

source: defines a worksheet with the name "foo", starting at B2.
fr_fr: défini un classeur de calcul avec le nom "foo", commençant en B2.
it_it: definisce un worksheet con nome "foo", che inizia in B2.

source: Columns
fr_fr: Les colonnes
it_it: Colonne
