Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Excel.po
Languages: fr_fr, it_it

source: Columns are the children of worksheets and the parents of cells, images, formulas and hyperlinks. They are the structure that control the iteration of the worksheet data. See <xref linkend="excel.fontsandlayout.columnsettings"/> for formatting.
fr_fr: Les colonnes sont les enfants des feuilles de calculs et les parents des cellules, des images, formules et hyperliens. Ils sont la structure qui controle l'itération dans les données de la feuille de calcul. Voir <xref linkend="excel.fontsandlayout.columnsettings"/> pour le formattage.
it_it: Le colonne sono figle dei worksheet e padri delle celle, immagini, formule e collegamenti. Sono la struttura che controlla l'iterazione dei dati del worksheet. Si veda <xref linkend="excel.fontsandlayout.columnsettings"/> per la formattazione.

source: <literal>&lt;e:cell/&gt;</literal> &#8212; Zero or more cells (see <xref linkend="excel.cells"/> ).
fr_fr: <literal>&lt;e:cell/&gt;</literal> &#8212; Zéro ou plusieurs cellules (voir <xref linkend="excel.cells"/> ).
it_it: <literal>&lt;e:cell/&gt;</literal> &#8212; Zero o più celle (vedere <xref linkend="excel.cells"/> ).

source: <literal>&lt;e:formula/&gt;</literal> &#8212; Zero or more formulas (see <xref linkend="excel.formulas"/> ).
fr_fr: <literal>&lt;e:formula/&gt;</literal> &#8212; Zéro ou plusieurs formules (voir <xref linkend="excel.formulas"/> ).
it_it: <literal>&lt;e:formula/&gt;</literal> &#8212; Zero o più formule (vedere <xref linkend="excel.formulas"/> ).

source: <literal>&lt;e:image/&gt;</literal> &#8212; Zero or more images (see <xref linkend="excel.images"/> ).
fr_fr: <literal>&lt;e:image/&gt;</literal> &#8212; Zéro ou plusieurs images (voir <xref linkend="excel.images"/> ).
it_it: <literal>&lt;e:image/&gt;</literal> &#8212; Zero o più immagini (vedere <xref linkend="excel.images"/> ).

source: <literal>&lt;e:hyperLink/&gt;</literal> &#8212; Zero or more hyperlinks (see <xref linkend="excel.hyperlinks"/> ).
fr_fr: <literal>&lt;e:hyperLink/&gt;</literal> &#8212; Zéro ou plusieurs hyperliens (voir <xref linkend="excel.hyperlinks"/> ).
it_it: <literal>&lt;e:hyperLink/&gt;</literal> &#8212; Zero o più hyperlink (vedere <xref linkend="excel.hyperlinks"/> ).

source: <literal>header</literal> &#8212; This facet can/will contain one <literal>&lt;e:cell&gt;</literal> , <literal>&lt;e:formula&gt;</literal> , <literal>&lt;e:image&gt;</literal> or <literal>&lt;e:hyperLink&gt;</literal> that will be used as header for the column.
fr_fr: <literal>header</literal> &#8212; Ce facet peut/pourra contenenir une <literal>&lt;e:cell&gt;</literal> , une <literal>&lt;e:formula&gt;</literal> , une <literal>&lt;e:image&gt;</literal> ou un <literal>&lt;e:hyperLink&gt;</literal> qui sera utilisé comme entête pour la colonne.
it_it: <literal>header</literal> &#8212; Questo facet può contenere un <literal>&lt;e:cell&gt;</literal>, <literal>&lt;e:formula&gt;</literal>, <literal>&lt;e:image&gt;</literal> o <literal>&lt;e:hyperLink&gt;</literal> che verrà usato come intestazione per la colonna.

source: <literal>footer</literal> &#8212; This facet can/will contain one <literal>&lt;e:cell&gt;</literal> , <literal>&lt;e:formula&gt;</literal> , <literal>&lt;e:image&gt;</literal> or <literal>&lt;e:hyperLink&gt;</literal> that will be used as footer for the column.
fr_fr: <literal>footer</literal> &#8212; Ce facet peux/pourra contenir une <literal>&lt;e:cell&gt;</literal> , une <literal>&lt;e:formula&gt;</literal> , une <literal>&lt;e:image&gt;</literal> ou un <literal>&lt;e:hyperLink&gt;</literal> qui sera utilisé pour le pied de la colonne.
it_it: <literal>footer</literal> &#8212; Questo facet può contenere un <literal>&lt;e:cell&gt;</literal>, <literal>&lt;e:formula&gt;</literal>, <literal>&lt;e:image&gt;</literal> o <literal>&lt;e:hyperLink&gt;</literal> che verrà usato come pié di pagina per la colonna.

source: defines a column with a header and an iterated output
fr_fr: définie une colonne avec un entétête et une sortie itérable
it_it: definisce una colonna con un'intestazione ed un output iterato.

source: Cells
fr_fr: Les cellules
it_it: Celle

source: Cells are nested within columns (for iteration) or inside worksheets (for direct placement using the <literal>column</literal> and <literal>row</literal> attributes) and are responsible for outputting the value (usually through an EL-expression involving the <literal>var</literal>-attribute of the datatable. See
fr_fr: Les cellules sont regroupé dans des colonnes (pour l'itération) ou dans des classeurs (pour un positionnement directe en utilisant les attributs <literal>column</literal> et <literal>row</literal>) et sont responsable pour l'affichage de valeurs (habituellement au travers d'expressions EL en liaison avec l'attribut <literal>var</literal>-de la base de données. Voir
it_it: Le celle sono innestate dentro le colonne (per l'iterazione) o dentro i worksheet (per il collocamento diretto usando gli attributi <literal>column</literal> e <literal>row</literal>) e sono responsabili dell'output del valore (solitamente tramite un'espressione EL che coinvolge l'attributo <literal>var</literal> della datatable. Vedere

source: <literal>column</literal> &#8212; The column where to place the cell. The default is the internal counter. The value is a number. Note that the value is 0-based.
fr_fr: <literal>column</literal> &#8212; La colonne où la position de la cellule. Par défaut c'est un compteur interne. La valeur est un nombre. Notez que la valeur est basé sur un index zéro.
it_it: <literal>column</literal> &#8212; La colonna dove mettere la cella. Il default è un contatore interno. Il valore è un numero. Si noti che il valore parte da 0.

source: <literal>row</literal> &#8212; The row where to place the cell. The default is the internal counter. The value is number. Note that the value is 0-based.
fr_fr: <literal>row</literal> &#8212; La ligne où est localisé la cellule. Par défaut c'est un compteur interne. La valeur est un nombre. Notez que la valeur est basé sur un index zéro.
it_it: <literal>row</literal> &#8212; La riga dove mettere la cella. Il default è un contatore interno. Il valore è un numero. Si noti che il valore parte da 0.

source: <literal>value</literal> &#8212; The value to display. Usually an EL-expression referencing the var-attribute of the containing datatable. The value is a string.
fr_fr: <literal>value</literal> &#8212; La valeur à afficher. Habituellement une expression EL référençant un attribut var lié à la base de données. La valeur est une chaine de caractères.
it_it: <literal>value</literal> &#8212; Il valore da mostrare. Solitamente un'espressione-EL che fa riferimento all'attributo della variabile della datatable che lo contiene. Il valore è una stringa.

source: <literal>comment</literal> &#8212; A comment to add to the cell. The value is a string.
fr_fr: <literal>comment</literal> &#8212; Un commentaire à ajouter à la cellule. La valeur est une chaine de caractères.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>commentHeight</literal> &#8212; The height of the comment. The value is a number (in pixels).
fr_fr: <literal>commentHeight</literal> &#8212; La hauteur du commentaire. La valeur est un nombre (en pixel).
it_it: <literal>rightMargin</literal> &#8212; Il margine destro. Il valore è un numero (pollici).

source: <literal>commentWidth</literal> &#8212; A width of the comment. The value is a number (in pixels).
fr_fr: <literal>commentWidth</literal> &#8212; La largeur du commentaire. la valeur est un nombre (en pixels).
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: Zero or more validation conditions (see <xref linkend="excel.cells.validation"/> ).
fr_fr: Zéro ou plusieurs conditions de validation (voir <xref linkend="excel.cells.validation"/> ).
it_it: Zero o più condizioni di validazione (si veda <xref linkend="excel.cells.validation"/> ).

source: Validation
fr_fr: La validation
it_it: Validazione

source: Validations are nested inside cells or formulas. They add constrains for the cell data.
fr_fr: Les validations sont incluses dans les cellules ou les formules. Elles ajoutent des contraintes pour les données des cellules.
it_it: Le validazioni vengono innestate dentro celle o formule. Esse aggiungono vincoli ai dati di cella.

source: <literal>value</literal> &#8212; The limit (or lower limit where applicable) of the validation. The value is a number.
fr_fr: <literal>value</literal> &#8212; La limite (ou la limite basse quand c'est applicable) de la validation. La valeur est un nombre.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>value2</literal> &#8212; The upper limit (where applicable) of the validation. The value is a number.
fr_fr: <literal>value2</literal> &#8212; La limite haute (quand c'est applicable) de la validation. La valeur est un nombre.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>condition</literal> &#8212; The validation condition. The value is a string.
fr_fr: <literal>condition</literal> &#8212; La condition de validation. La valeur est une chaine de caractères.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: "equal" - requires the cell value to match the one defined in the value-attribute
fr_fr: "equal" - requise la valeur de la cellule à faire correspondre à une définie dans l'attribut valeur
it_it: "equal" - richiede che il valore della cella corrisponda a quello definito nell'attributo value

source: "greater_equal" - requires the cell value to be greater than or equal to the value defined in the value-attribute
fr_fr: "greater_equal" - requises la valeur de la cellule devant être plus grande ou égale à al valeur définie dans l'attribut valeur
it_it: "greater_equal" - richiede che il valore della cella sia maggiore o uguale al valore definito nell'attributo value

source: "less_equal" - requires the cell value to be less than or equal to the value defined in the value-attribute
fr_fr: "less_equal" - requies que la valeur de la cellule soit inférieur ou égale à la valeur définie dans l'attribut valeur
it_it: "less_equal" - richiede che il valore della cella sia minore o uguale al valore definito nell'attributo value

source: "less_than" - requires the cell value to be less than the value defined in the value-attribute
fr_fr: "less_than" - requière que la valeur de la cellule soit inférieure à la valeur définie dans la valeur attribue
it_it: "less_than" - richiede che il valore della cella sia minore del valore definito nell'attributo value

source: "not_equal" - requires the cell value to not match the one defined in the value-attribute
fr_fr: "not_equal" - requière que la valeur de la cellule ne corresponde pas à celle définie dans l'attribut valeur.
it_it: "not_equal" - richiede che il valore della cella non corrisponda al valore definito nell'attributo value

source: "between" - requires the cell value to be between the values defined in the value- and value2 attributes
fr_fr: "between" - requière que la valeur de la cellule soit entre les valeur définies dans les attributs valeur- et valeur2
it_it: "between" - richiede che il valore della cella sia compreso tra i valori definiti negli attributi value e value2

source: "not_between" - requires the cell value not to be between the values defined in the value- and value2 attributes
fr_fr: "not_between" - requière que la valeur de la cellule ne soit pas entre les valeur définies dans les attributs valeur- et valeur2
it_it: "not_between" - richiede che il valore della cella non sia compreso tra i valori definiti negli attributi value e value2

source: adds numeric validation to a cell specifying that the value must be between 4 and 18.
fr_fr: ajoute une validation numérique à une cellule en spécifiant que la valeur doit être entre 4 et 18.
it_it: aggiunge la validazione numerica alla cella specificando che il valore deve essere tra 4 e 18.

source: <literal>startColumn</literal> &#8212; The starting column of the range of values to validate against. The value is a number.
fr_fr: <literal>startColumn</literal> &#8212; La colonne de départ pour un écart de valeur serva,t à valider. La valeur est un nombre.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>startRow</literal> &#8212; The starting row of the range of values to validate against. The value is a number.
fr_fr: <literal>startRow</literal> &#8212; La ligne de départ d'un écart de valeur servant à valider. la valeur est un nombre.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>endColumn</literal> &#8212; The ending column of the range of values to validate against. The value is a number.
fr_fr: <literal>endColumn</literal> &#8212; La colonne de fin d'un écart de valeur servant à valider. La valeur est un nombre.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>endRow</literal> &#8212; The ending row of the range of values to validate against. The value is a number.
fr_fr: <literal>endRow</literal> &#8212; La ligne de fin d'un écart de valeur servant à valider. La valeur est un nombre.
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: adds validation to a cell specifying that the value must be in the values specified in range A1:A10.
fr_fr: ajoute la validation à une cellule spécifiant que la valeur doit être comprise dans les valeurs spécifiées dans la zone A1:A10.
it_it: aggiunge la validazione ad una cella specificando che il valore deve essere in valori specificati nel range A1:A10.

source: Zero or more list validation items.
fr_fr: Zéro ou une liste d'éléments de validations.
it_it: Zero o più elementi di validazione lista.

source: e:listValidation is a just a container for holding multiple e:listValidationItem tags.
fr_fr: e:listValidation est juste un containeur pour conserver les multiples balises e:listValidationItem.
it_it: e:listValidation è solo un container per mantenere diversi tag e:listValidationItem.

source: <literal>value</literal> &#8212; A values to validate against.
fr_fr: <literal>value</literal> &#8212; Une valeur servant à valider.
it_it: <literal>value</literal> &#8212; Un valore da validare.

source: adds validation to a cell specifying that the value must be "manager" or "employee".
fr_fr: ajoute une validation à la cellule spécifiant que la valeur doit être "manager" ou "employee".
it_it: aggiunge la valodazione ad una cella specificando che il valore deve essere "manager" o "employee".

source: Format masks
fr_fr: Masque de formatage
it_it: Maschere per il formato

source: Format masks are defined in the mask attribute in cells or formulas. There are two types of format masks, one for numbers and one for dates
fr_fr: Les masques de formatage sont spécifiés dans l'attribut masque des cellules ou des formules. Il ya deux types de masques de formatage, un pour les nombres, l'autree pour les dates
it_it: Le maschere di formato sono definite nell'attributo maschera in celle o formule. Ci sono due tipi di maschere di formato, uno per numeri e uno per date.

source: Number masks
fr_fr: Les masques pour les nombres
it_it: Maschere per il numero

source: When encountering a format mask, first it is checked if it is in internal form, e.g "format1", "accounting_float" and so on (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/write/NumberFormats.html"> jxl.write.NumberFormats </ulink> ).
fr_fr: Quand on rencontre un masque de format, en premier il est vérifié s'il est de la forme interrne, par exemple "format1", "accounting_float" et ensuite s'il (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/write/NumberFormats.html"> jxl.write.NumberFormats </ulink> ).
it_it: Incontrando una maschera di formato, in primo luogo è contrassegnata se è in una form interna, es. "format1", "accounting_float" e così via (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/write/NumberFormats.html"> jxl.write.NumberFormats</ulink> ).

source: if the mask is not in the list, it is treated as a custom mask (see <ulink url="http://java.sun.com/javase/6/docs/api/java/text/DecimalFormat.html"> java.text.DecimalFormat </ulink> ). e.g "0.00" and automatically converted to the closest match.
fr_fr: Si le masque n'est pas dans la liste, il est traité comme un masque personnalisé (voir <ulink url="http://java.sun.com/javase/6/docs/api/java/text/DecimalFormat.html"> java.text.DecimalFormat </ulink> ). par exemple "0.00" et automatiquement converti dans le correspondant le plus proche.
it_it: se la maschera non è nella lista, viene trattata come una maschera personalizzata (si veda <ulink url="http://java.sun.com/javase/6/docs/api/java/text/DecimalFormat.html"> java.text.DecimalFormat </ulink>). Es. "0.00" e automaticamente convertita nella corrispondenza più vicina.

source: Date masks
fr_fr: Les masques de date
it_it: Maschere per la data

source: When encountering a format mask, first it is checked if it is in internal form, e.g "format1", "format2" and so on (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/write/DateFormats.html"> jxl.write.DecimalFormats </ulink> ).
fr_fr: Quand il trouve un masque de formatage, en premier il est vérifié s'il est de la forme interne, par exemple "format1", "format2" et ainsi de suite (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/write/DateFormats.html"> jxl.write.DecimalFormats </ulink> ).

source: if the mask is not in the list, it is treated as a custom mask (see <ulink url="http://java.sun.com/javase/6/docs/api/java/text/DateFormat.html"> java.text.DateFormat </ulink> )., e.g "dd.MM.yyyy" and automatically converted to the closest match.
fr_fr: si le masque n'est pas dans la liste, il estr traité comme un masque personnalisé (voir <ulink url="http://java.sun.com/javase/6/docs/api/java/text/DateFormat.html"> java.text.DateFormat </ulink> )., e.g "dd.MM.yyyy" et automatiquement converti dans le correspondant le plus proche.
it_it: se la maschera non è nella lista, viene trattata come maschera personalizzata (si veda <ulink url="http://java.sun.com/javase/6/docs/api/java/text/DateFormat.html"> java.text.DateFormat </ulink> ), es. "dd.MM.yyyy" viene automaticamente convertita nella corrispondenza più vicina.

source: Formulas
fr_fr: Les formules
it_it: Formule

source: Formulas are nested within columns (for iteration) or inside worksheets (for direct placement using the <literal>column</literal> and <literal>row</literal> attributes) and add calculations or functions to ranges of cells. They are essentially cells, see <xref linkend="excel.cells"/> for available attributes. Note that they can apply templates and have own font definitions etc just as normal cells.
fr_fr: Les formules sont regroupé dans les colonnes (pour l'itération) ou dans les feuilles de calcul (pour le placement direct en utilisant les attributs <literal>column</literal> et <literal>row</literal>) et ajoute les opérations de calcul ou les fonctions à un groupe de cellules. Ils sont surtout des cellules, voir <xref linkend="excel.cells"/> pour les attributs disponibles, Notez qu'ils peuvent appliquer des modèles et ont leur propre définition depolices comme des cellules classiques.
it_it: Le formule sono innestate nelle colonne (per iterazione) o dentro i worksheet (per collocazione diretta usando gli attributi <literal>column</literal> e <literal>row</literal>) e aggiungono calcoli o funzioni ai range di celle. Sono essenzialmente celle, si veda <xref linkend="excel.cells"/> per gli attributi disponibili. Si noti che possono impiegare template ed avere definizioni proprie di font, ecc. come le normali celle.

source: The formula of the cell is placed in the <literal>value</literal> -attribute as a normal &excel; notation. Note that when doing cross-sheet formulas, the worksheets must exist before referencing a formula against them. The value is a string.
fr_fr: La formule de la cellule est placé dans l'attribut <literal>value</literal> comme une notation &excel; classique. Notez que quand on fait des formules croisant des feuilles, le classeur doit exister avant de lui référencer une formule. La valeur est une chaine de caractères.
it_it: La formula della cella è collocata nell'attributo <literal>value</literal> come una normale annotazione &excel;. Si noti che quando si fanno formule con riferimenti ad altri fogli, i worksheet devo esistere prima di eseguire riferimenti ad essa. Il valore è una stringa.

source: defines an formula in B2 summing cells A1 in worksheets FooSheet and BarSheet
fr_fr: définie une formule dans B2 sommant les cellules A1 dans les feuilles de calculs FooSheet et BarSheet
it_it: definisce una formula in B2 che somma le celle A1 nei worksheet FooSheet e BarSheet.

source: Images
fr_fr: Les images
it_it: Immagini

source: Images are nested within columns (for iteration) or inside worksheets (for direct placement using the <literal>startColumn/startRow</literal> and <literal>rowSpan/columnSpan</literal> attributes). The spans are optional and if omitted, the image will be inserted without resizing.
fr_fr: Les images sont regroupées dans les colonnes (pour l'itération) ou dans les feuilles de calculs (pour un placement direct en utilisant les attributs <literal>startColumn/startRow</literal> et <literal>rowSpan/columnSpan</literal>). L'étendue est optionnelet si il omit, l'image sera insérée sans être retaillée.
it_it: Le immagini sono innestate dentro le colonne (per iterazione) o dentro i worksheet (per collocazione diretta usando gli attributi <literal>startColumn/startRow</literal> e <literal>rowSpan/columnSpan</literal>). Gli span sono opzionali e se omessi, l'immagine verrà inserita senza ridimensionamento.

source: <literal>startColumn</literal> &#8212; The starting column of the image. The default is the internal counter. The value is a number. Note that the value is 0-based.
fr_fr: <literal>startColumn</literal> &#8212; La colonne de départ de l'image. Par défaut c'est un compteur intern. La valeur est un nombre. Notez que la valeur est basée sur un index zéro.
it_it: <literal>startColumn</literal> &#8212; La colonna iniziale dell'immagine. Il default è il contatore interno. Il valore è un numero. Si noti che il valore inizia da zero.

source: <literal>startRow</literal> &#8212; The starting row of the image. The default is the internal counter. The value is a number. Note that the value is 0-based.
fr_fr: <literal>startRow</literal> &#8212; La ligne de départ de l'image. Par défaut c'est un compteur interne. La valeur est un nombre. Notez que la valeur est basée sur un index zéro.
it_it: <literal>startRow</literal> &#8212; La riga iniziale dell'immagine. Il default è il contatore interno. Il valore è un numero. Si noti che il valore inizia da zero.

source: <literal>columnSpan</literal> &#8212; The column span of the image. The default is one resulting in the default width of the image. The value is a float.
fr_fr: <literal>columnSpan</literal> &#8212; L'étendue en colonne de l'image. Par défaut est le résultat de la largeur par défaut de l'image. La valeur est un nombre flottant.
it_it: <literal>columnSpan</literal> &#8212; Lo span di colonna dell'immagine. Il default è quello risultante nella larghezza di default dell'immagine. Il default è un float.
