Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Excel.po
Languages: fr_fr, it_it

source: This group of XLS-CSS attributes define a font and its attributes
fr_fr: Ce groupe d'attributs XLS-CSS définit une police et ces attributs
it_it: Questo gruppo di attributi XLS-CSS definisce un font ed i suoi attributi

source: The name of the font. Make sure that it's one that is supported by your system.
fr_fr: Le nom de la police. Soyez sur qu'elle est supportée par votre système.
it_it: Il nome del font. Assicurarsi che sia supportato del proprio sistema.

source: The font size. Use a plain number
fr_fr: La taille de la font. Utilisez un nombre entier.
it_it: La dimensione del font. Si usi un numero intero.

source: The color of the font (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
fr_fr: La couleur de la police (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
it_it: Il colore dei font (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html">jxl.format.Colour</ulink> ).

source: Should the font be bold? Valid values are "true" and "false"
fr_fr: Doit-elle être en gras? Les valeurs valides sont "true" et "false"
it_it: Il font deve essere in grassetto? I valori validi sono "true" and "false"

source: Should the font be italic? Valid values are "true" and "false"
fr_fr: Doit-elle être en italique? Les valeurs valides sont "true" et "false"
it_it: Il font deve essere in corsivo? I valori validi sono "true" and "false"

source: The script style of the font (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/ScriptStyle.html"> jxl.format.ScriptStyle </ulink> ).
fr_fr: Le style de script de la police (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/ScriptStyle.html"> jxl.format.ScriptStyle </ulink> ).

source: The underline style of the font (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/UnderlineStyle.html"> jxl.format.UnderlineStyle </ulink> ).
fr_fr: Le style de soulignement de la police (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/UnderlineStyle.html"> jxl.format.UnderlineStyle </ulink> ).
it_it: Lo stile sottolineato del font (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/UnderlineStyle.html"> jxl.format.UnderlineStyle </ulink> ).

source: Should the font be struck out? Valid values are "true" and "false"
fr_fr: Doit-elle être soulignée? Les valeurs valides sont "true" et "false"
it_it: Il font deve essere barrato? I valori validi sono "true" e "false"

source: A shorthand notation for setting all the values. Place the font name last and use tick marks for fonts with spaces in them, e.g. 'Times New Roman'. Use "italic", "bold" and "struckout".
fr_fr: Un notation plus courte pour définir toutes ces valeurs. Indiquez le nom de la police à la fin et utilisez les graduations de la polices avec des espaces entre eux, par exemple 'Times New Roman'. Utilisez "italic", "bold" et "struckout".
it_it: Una notazione breve per impostare tutti i valori. Si collochi il nome del font in fondo e si usino i tick mark per i font separati da uno spazio, es. 'Times New Roman'. Si usi "italic", "bold" e "struckout".

source: Borders
fr_fr: Les bordures
it_it: Bordi

source: This group of XLS-CSS attributes defines the borders of the cell
fr_fr: Ce groupe d'attributs XLS-CSS déinissent les bordures de la cellule
it_it: Questo gruppo di attributi XLS-CSS definisce i bordi della cella

source: The border color of the left edge of the cell (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
fr_fr: La couleur de la bordure pour la bordure gauche de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
it_it: Il colore del bordo del lato sinistro della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).

source: The border line style of the left edge of the cell (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
fr_fr: Le style de la ligne de bordure de la bordure gauche de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
it_it: Lo stile di linea del bordo del lato sinistro della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).

source: A shorthand for setting line style and color of the left edge of the cell, e.g style="xls-border-left: thick red"
fr_fr: Un raccourci pour définir le style de la ligne et la couleur de la bordure gauche de la cellule, par exemple style="xls-border-left: thick red"
it_it: Una notazione breve per impostare lo stile della linea ed il colore del lato sinistro della cella, es. style="xls-border-left: thick red"

source: The border color of the top edge of the cell (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
fr_fr: La couleur de la bordure pour la bordure suppérieure de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
it_it: Il colore del bordo del lato alto della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).

source: The border line style of the top edge of the cell (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
fr_fr: Le style de la ligne de la bordure du bord suppérieur de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
it_it: Lo stile di linea del bordo del lato alto della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).

source: A shorthand for setting line style and color of the top edge of the cell, e.g style="xls-border-top: red thick"
fr_fr: Un raccourci pour définir le style de la ligne et de la couleur de la bordure suppérieure de la cellule, par exemple style="xls-border-top: red thick"
it_it: Una notazione breve per impostare lo stile della linea ed il colore del lato alto della cella, es. style="xls-border-top: red thick"

source: The border color of the right edge of the cell (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
fr_fr: La couleur de la bordure de la bordure droite de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
it_it: Il colore del bordo del lato destro della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).

source: The border line style of the right edge of the cell (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
fr_fr: Le style de la ligne de bordure de la bordure de droit de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
it_it: Lo stile di linea del bordo del lato destro della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).

source: A shorthand for setting line style and color of the right edge of the cell, e.g style="xls-border-right: thick red"
fr_fr: Un raccourci pour définir le style de la ligne et la couleur pour la bordure droit de la cellule , par exemple style="xls-border-right: thick red"
it_it: Una notazione breve per impostare lo stile della linea ed il colore del lato destro della cella, es. style="xls-border-right: thick red"

source: The border color of the bottom edge of the cell (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
fr_fr: La couleur de la bordure de la bordure inférieure de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).
it_it: Il colore del bordo del lato basso della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Colour.html"> jxl.format.Colour </ulink> ).

source: The border line style of the bottom edge of the cell (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
fr_fr: Le style de ligne de bordure dans le bord inférieur de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
it_it: Lo stile di linea del bordo del lato basso della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).

source: A shorthand for setting line style and color of the bottom edge of the cell, e.g style="xls-border-bottom: thick red"
fr_fr: Un raccourci pour définir les réglages du style de la ligne pour la bordure inférieure de la cellule , par exemple style="xls-border-bottom: thick red"
it_it: Una notazione breve per impostare lo stile della linea ed il colore del lato basso della cella, es. style="xls-border-bottom: thick red"

source: A shorthand for setting line style and color for all edges of the cell, e.g style="xls-border: thick red"
fr_fr: Une version courte pour définir un style de ligne et de couleur pour toutes les bordures de la cellule, par exemple style="xls-border: thick red"
it_it: Una notazione breve per impostare lo stile della linea ed il colore per tutti i lati della cella, es. style="xls-border: thick red"

source: Background
fr_fr: Arrière plan

source: This group of XLS-CSS attributes defines the background of the cell
fr_fr: Ce groupe d'attributs XLS-CSS définissent l'arrière plan de la cellule
it_it: Questo gruppo di attributi XLS-CSS definisce il background della cella

source: The color of the background (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
fr_fr: La couleur de l'arrière plan (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html"> jxl.format.LineStyle </ulink> ).
it_it: Il colore del background (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/LineStyle.html">jxl.format.LineStyle</ulink> ).

source: The pattern of the background (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Pattern.html"> jxl.format.Pattern </ulink> ).
fr_fr: Le patron de l'arrière plan (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Pattern.html"> jxl.format.Pattern </ulink> ).
it_it: Il pattern del background (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Pattern.html"> jxl.format.Pattern </ulink> ).

source: A shorthand for setting the background color and pattern. See above for rules.
fr_fr: Un raccourci pour définir la couleur d'arrière plan et le patron. Voir plus loiin les règles.
it_it: Una notazione breve per impostare il pattern ed il colore del background. Vedere sopra per le regole.

source: Column settings
fr_fr: Les réglages de la colonne
it_it: Impostazioni colonna

source: This group of XLS-CSS attributes defines the column widths etc.
fr_fr: Ce group d'attributs XLS-CSS définissent les largeurs de la colonne etc.
it_it: Questo gruppo di attributi XLS-CSS definisce le larghezze di colonna, ecc.

source: The width of the column. Use largeish values (~5000) to start with. Used by the e:column in xhtml mode.
fr_fr: La largeur de la colonne. Utilisez une valeur importante (~5000) pour commencer. Utiliser par e:column dans le mode xhtml.
it_it: La larghezza della colonna. Si usino valori ampi (~5000) per cominciare. Usata da e:column nella modalità xhtml.

source: The width of the column. Use largeish values (~5000) to start with. Used by the excel exporter, placed in the datatable style attribute. Use numerical values or * to bypass a column.
fr_fr: La largeur de la colonne? Utilisez les valeurs importante (~5000) pour commencer. Utiliser par l'exportateur d'excel, à indiquer dans l'attribut de style de la table de données. Utilisez des valeurs numériques ou * pour laisser libre une colonne.
it_it: La larghezza della colonna. Si usino valori ampi (~5000) per cominciare. Usata dall'excel exporter, collocato nell'attributo style della datatable. Si usino valori numerici o * per bypassare una colonna.

source: Example style="xls-column-widths: 5000, 5000, *, 10000"
fr_fr: Exemple style="xls-column-widths: 5000, 5000, *, 10000"
it_it: Esempio style="xls-column-widths: 5000, 5000, *, 10000"

source: Should an attempt be made to autosize the column? Valid values are "true" and "false".
fr_fr: Faut il avoir une taille automatique pour la colonne? Les valeurs valides sont "true" et "false".
it_it: Deve essere fatto un tentativo per autodimensionare la colonna? I valori validi sono "true" and "false".

source: Should the column be hidden? Valid values are "true" and "false".
fr_fr: La colonne doit elle être cachée? Les valeurs valides sont "true" et "false".
it_it: La colonna deve essere nascosta? I valori validi sono "true" e "false".

source: Should the column be shown in export? Valid values are "true" and "false". Default is "true".
fr_fr: La colonne doit elle être montrée dans l'exportation? Les valeurs valides sont "true" et "false".Par défaut c'est "true".
it_it: La colonna deve essere mostrata nell'esportazione? I valori validi sono "true" e "false". Il valore di default è "true".

source: Cell settings
fr_fr: Les réglages de la cellule
it_it: Impostazioni cella

source: This group of XLS-CSS attributes defines the cell properties
fr_fr: Ce groupe d'attributs XLS-CSS dé"finissent les propriétés de cellule
it_it: Questo gruppo di attributi XLS-CSS definisce le proprietà della cella

source: The alignment of the cell value (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Alignment.html"> jxl.format.Alignment </ulink> ).
fr_fr: L'allignement de la valeur de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Alignment.html"> jxl.format.Alignment </ulink> ).
it_it: L'allineamento del valore della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Alignment.html"> jxl.format.Alignment </ulink> ).

source: The forced type of the cell data. The value is a string that can be one of "general", "number", "text", "date", "formula" or "bool". The type is automatically detected so there is rarely any use for this attribute.
fr_fr: Le type forcé de la donnée de la cellule. La valeur est une chaine de caractères qui peut être une de celle-ci "general", "number", "text", "date", "formula" or "bool". Le type est automatiquement détecté donc c'est rare de devoir utiliser cet attribut.
it_it: Il tipo forzato dei dati della cella. Il valore è una stringa che può essere una tra "general", "number", "text", "date", "formula" o "bool". Il tipo è automaticamente individuato e quindi quest'attributo si usa raramente.

source: The format mask of the cell, see
fr_fr: Le masque de format de la cellule, voir
it_it: La maschera di formato della cella, si veda

source: The indentation of the cell value. The value is numeric.
fr_fr: L'indentation de la valeur de la cellule. La valeur est un nombre.
it_it: L'indentazione del valore della cella. Il valore è numerico.

source: Should the cell be locked. Use with workbook level locked. Valid values are "true" and "false".
fr_fr: Faut-il que la cellule soit vérouillée. A utiliser avec le niveau de vérouillage du classeur. Les valeurs valides sont "true" et "false".
it_it: Se la cella debba essere bloccata. Da usare con il livello workbook bloccato. I valori validi sono "true" e "false".

source: The orientation of the cell value (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Orientation.html"> jxl.format.Orientation </ulink> ).
fr_fr: L'orientation de la valeur de la cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Orientation.html"> jxl.format.Orientation </ulink> ).
it_it: L'orientamento del valore della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/Orientation.html"> jxl.format.Orientation </ulink> ).

source: The vertical alignment of the cell value (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/VerticalAlignment.html"> jxl.format.VerticalAlignment </ulink> ).
fr_fr: L'alignement verticale de la valeur de cellule (voir <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/VerticalAlignment.html"> jxl.format.VerticalAlignment </ulink> ).
it_it: L'allineamento verticale del valore della cella (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/format/VerticalAlignment.html"> jxl.format.VerticalAlignment </ulink> ).

source: Should the cell values shrink to fit? Valid values are "true" and "false".
fr_fr: Les valeurs de la cellules doivent être réduite pour correspondre? Les valeurs valides sont "true" et "false".
it_it: I valori della cella devono adattarsi alla dimensione? I valori validi sono "true" e "false".

source: Should the cell wrap with newlines? Valid values are "true" and "false".
fr_fr: La cellule doit elle s'étendre avec des nouvelles lignes ? Les valeurs valides sont "true" et "false".
it_it: La cella deve contenere nuove linee? I valori validi sono "true" e "false".

source: The datatable exporter
fr_fr: L'exportateur de base de données
it_it: L'exporter delle datatable

source: The datatable exporter uses the same xls-css attributes as the xhtml document with the exception that column widths are defined with the <literal>xls-column-widths</literal> attribute on the datatable (since the UIColumn doesn't support the style or styleClass attributes).
fr_fr: L'exportateur de la table de données utilise les même attributs xls-css comme document xhtml avec l'exception suivante que les largeurs de colonnes sont définies avec l'attribut<literal>xls-column-widths</literal> de la table de données (car UIColumn ne permet pas d'avoir les attributs style ou styleClass).
it_it: L'exporter delle datatable impiega gli stessi attributi xls-css come documento xhtml con l'eccezione che le larghezze di colonna vengono definite con l'attributo <literal>xls-column-widths</literal> nella datatable (poiché UIColumn non supporta gli attributi style o styleClass).

source: Layout examples
fr_fr: Les exemples de calques
it_it: Esempi di layout

source: TODO
fr_fr: A FAIRE

source: Limitations
fr_fr: Les limitations
it_it: Limitazioni

source: In the current version there are some known limitations regarding CSS support
fr_fr: Dans la version actuelle, il y a quelques limitations connues par rapport au support de CSS
it_it: Nell'attuale versione ci sono alcune note limitazioni riguardanti il supporto CSS.

source: When using .xhtml documents, stylesheets must be referenced through the <literal>&lt;e:link&gt;</literal> tag
fr_fr: Avec l'utilisation de documents .xhtml, les feuilles de styles doivent être référencés au travers d'une balise <literal>&lt;e:link&gt;</literal>
it_it: Usando i documenti xhtml, gli stylesheet devono fare riferimento tramite il tag <literal>&lt;e:link&gt; tag</literal>

source: When using the datatable exporter, CSS must be entered through style-attributes, external stylesheets are not supported
fr_fr: Avec l'utilisation de l'exportateur de table de donné, le CSS doit être entré en mode d'attributs, les feuilles de styles externes ne sont pas supportées
it_it: Usando l'exporter delle datatable, i CSS devono essere inseriti negli attributi style, gli stylesheet esterni non sono supportati

source: Internationalization
fr_fr: Internationalisation
it_it: Internazionalizzazione

source: There are only two resources bundle keys used, both for invalid data format and both take a parameter (the invalid value)
fr_fr: Il ya seulement deux clefs livrées utilisées, les deux pour des formatage de données invalides et les deux prennent une paramètree (la valeur invalide)
it_it: Ci sono solo due chiavi di resource bundle usate, entrambe per il formato di data invalido ed entrambi prendono un parametro (il valore chiave)

source: <literal>org.jboss.seam.excel.not_a_number</literal> &#8212; When a value thought to be a number could not be treated as such
fr_fr: <literal>org.jboss.seam.excel.not_a_number</literal> &#8212; Quand une valeur doit être un nombre et ne peut être traité en temps que tel
it_it: <literal>org.jboss.seam.excel.not_a_number</literal> &#8212; Quando un valore supposto essere un numero non può essere trattato come tale

source: <literal>org.jboss.seam.excel.not_a_date</literal> &#8212; When a value thought to be a date could not be treated as such
fr_fr: <literal>org.jboss.seam.excel.not_a_date</literal> &#8212; Quand une valeur doit être une date ne peux être traité en tant que telle
it_it: <literal>org.jboss.seam.excel.not_a_date</literal> &#8212; Quando un valore supposto essere una data non può essere trattato come tale

source: Links and further documentation
fr_fr: Les liens et de la documentation additionnelle
it_it: Link ed ulteriore documentazione

source: The core of the &excel; functionality is based on the excellent JExcelAPI library which can be found on <ulink url="http://jexcelapi.sourceforge.net">http://jexcelapi.sourceforge.net/</ulink> and most features and possible limitations are inherited from here.
fr_fr: Le coeur des fonctionnalitées de &excel; est basé sur l'excelente bibliothèque JExcelAPI qui peut être trouvé sur <ulink url="http://jexcelapi.sourceforge.net">http://jexcelapi.sourceforge.net/</ulink> et la plus part des fonctionnalités et les limitations possibles ont été héritées.
it_it: Il nucleo delle funzionalità &excel; è basato sull'eccellente libreria JExcelAPI che può essere trovata in <ulink url="http://jexcelapi.sourceforge.net">http://jexcelapi.sourceforge.net/</ulink> e la maggior parte delle funzionalità e le possibili limitazioni sono ereditate da qua.
