Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Excel.po
Languages: fr_fr, it_it

source: Seam also supports generation of &excel; spreadsheets through the excellent <ulink url="http://jexcelapi.sourceforge.net/">JExcelAPI </ulink> library. The generated document is compatible with &excel; versions 95, 97, 2000, XP and 2003. Currently a limited subset of the library functionality is exposed but the ultimate goal is to be able to do everything the library allows for. Please refer to the JExcelAPI documentation for more information on capabilities and limitations.
fr_fr: Seam support aussi la génération de feuilles de calculs &excel; au travers de l'excelente bibliothèqe <ulink url="http://jexcelapi.sourceforge.net/">JExcelAPI </ulink>. Le document généré est compatible avec &excel; versions 95, 97, 2000, XP et 2003. Actuellement un sous-groupe limité de fonctionnalité de la bibliothèque sont exploité mais le but ultime est d'être capable de proposer tout ce que la bibliothèque est capable de faire. Merci de vous référer à la documentation JExcelAPI pour plus d'informations sur les possibilités et les limitations.
it_it: Seam supporta inoltre la generazione di fogli elettronici &excel; tramite l'eccellente libreria <ulink url="http://jexcelapi.sourceforge.net/">JExcelAPI </ulink>. Il documento generato è compatibile con &excel; versione 95, 97, 2000, XP e 2003. Attualmente viene esposto un limitato set di funzionalità di questa libreria, ma lo scopo finale è riuscire a fare tutto ciò che la libreria consente. Si prega di fare riferimento alla documentazione di JExcelAPI per ulteriori informazioni, possibilità e limitazioni.

source: &Excel; support
fr_fr: Le support d'&Excel;
it_it: Supporto &Excel;

source: &Excel; <literal>jboss-seam-excel.jar</literal>. This JAR contains the &excel; JSF controls, which are used to construct views that can render the document, and the DocumentStore component, which serves the rendered document to the user. To include &excel; support in your application, include <literal>jboss-seam-excel.jar</literal> in your <literal>WEB-INF/lib</literal> directory along with the <literal>jxl.jar</literal> JAR file. Furthermore, you need to configure the DocumentStore servlet in your web.xml
fr_fr: &Excel; <literal>jboss-seam-excel.jar</literal>. Ce JAR contient les controles JSF pour &excel; qui sont utilisé pour construire les vues qui peuvent rendre le document et le composant DocumentStore, qui donne le document rendu à l'utilisateur. Pour inclure le support d'&excel; dans votre application, includez <literal>jboss-seam-excel.jar</literal> dans votre dossier <literal>WEB-INF/lib</literal> avec le fichier JAR <literal>jxl.jar</literal>.Cependant, vous allez devoir configurer le servlet DocumentStore dans votre web.xml
it_it: &Excel; <literal>jboss-seam-excel.jar</literal>. Questo JAR contiene i controlli &excel; JSF, che vengono impiegati per costruire le viste che possono generare il documento, ed il componente DocumentStore, che serve il documento generato all'utente. Per includere il supporto ad &excel; nella propria applicazione, si includa <literal>jboss-seam-excel.jar</literal> nella directory <literal>WEB-INF/lib</literal> assieme al file <literal>jxl.jar</literal>. Inoltre, occorre configurare il servlet DocumentStore in web.xml.

source: &Excel; Seam module requires the use of Facelets as the view technology. Additionally, it requires the use of the seam-ui package.
fr_fr: Le module de Seam &Excel; nécéssite l'utilisation des Facelets comme technologie des vues. De plus, il nécessite l'utilisation du package seam-ui.
it_it: Il modulo &Excel; di Seam richiede l'uso di Facelets come tecnologia per la vista. Inoltre richiede l'uso del pacchetto seam-ui.

source: The <literal>examples/excel</literal> project contains an example of &excel; support in action. It demonstrates proper deployment packaging, and it shows the exposed functionality.
fr_fr: Le projet <literal>examples/excel</literal> contient un exemple opérationnel du support d'&excel;. Il démontre un empaquetage de déploiement propre, et il montre les fonctionnalités disponibles.
it_it: Il progetto <literal>examples/excel</literal> contiene un esempio del supporto &excel; in azione. Mostra come eseguire il correttto impacchettamento per il deploy e mostra le funzionalità esposte.

source: Customizing the module to support other kinds of &excel; spreadsheet API's has been made very easy. Implement the <literal>ExcelWorkbook </literal> interface, and register in components.xml.
fr_fr: La personnalisation du module pour le support d'autres type d'API pour les feuilles de calcul d'&excel; ont été fabriquée de manière simple. Implémentez l'interface <literal>ExcelWorkbook </literal> et enregistrez le dans components.xml.
it_it: La personalizzazione del modulo per supportare altri tipi di API &excel; è diventata molto semplice. Si implementi l'interfaccia <literal>ExcelWorkbook</literal>, e si registri in components.xml.

source: and register the excel namespace in the components tag with
fr_fr: et enregistrez l'espace de nom d'excel avec la balise du composant.
it_it: e si registri il namespace excel nei tag dei componenti con

source: Then set the UIWorkbook type to <literal>myExcelExporter</literal> and your own exporter will be used. Default is "jxl", but support for CSV has also been added, using the type "csv".
fr_fr: Ensuite, définisez le type UIWorkbook à <literal>myExcelExporter</literal> et votre propre exportateur sera utilisé. par défaut c'est "jxl", mais le support de CSV a été aussi ajouté, en utilisant le type "csv".
it_it: Poi si imposti il tipo UIWorkbook per <literal>myExcelExporter</literal> e verrà usato il proprio esportatore. Di default è "jxl", ma è stato aggiunto anche il supporto per CSV, usando il tipo "csv".

source: See <xref linkend="itext.configuration"/> for information on how to configure the document servlet for serving the documents with an .xls extension.
fr_fr: Voir <xref linkend="itext.configuration"/> pour l'information de comment configurer le servlet de document pour distribuer le document avec une extension .xls.
it_it: Si veda <xref linkend="itext.configuration"/> per informazioni su come configurare il document servlet per servire i documenti con estensione .xls.

source: If you are having problems accessing the generated file under IE (especially with https), make sure you are not using too strict restrictions in the browser (see <ulink url="http://www.nwnetworks.com/iezones.htm"></ulink>), too strict security constraint in web.xml or a combination of both.
fr_fr: Si vous avez des problèmes pour accéder au fichier généré sous IE (particulièrement avec https), soyez sur de ne pas avoir de restricutions trop strictes dans le navigateur (voir <ulink url="http://www.nwnetworks.com/iezones.htm"></ulink>), les contraintes de sécurité trop stricte dans web.xml ou une combinaisons des deux.

source: Creating a simple workbook
fr_fr: La création d'une simple classeur de travail
it_it: Creazione di un semplice workbook

source: Basic usage of the worksheet support is simple; it is used like a familiar <literal>&lt;h:dataTable&gt;</literal> and you can bind to a <literal>List</literal>, <literal>Set</literal>, <literal>Map</literal>, <literal>Array</literal> or <literal>DataModel</literal>.
fr_fr: Lu'ilisation classique du support de feuille de calcul, utilise un classique <literal>&lt;h:dataTable&gt;</literal> et vous pouvez le lier avec un <literal>List</literal>, un <literal>Set</literal>, un <literal>Map</literal>, un <literal>Array</literal> ou un <literal>DataModel</literal>.
it_it: L'uso base del supporto ai fogli elettronici è molto semplice; viene usato come il familiare <literal>&lt;h:dataTable&gt;</literal> e si può associare una <literal>List</literal>, <literal>Set</literal>, <literal>Map</literal>, <literal>Array</literal> o <literal>DataModel</literal>.

source: That's not terribly useful, so lets have a look at a more common case:
fr_fr: Ce n'est pas très difficile, allons voir les clas les plus courants:
it_it: Non è molto utile, guardiamo quindi ai casi più comuni:

source: First we have the top-level workbook element which serves as the container and it doesn't have any attributes. The child-element worksheet has two attributes; value=&quot;#{data}&quot; is the EL-binding to the data and var=&quot;item&quot; is the name of the current item. Nested inside the worksheet is a single column and within it you see the cell which is the final bind to the data within the currently iterated item
fr_fr: En premier, nous allons avoir un élément de haut-niveau workbook qui sert de containeur et qui n'a pas d'attributs. L'élément fil worksheet a deux attributs; value=&quot;#{data}&quot; c'est la liaison EL avec la donnée et var=&quot;item&quot; est le nom de l'élément courant. Englobé dans le worksheet, il y a une seule colonne et à l'intérieur vous pouvez voir une cellule qui à la liaison finale avec la données avec l'élément itirré courrant
it_it: In primo luogo si ha a livello più alto un elemento workbook, che serve come container e non ha attributi. L'elemento figlio worksheet ha due attributi; value=&quot;#{data}&quot; è il binding EL ai dati e var=&quot;item&quot; è il nome dell'elemento corrente. Innestato dentro worksheet c'è una singola colonna e dentro essa si vede la cella, che è l'associazione finale ai dati dell'elemento iterato.

source: This is all you know to get started dumping your data to worksheets!
fr_fr: Cela vous permet de commencer à remplir de données vos feuilles de calculs!
it_it: Questo è ciò che serve sapere per cominciare a mettere dati nei fogli elettronici!

source: Workbooks
fr_fr: Les Workbooks

source: Workbooks are the top-level parents of worksheets and stylesheet links.
fr_fr: Les workboocks sont les parents de haut-niveaux des worksheets et des liens des feuilles de styles.
it_it: I workbook sono i padri di livello più alto dei worksheet e dei link ai fogli di stile.

source: Attributes
fr_fr: Les attributes
it_it: Attributi

source: <literal>type</literal> &#8212; Defines which export module to be used. The value is a string and can be either "jxl" or "csv". The default is "jxl".
fr_fr: <literal>type</literal> &#8212; Défini quel module d'exportation à utiliser. La valeur est une chaine de caractères et peut aussi bien être "jxl" ou "csv". Par défaut c'est "jxl".
it_it: <literal>type</literal> &#8212; Definisce quale module esporto usare. Il valore è una string e può essere o "jxl" o "csv". Il default è "jxl".

source: <literal>templateURI</literal> &#8212; A template that should be used as a basis for the workbook. The value is a string (URI).
fr_fr: <literal>templateURI</literal> &#8212; Un modèle qui peut être utilisé comme une base de classeurs. La valeur est une chaine de caractères (URI).
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>arrayGrowSize</literal> &#8212; The amount of memory by which to increase the amount of memory allocated to storing the workbook data. For processes reading many small workbooks inside a WAS it might be necessary to reduce the default size. Default value is 1 megabyte. The value is a number (bytes).
fr_fr: <literal>arrayGrowSize</literal> &#8212; La quantité de mémoire pour augmenter la quantité de mémoire allouée pour stoquer les données du classeur. Pour les processus ouvrant de petits classeurs dans un WAS itl peut être nécéssaire de réduire la taille par défaut. La valeur par défaut est de 1 mégaoctet. La valeur est un nombre (bytes).
it_it: <literal>arrayGrowSize</literal> &#8212; L'ammontare di memoria con cui incrementare la memoria allocata per la memorizzazione dei dati di workbook. Per processi che leggono molti workbook piccoli dentro un WAS, può essere necessario ridurre la dimensione di default. Il valore di default è 1 megabyte. Il valore è un numero (byte).

source: <literal>autoFilterDisabled</literal> &#8212; Should autofiltering be disabled?. The value is a boolean.
fr_fr: <literal>autoFilterDisabled</literal> &#8212; Le filtrage automatique est-il désactiver? La valeur est un booléen.
it_it: <literal>topMargin</literal> &#8212; Il margine superiore. Il valore è un numero (pollici).

source: <literal>cellValidationDisabled</literal> &#8212; Should cell validation be ignored? The value is a boolean.
fr_fr: <literal>cellValidationDisabled</literal> &#8212; La validation de la cellule devrait-elle être ignorée? La valeur est un booléen.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>characterSet</literal> &#8212; The character set. This is only used when the spreadsheet is read, and has no effect when the spreadsheet is written. The value is a string (character set encoding).
fr_fr: <literal>characterSet</literal> &#8212; L'encodage de caractère. Seulement utilisé quand la feuille de clacul est lue, et n'a pas d'effets quand le classeur est écrit. La valeur est une chaine de caractères (character set encoding).
it_it: <literal>characterSet</literal> &#8212; Il set di caratteri. Questo viene usato solo quando viene letto il foglio elettronico, e non ha alcun effetto quando viene scritto. Il valore è una stringa (codifica del set di caratteri).

source: <literal>drawingsDisabled</literal> &#8212; Should drawings be disabled? The value is a boolean.
fr_fr: <literal>drawingsDisabled</literal> &#8212; Le dessin devrait-il être désactivé ? La valeur est un booléen.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>excelDisplayLanguage</literal> &#8212; The language in which the generated file will display. The value is a string (two character ISO 3166 country code).
fr_fr: <literal>excelDisplayLanguage</literal> &#8212; Le langage dans lequel le fichier généré sera affiché. Cette valeur est une chaine de caractères (deux caractères du code du pays en ISO 3166 ).
it_it: <literal>excelDisplayLanguage</literal> &#8212; Il linguaggio in cui viene mostrato il file generato. Il valore è una stringa (codice a due caratteri ISO 3166 del paese).

source: <literal>excelRegionalSettings</literal> &#8212; The regional settings for the generated excel file. The value is a string (two character ISO 3166 country code).
fr_fr: <literal>excelRegionalSettings</literal> &#8212; Le réglage régionnal pour le fichier excel généré. La valeur est une chaine de caractères (deux caractères du code du pays en ISO 3166).
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>formulaAdjust</literal> &#8212; Should formulas be adjusted? The value is a boolean.
fr_fr: <literal>formulaAdjust</literal> &#8212; Les formules devrait-elles être ajustée? La valeur est un booléen.
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>gcDisabled</literal> &#8212; Should garbage collection be disabled? The value is a boolean.
fr_fr: <literal>gcDisabled</literal> &#8212; Le ramasse miètes devrait-il être désactivé? La valeur est un booléen.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>ignoreBlanks</literal> &#8212; Should blanks be ignored? The value is a boolean.
fr_fr: <literal>ignoreBlanks</literal> &#8212; Les espaces devrait-ils être ignorés? La valeur est un booléen
it_it: <literal>leftMargin</literal> &#8212; Il margine sinistro. Il valore è un numero (pollici).

source: <literal>initialFileSize</literal> &#8212; The initial amount of memory allocated to store the workbook data when reading a worksheet. For processes reading many small workbooks inside a WAS it might be necessary to reduce the default size. Default value is 5 megabytes. The value is a number (bytes).
fr_fr: <literal>initialFileSize</literal> &#8212; La quantité de mémoire initial allouée pour stoquer les données du classeur pendant la lecture du classeur. Pour des processus de lecture de plusieurs petits classuers dans un WAS il peut être nécéssaire de réduire la taille par défaut. La valeur par défaut est de 5 mega-octets. La valeur est un nombre (bytes).
it_it: <literal>initialFileSize</literal> &#8212; Ammontare iniziale di memoria allocata per memorizzare i dati del workbook quando viene letto un foglio elettronico. Per processi che leggono molti workbook piccoli dentro un WAS può essere necessario ridurre la dimensione di default. Il valore di default è 5 megabytes. Il valore è un numero (byte).

source: <literal>locale</literal> &#8212; The locale used by JExcelApi to generate the spreadsheet. Setting this value has no effect on the language or region of the generated excel file. The value is a string.
fr_fr: <literal>locale</literal> &#8212; La locale utilisé par JExcelApi pour générer le classeur. Le réglage de cette valeur n'a aucun effet sur la langue ou la régio du fichier excel généré. La valeur est une chaine de caractères.
it_it: <literal>locale</literal> &#8212; Il locale usato da JExcelApi per generare il foglio elettronico. Impostare questo valore non ha effetti sulla lingua o la regione del file excel generato. Il valore è una stringa.

source: <literal>mergedCellCheckingDisabled</literal> &#8212; Should merged cell checking be disabled? The value is a boolean.
fr_fr: <literal>mergedCellCheckingDisabled</literal> &#8212; La fussion de la validation de cellule doit-elle être désactivé? La valeur est un booléen.
it_it: <literal>mergedCellCheckingDisabled</literal> &#8212; Se il controllo della cella unita debba essere disabilitato. Il valore è un booleano.

source: <literal>namesDisabled</literal> &#8212; Should handling of names be disabled? The value is a boolean.
fr_fr: <literal>namesDisabled</literal> &#8212; La liaison des noms doit-elle être désactivé. la valeur est un booléen.
it_it: <literal>description</literal> &#8212; La descrizione del link. Il valore è una stringa.

source: <literal>propertySets</literal> &#8212; Should any property sets be enabled (such as macros) to be copied along with the workbook? Leaving this feature enabled will result in the JXL process using more memory. The value is a boolean.
fr_fr: <literal>propertySets</literal> &#8212; La définition de propriétés devrait elle être défini (comme les macros) pour être copiée avec dans le classuer ? En laisant cette fonctionné active entrainera le processus JXL à utiliser beaucoup plus de mémoire. La valeur est un booléen.
it_it: <literal>propertySets</literal> &#8212; I set di proprietà (come le macro) devono essere abilitati per essere copiati assieme al workbook? Lasciando abilitato questa caratteristica, il processo JXL userà più memoria. Il valore è un booleano.

source: <literal>rationalization</literal> &#8212; Should the cell formats be rationalized before writing out the sheet? The value is a boolean. Default is true.
fr_fr: <literal>rationalization</literal> &#8212; Le formatage des cellules devrait-il être rationnalisé avant l'écriture de la feuille ? La valeur est un booléen. Par défaut à true.
it_it: <literal>rationalization</literal> &#8212; I formati delle celle devono essere razionalizzati prima di scrivere il foglio? Il valore è un booleano. Il default è true.

source: <literal>supressWarnings</literal> &#8212; Should warnings be suppressed?. Due to the change in logging in version 2.4, this will now set the warning behaviour across the JVM (depending on the type of logger used). The value is a boolean.
fr_fr: <literal>supressWarnings</literal> &#8212; Les alertes devrait-elles être supprimée? Du aux modifications dans la journalisation des logs dans la version 2.4, il va maintenant définir cette fonctionnalité au travers de la JVM (selon le type d'outil de log utilisé). La valeur est un booléen.
it_it: <literal>supressWarnings</literal> &#8212; Gli avvisi devono essere soppressi? A causa di un cambiamento nella versione 2.4 del logging, ora il comportamento degli avvisi è impostato a livello di JVM (dipende dal tipo di logger usato). Il valore è un booleano.

source: <literal> temporaryFileDuringWriteDirectory </literal> &#8212; Used in conjunction with the <literal>useTemporaryFileDuringWrite</literal> setting to set the target directory for the temporary files. This value can be NULL, in which case the normal system default temporary directory is used instead. The value is a string (the directory to which temporary files should be written).
fr_fr: <literal> temporaryFileDuringWriteDirectory </literal> &#8212; Utilisé en conjonction avec le réglage <literal>useTemporaryFileDuringWrite</literal> pour définir le dossier cible pour les fichiers temporaires. Cette valeur peut être NULL, dans ce cas le dossier temporaire par défaut normal pour le système est utilisé en lieu et place. La valeur est une chaine (le dossier vers lequel les fichiers temporaires devraient être écrit).
it_it: <literal> temporaryFileDuringWriteDirectory </literal> &#8212; Usato in congiunzione con <literal>useTemporaryFileDuringWrite</literal> per impostare la directory target per i file temporanei. Il valore può essere NULL, nel qual caso viene usata la directory temporanea di default del sistema. Il valore è una stringa (la directory in cui scrivere i file temporanei).

source: <literal>useTemporaryFileDuringWrite</literal> &#8212; Should a temporary file is used during the generation of the workbook. If not set, the workbook will take place entirely in memory. Setting this flag involves an assessment of the trade-offs between memory usage and performance. The value is a boolean.
fr_fr: <literal>useTemporaryFileDuringWrite</literal> &#8212; Un fichier temporaire devrait être utilisé pendant la génération de ce classuer. Si non défini, le classeur sera placé dans la mémoire. La définition de ce drapeau entraine un choix dans la gestion entre l'utilisation de la mémoire et la performance. La valeur est un booléen.
it_it: <literal>useTemporaryFileDuringWrite</literal> &#8212; Se un file temporaneo debba essere usato durante la generazione del workbook. Se non impostato, il workbook avverrà interamente in memoria. Impostando questo flag si valuti il trade-off tra l'uso della memoria e la performance. Il valore è un booleano.

source: <literal>workbookProtected</literal> &#8212; Should the workbook be protected? The value is a boolean.
fr_fr: <literal>workbookProtected</literal> &#8212; Le classeur devrait-il être protégé? La valeur est un booléen.
it_it: <literal>bottomMargin</literal> &#8212; Il margine inferiore. Il valore è un numero (pollici).

source: <literal>filename</literal> &#8212; The filename to use for the download. The value is a string. Please note that if you map the DocumentServlet to some pattern, this file extension must also match.
fr_fr: <literal>filename</literal> &#8212; Le nom de fichier utilisé pendant le téléchargement. La valeur est une chaine de caractère. Merci de noez que si vous lié le DocumentServlet à un patron, l'extension du fichier doit aussi correspondre.
it_it: <literal>filename</literal> &#8212; Il nome del file da usare per il download. Il valore è una stringa. Si noti che se si mappa il DocumentServlet su qualche pattern, questa estensione del file deve corrispondere.

source: <literal>exportKey</literal> &#8212; A key under which to store the resulting data in a DocumentData object under the event scope. If used, there is no redirection.
fr_fr: <literal>exportKey</literal> &#8212; Une clef qui stocke les données résultats dans un objet DocumentData dans l'étendue évènement. Si utilisé, il n'y a pas de redirection.
it_it: <literal>exportKey</literal> &#8212; Una chiave sotto cui memorizzare i dati di risultato in un oggetto DocumentData nello scope evento. Se usato, non c'è redirezione.

source: Child elements
fr_fr: Les élements enfants
it_it: Elementi figli
