Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Excel.po
Languages: fr_fr, it_it

source: If you use the forum or mailing list, please remember that they don't know anything about Seam and the usage of their library, any issues are best reported in the JBoss Seam JIRA under the "excel" module.
fr_fr: Si vous utiliser le forum ou les listes de diffusions, merci de vous rappelez qu'ils ne connaissent rien à propos de Seam et de l'utilisation de ses bibliothèques, tout problèmes doivent être indiqués dans le JBoss Seam JIRA dans le module "excel".
it_it: Se si usano il forum o la mailing list, si prega di ricordare che non questi non possono fornire informazioni su come Seam impiega la loro libreria, ogni problema dovrebbe essere riportato in JBoss Seam JIRA sotto il modulo "excel".

source: If you are having problems accessing the generated file under IE (especially with https), make sure you are not using too strict restrictions in the browser (see <ulink url="http://www.nwnetworks.com/iezones.htm/"></ulink>), too strict security constraint in web.xml or a combination of both.
it_it: Se si incontrano problemi nell'accedere al file generato con IE (specialmente con https), ci si assicuri di non avere messo restrizioni nel browser (si veda <ulink url="http://www.nwnetworks.com/iezones.htm/"></ulink>), restrizioni di sicurezza in web.xml oppure una combinazione delle due.

source: When encountering a format mask, first it is checked if it is in internal form, e.g "format1", "format2" and so on (see <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/write/DecimalFormats.html"> jxl.write.DecimalFormats </ulink> ).
it_it: Incontrando una maschera di formato, in primo luogo è contrassegnata se è in una form interna, es. "format1", "format2" e così via (si veda <ulink url="http://jexcelapi.sourceforge.net/resources/javadocs/current/docs/jxl/write/DecimalFormats.html"> jxl.write.DecimalFormats </ulink> ).

source: #date#
it_it: <![CDATA[ <e:workbook> <e:worksheet> <e:hyperLink startRow="0" startColumn="0" endRow="4" endColumn="4" URL="http://seamframework.org" description="The Seam Framework"/> </e:worksheet> </e:workbook> ]]>

source: Example style="xls-font: red bold italic 22 Verdana"
it_it: Esempio style="xls-font: red bold italic 22 Verdana"
