Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Glassfish.po
Languages: fr_fr, it_it, ja_jp

source: Alter the <literal>jta-data-source</literal> to be <literal>jdbc/__default</literal>. We are going to be using the integrated GlassFish Derby DB.
fr_fr: Modifiez le <literal>jta-data-source</literal> pour le mettre à <literal>jdbc/__default</literal>. Nous allons utiliser Derby DB intégré dans GlassFish.
it_it: Alterare il <literal>jta-data-source</literal> in modo che sia <literal>jdbc/__default</literal>. Useremo il database Derby integrato in GlassFish.
ja_jp: <literal>jta-data-source</literal> を <literal>jdbc/__default</literal> に修正してください。組み込みの GlassFish Derby DB を使用します。

source: Replace all of the properties with the following. The key differences are briefly described in <xref linkend="glassfish_jpa_diff"/>:
fr_fr: Modifiez les propriétés avec les suivantes. Les différences clefs sont brièvements décrites dans <xref linkend="glassfish_jpa_diff"/>:
it_it: Sostituire tutte le proprietà con con quello che segue. Le differenze chiave sono descritte brevemente in <xref linkend="glassfish_jpa_diff"/>:

source: You'll need to alter <literal>persistence-prod.xml</literal> as well if you want to deploy to GlassFish using the prod profile.
fr_fr: Nous allons avoir besoin de modifier <literal>persistence-prod.xml</literal> aussi si vous voulez deployer dans GlassFish en utilisant le profile de prod.
it_it: Sarà necessario alterare anche <literal>persistence-prod.xml</literal> se si vuole mettere in esecuzione in GlassFish usando il profilo prod.
ja_jp: prod プロファイルを使用して GlassFish にデプロイしたければ、<literal>persistence-prod.xml</literal> も同様に修正する必要があります。

source: As with other examples we need to include this class for DB support. It can be copied from the <literal>jpa</literal> example into the <literal>seamgen_example/resources</literal> directory.
fr_fr: Tout comme les autres exemples, nous allons avoir besoin d'inclure cette classe pour le support de la BD. Il peut être copie depuis l'exemple <literal>jpa</literal> dans le dossier <literal>seamgen_example/resources</literal>.
it_it: Come per altri esempi è necessario includere questa classe per il supporto del database. Può essere copiata dall'esempio <literal>jpa</literal> nella cartella <literal>seamgen_example/resources</literal>.
ja_jp: 他のサンプルと同様に、データベースサポートのためのこのクラスを含める必要があります。<literal>jpa</literal> サンプルから <literal>seamgen_example/resources</literal> ディレクトリへコピーしてください。

source: You can delete this file as we aren't deploying to JBoss AS (<literal>jboss-app.xml</literal> is used to enable classloading isolation in JBoss AS)
fr_fr: Vous pouvez effacer ce fichier car nous n'allons pas déployer vers JBoss AS (<literal>jboss-app.xml</literal>est utilisé pour activer l'isolation du chargement des classes dans JBoss AS)
it_it: E' possibile cancellare questo file dato che non si sta mettendo in esecuzione su JBoss AS (<literal>jboss-app.xml</literal> è usato per abilitare l'isolamento del classloader in JBoss AS)
ja_jp: JBoss AS にはデプロイしないのでこのファイルを削除できます (JBoss AS では <literal>jboss-app.xml</literal> を使用して、クラスローディングの分離を有効にします)

source: You can delete these file as we aren't deploying to JBoss AS (these files define data sources in JBoss AS, we are using GlassFish's default data source)
fr_fr: Vous pouvez effacer ces fichiers nous n'allons pas déployer vers JBoss AS (ces fichiers définissent des sources de données dans JBoss AS, nous allons utiliser la source de données par défaut de GlassFish)
it_it: E' possibile cancellare questi file dato che non si sta mettendo in esecuzione in JBoss AS (questi file definiscono le data source in JBoss AS, mentre qui stiamo usando la data source di default di GlassFish)
ja_jp: JBoss AS にはデプロイしないのでこのファイルを削除できます (これらのファイルは、JBoss AS ではデータソースを定義していますが、GlassFish ではデフォルトのデータソースを使用しています)

source: Enable container managed transaction integration - add the <literal><![CDATA[<transaction:ejb-transaction/>]]></literal> component, and it's namespace declaration <literal>xmlns:transaction="http://jboss.com/products/seam/transaction"</literal>
fr_fr: Active l'intégration des transactions du containeur géré - ajoutez le composant <literal><![CDATA[<transaction:ejb-transaction/>]]></literal> et sa déclaration d'espace de nom <literal>xmlns:transaction="http://jboss.com/products/seam/transaction"</literal>
it_it: Abilitare l'integrazione con le transazioni gestite dal container - aggiungere il componente <literal><![CDATA[<transaction:ejb-transaction/>]]></literal> e la sua dichiarazione di namespace <literal>xmlns:transaction="http://jboss.com/products/seam/transaction"</literal>
ja_jp: コンテナ管理トランザクション統合を有効にします - <literal><![CDATA[<transaction:ejb-transaction/>]]></literal> コンポーネントと、その名前空間宣言 <literal>xmlns:transaction="http://jboss.com/products/seam/transaction"</literal> を追記してください

source: Alter the <literal>jndi-pattern</literal> to <literal>java:comp/env/seamgen_example/#{ejbName}</literal>
fr_fr: Modifiez le <literal>jndi-pattern</literal> à <literal>java:comp/env/seamgen_example/#{ejbName}</literal>
it_it: Modificare il <literal>jndi-pattern</literal> in <literal>java:comp/env/seamgen_example/#{ejbName}</literal>

source: As with the <literal>jee5/booking</literal> example, we need to add EJB references to web.xml. Technically, the reference type is not required, but we add it here for good measure. Note that these references require the presence of an empty <literal>local-home</literal> element to retain compatibility with a JBoss AS 4.x deployment.
fr_fr: Avez l'exemple <literal>jee5/booking</literal>, nous allons avoir besoin d'ajouter les références EJB references à web.xml. Techniquement, le type de référence n'est pas requi, mais nous l'ajoutons ici pour faire bonne figure. Notez que ces références nécéssitent la présence d'un élément vide <literal>local-home</literal> pour conserver la compatibilité avec un déploiement JBoss AS 4.x.
it_it: Come per l'esempio <literal>jee5/booking</literal>, occorre aggiungere un riferimento EJB a web.xml. Tecnicamente il tipo di riferimento non è necessario, ma lo aggiungiamo qui come buona pratica. Notare che questi riferimenti richiedono la presenza di un elemento <literal>local-home</literal> vuoto per mantenere la compatibilità con l'esecuzione in JBoss 4.x.

source: Keep in mind that if you are deploying to JBoss AS 4.x, and have defined the EJB references shown above in your web.xml, you will need to also define local JNDI names for each of them in jboss-web.xml, as shown below. This step is not required when deploying to GlassFish, but it's mentioned here in case you are also deploying the application to JBoss AS 4.x (not required for JBoss AS 5).
fr_fr: Gardez à l'esprit que si vous déployer dans JBoss AS 4.x, et que vous avez défini les références EJB comme montrées ci-dessus dans votre web.xml, vous allez avoir aussi besoin de définir les noms JNDI locaux de chacun d'entre eux dans jboss-web.xml, comme montré ci-dessous. Cette étape n'est pas nécéssaire avec le déploiement dans GlassFish, mais elle est mentionnée ici dans le cas où vous voudriez aussi déployer lapplication dans JBoss AS 4.x (pas nécéssaire pour JBoss AS 5).
it_it: Tenere presente che se si esegue in JBoss AS 4.x e si sono definiti i riferimenti EJB mostrati sopra nel web.xml, sarà necessario anche definire i nome JNDI locali in jboss-web.xml per ciascuno di essi, come mostrato sotto. Questo passo non è richiesto quando si esegue in GlassFish, ma viene riportato qui nel caso si esegua anche in JBoss AS 4.x (non è richiesto invece per JBoss AS 5).

source: Creating the <literal>AuthenticatorAction</literal> EJB
fr_fr: La création de l'EJB <literal>AuthenticatorAction</literal>
it_it: Creazione dell'EJB <literal>AuthenticatorAction</literal>
ja_jp: <literal>AuthenticatorAction</literal> EJB の作成

source: We want to take the existing <literal>Authenticator</literal> Seam POJO component and create an EJB3 out of it.
fr_fr: Nous voulons prendre le composant POJO de Seam existant <literal>Authenticator</literal> et créer un EJB à l'extérieur de lui.
it_it: Vogliamo prendere il componente Seam POJO <literal>Authenticator</literal> e creare da questo un EJB3.
ja_jp: 既存の <literal>Authenticator</literal> Seam POJO コンポーネントを利用して、EJB3 を作成します。

source: Rename the class to <literal>AuthenticatorAction</literal>
fr_fr: Renommer la classe en <literal>AuthenticatorAction</literal>
it_it: Rinominare la classe in <literal>AuthenticatorAction</literal>
ja_jp: クラス名を <literal>AuthenticatorAction</literal> に変更します。

source: Add the <literal>@Stateless</literal> annotation to the new <literal>AuthenticatorAction</literal> class.
fr_fr: Ajoutez l'annotation <literal>@Stateless</literal> à la nouvelle classe <literal>AuthenticatorAction</literal>.
it_it: Aggiungere l'annotazione <literal>@Stateless</literal> alla nuova classe <literal>AuthenticatorAction</literal>.
ja_jp: <literal>@Stateless</literal> アノテーションを新しい <literal>AuthenticatorAction</literal> クラスに付与します。

source: Create an interface called <literal>Authenticator</literal> which <literal>AuthenticatorAction</literal> implements (EJB3 requires session beans to have a local interface). Annotate the interface with <literal>@Local</literal>, and add a single method with same signature as the <literal>authenticate</literal> in <literal>AuthenticatorAction</literal>.
fr_fr: Créer un interface appelé <literal>Authenticator</literal> qui implémente <literal>AuthenticatorAction</literal> (EJB3 nécéssite pour les beans de session d'avoir un interface local). Annotez l'interface avec <literal>@Local</literal>, et ajoutez une seule méthode avec la même signature que <literal>authenticate</literal> dans <literal>AuthenticatorAction</literal>.
it_it: Creare un'interfaccia chiamata <literal>Authenticator</literal> che <literal>AuthenticatorAction</literal> implementa (EJB3 richiede che i session bean abbiano una interfaccia local). Annotare l'interfaccia con <literal>@Local</literal> e aggiungere un singolo metodo uguale al metodo <literal>authenticate</literal> in <literal>AuthenticateAction</literal>.
ja_jp: <literal>AuthenticatorAction</literal> が実装する <literal>Authenticator</literal> という名前のインタフェースを作成してください (EJB3 ではセッション Bean にローカルインタフェースが必要)。インタフェースに <literal>@Local</literal> アノテーションを付与し、<literal>AuthenticatorAction</literal> の <literal>authenticate</literal> と同じシグニチャのメソッドを一つ追加してください。

source: We've already added its reference to the <literal>web.xml</literal> file so we are good to go.
fr_fr: Vous avons déjà ajouté sa référence au fichier <literal>web.xml</literal> donc nous pouvons continuer.
it_it: Abbiamo già aggiunto il suo riferimento nel file <literal>web.xml</literal> quindi siamo pronti per partire.
ja_jp: すでに <literal>web.xml</literal> ファイルには EJB 参照を追加したので、次に進めます。

source: Extra jar dependencies and other changes to the <literal>build.xml</literal>
fr_fr: Les dépendances jar additionnelles et les autres modification au <literal>build.xml</literal>
it_it: Ulteriori dipendenze di jar e altri cambiamenti al <literal>build.xml</literal>.
ja_jp: <literal>build.xml</literal> への jar 依存関係の追加とその他の変更点

source: This application has similar requirements as the <literal>jee5/booking</literal> example.
fr_fr: Cette application a des besoins similaires à l'exemple <literal>jee5/booking</literal>.
it_it: Questa applicazione ha dei requisiti simili a quelli dell'esempio <literal>jee5/booking</literal>.
ja_jp: このアプリケーションは、<literal>jee5/booking</literal> サンプルと同様の変更が必要となります。

source: Change the default target to <literal>archive</literal> (we aren't going to cover automatic deployment to GlassFish).
fr_fr: Modifiez la cible par défaut à <literal>archive</literal> (nous n'allons pas couvrir le déploiement automatique vers GlassFish).
it_it: Modificare il target di default in <literal>archive</literal> (non tratteremo la messa in esecuzione automatica in GlassFish).
ja_jp: デフォルトのターゲットを <literal>archive</literal> に変更します (GlassFish への自動的なデプロイを行いません)。

source: We need to get the <literal>GlassfishDerbyDialect.class</literal> into our application jar. To do that find the <literal>jar</literal> task and add the <literal>GlassfishDerbyDialect.class</literal> line as shown below:
fr_fr: Nous alllons avoir besoin de <literal>GlassfishDerbyDialect.class</literal> dans notre jar d'application. Pour faire cela, trouvez la tâche <literal>jar</literal> et ajoutez la ligne <literal>GlassfishDerbyDialect.class</literal> comme montré ci-dessous:
it_it: Occorre avere <literal>GlassfishDerbyDialect.class</literal> nella nostra applicazione. Per fare questo trovare il task <literal>jar</literal> e aggiungere la riga con <literal>GlassFishDerbyDialect.class</literal> come mostrato qui sotto:

source: Now we need to get extra jars into the <literal>ear</literal> file. Look for the <literal><![CDATA[<copy todir="${ear.dir}/lib">]]></literal> section of the <literal>ear</literal> target. Add the following to the child <literal><![CDATA[<fileset dir="${lib.dir}">]]></literal> element.
fr_fr: Maintenant nous allons avoir besoin d'ajouter les jars additionnel dans le fichier <literal>ear</literal>. Regarez dans la section <literal><![CDATA[<copy todir="${ear.dir}/lib">]]></literal> de la cible <literal>ear</literal>. Ajoutez ce qui suit à l'enfant de l'élément <literal><![CDATA[<fileset dir="${lib.dir}">]]></literal>.
it_it: A questo punto occorre mettere i jar supplementari nel file <literal>ear</literal>. Individuare la sezione <literal><![CDATA[<copy todir="${ear.dir}/lib">]]></literal> del target <literal>ear</literal>. Aggiungere il seguente brano all'elemento contenuto <literal><![CDATA[<fileset dir="${lib.dir}">]]></literal>.

source: Add Hibernate dependencies
fr_fr: Ajoutez les dépendances Hibernate
it_it: Aggiungere le dipendenze Hibernate
ja_jp: Hibernate 依存関係を追加してください。

source: Add third party dependencies.
fr_fr: Ajoutez les dépendances des tierces parties.
it_it: Aggiungere dipendenze di terze parti
ja_jp: サードパーティ依存関係を追加してください。

source: You should end up with something like:
fr_fr: Vous pourrions finir avec quelquechose comme:
it_it: Alla fine dovrebbe diventare qualcosa di questo genere:
ja_jp: 最後には以下のようになります。

source: Building and deploying the seam-gen'd application to GlassFish
fr_fr: Compilez et déployez l'application en seam-gen vers GlassFish
it_it: Compilare ed eseguire l'applicazione fatta con seam-gen in GlassFish
ja_jp: seam-gen 生成アプリケーションのビルドと GlassFish へのデプロイ

source: Build your application by calling <literal>ant</literal> in the base directory of your project (for example <literal>/projects/seamgen-example</literal>). The target of the build will be <literal>dist/seamgen-example.ear</literal>.
fr_fr: Compilez votre application en appelant <literal>ant</literal> dans le dossier de base de votre projet (par exemple <literal>/projects/seamgen-example</literal>). La cible de cette compilation sera <literal>dist/seamgen-example.ear</literal>.
it_it: Compilare l'applicazione chiamando <literal>ant</literal> nella cartella principale del progetto (ad esempio <literal>/projects/seamgen-example</literal>). Il risultato della compilazione sarà <literal>dist/seamgen-example.ear</literal>.
ja_jp: プロジェクトのベースディレクトリ(例えば <literal>/projects/seamgen-example</literal>)で <literal>ant</literal> を実行してアプリケーションをビルドしてください。ビルドされるターゲットファイルは <literal>dist/seamgen-example.ear</literal> です。

source: To deploy the application follow the instructions here <xref linkend="jee5-glassfish-deploy"/> but use references to this project <literal>seamgen-example</literal> instead of <literal>jboss-seam-jee5</literal>.
fr_fr: Pour déployer l'application suivre les instructions ici <xref linkend="jee5-glassfish-deploy"/> mais utiliser les références pour ce projet <literal>seamgen-example</literal> au lieu de <literal>jboss-seam-jee5</literal>.
it_it: Per eseguire l'applicazione seguire le istruzioni indicate qui <xref linkend="jee5-glassfish-deploy"/> ma usare i riferimenti a questo progetto <literal>seamgen-example</literal> anziché <literal>jboss-seam-jee5</literal>.
ja_jp: アプリケーションをデプロイするには、 <xref linkend="jee5-glassfish-deploy"/> の手順に従ってください 。但し、<literal>jboss-seam-jee5</literal> の代わりにこのプロジェクト <literal>seamgen-example</literal> へ置き換えて使用してください。

source: Checkout the app at <literal>http://localhost:8081/seamgen_example/</literal>
fr_fr: Vérifiez l'application sur <literal>http://localhost:8081/seamgen_example/</literal>
it_it: Controllare l'applicazione all'indirizzo <literal>http://localhost:8081/seamgen_example/</literal>
ja_jp: <literal>http://localhost:8081/seamgen_example/</literal> をブラウズしてアプリケーションを確認してください。
