Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Glassfish.po
Languages: fr_fr, it_it, ja_jp

source: Seam on GlassFish application server
fr_fr: Seam avec le serveur d'application GlassFish
it_it: Seam sull'application server GlassFish
ja_jp: GlassFish アプリケーションサーバー上の Seam

source: GlassFish is an open source application server which fully implements Java EE 5. The latest stable release is v2 UR2.
fr_fr: GlassFish est un serveur d'application open source qui implément complètement Java EE 5. La dernière version stable est v2 UR2.
it_it: GlassFish è un application server open source che implementa in maniera completa le specifiche Java EE 5. L'ultima versione stabile rilasciata è la v2 UR2.
ja_jp: GlassFish は、Java EE 5 を完全に実装したオープンソースのアプリケーションサーバーです。最新の安定リリースは v2 UR2 です。

source: First, we'll discuss the GlassFish environment. Then we will go over the how you deploy the jee5 example. Next, we will deploy the JPA example application. Finally we show how to get a seam-gen's generated application running on GlassFish.
fr_fr: En premier, nous allons parler de l'environement FlassFish. Ensuite nous allons passer sur comment vous allez déployer l'exemple JEE5. Enfin, nous allons déployer l'application d'exemple JPA. Au final, nous allons vor comment obtenir une application générée par seam-gen pour une exécution sur GlassFish.
it_it: Anzitutto vedremo l'ambiente GlassFish. Quindi proseguiremo su come eseguire l'esempio JEE5. Poi eseguiremo l'aplicazione di esempio JPA. Infine mostreremo come si può ottenere un'applicazione generata con seam-gen che funzioni su GlassFish.
ja_jp: まず最初に GlassFish 環境について述べて、どのように jee5 サンプルをデプロイするのかを詳しく説明します。次に、jpa サンプルアプリケーションをデプロイします。最後に、seam-gen により生成されたアプリケーションをどのようにして GlassFish 上で動作させるのかを示します。

source: GlassFish environment and deployment information
fr_fr: L'environement GlassFish et les informations de déploiement
it_it: L'ambiente e l'esecuzione di applicazioni su GlassFish
ja_jp: GlassFish 環境とデプロイメント情報

source: Installation
it_it: Installazione
ja_jp: インストール

source: All of the examples and information in this chapter are based on the the latest version of GlassFish at the time of this writing.
fr_fr: Tous les exemples et les informations de ce chapitre sont basés sur la dernière version de GlassFish au moment de son écriture.
it_it: Tutte le informazioni e gli esempi in questo capitolo sono basati sull'ultima versione di GlassFish al momento in cui è stato scritto.
ja_jp: この章のサンプルと情報は、すべて執筆時の GlassFish の最新バージョンに基づいています。

source: GlassFish v2 UR2 - download page
fr_fr: GlassFish v2 UR2 - page de téléchagement
it_it: GlassFish v2 UR2 - pagina di download
ja_jp: GlassFish v2 UR2 - ダウンロードページ

source: After downloading GlassFish, install it:
fr_fr: Après le téléchargement de GlassFish, installez le:
it_it: Dopo aver scaricato GlassFish occorre installarlo:
ja_jp: GlassFish をダウンロードして、インストールしてください。

source: After installing, setup GlassFish:
fr_fr: Après l'installation, configurez GlassFish:
it_it: Dopo averlo installato, occorre configurarlo:
ja_jp: インストールした後に、GlassFish をセットアップしてください。

source: The created domain's name is <literal>domain1</literal>.
fr_fr: Le nom de domaine créé est <literal>domain1</literal>.
it_it: Il nome del dominio creato è <literal>domain1</literal>.
ja_jp: 作成されたドメインの名前は<literal>domain1</literal> です。

source: Next, we start the embedded JavaDB server:
fr_fr: Ensuite, nous démarrons le serveur JavaDB embarqué:
it_it: Ora facciamo partire il server JavaDB interno:
ja_jp: 次に、組み込み JavaDB サーバを起動します。

source: JavaDB is an embedded database that is included with GlassFish, just as HSQLDB is included in JBoss AS.
fr_fr: JavaDB est une base de données embarqué qui est inclue dans dans GlassFish, tout comme HSQLDB est inclue dans JBoss AS.
it_it: JavaDB è un database interno che è incluso in GlassFish, così come HSQLDB è incluso in JBoss AS.
ja_jp: JavaDB は、HSQLDB が JBoss AS に含まれているのと同様に、GlassFish の組み込みデータベースです。

source: Now, start the GlassFish server:
fr_fr: Maintenant, démarrez le serveur GlassFish:
it_it: Ora facciamo partire il server GlassFish:
ja_jp: 最後に、GlassFish サーバを起動してください。

source: The web administration console is available at <literal>http://localhost:4848/</literal>. You can access the web admin console with the default username (<literal>admin</literal>) and password (<literal>adminadmin</literal>). We will be using the the admin console to deploy our examples. You can also copy EAR/WAR files to the <literal>glassfish/domains/domain1/autodeploy</literal> directory to deploy them, although we are not going to cover that.
fr_fr: La console web d'administration est disponible à l'adresse <literal>http://localhost:4848/</literal>. Vous pouvez accéder à la console web d'administration avec le nom d'utilisateur par défaut (<literal>admin</literal>) et le mot de passe (<literal>adminadmin</literal>). Nous allons utiliser la console d'administration pour déployer nos exemples. Vous pouvez aussi copier les fichiers EAR/WAR dans le dossier <literal>glassfish/domains/domain1/autodeploy</literal> pour les déployer, mais nous n'allons pas parler de cela.
it_it: La console di amministrazione web è disponibile all'indirizzo <literal>http://localhost:4848/</literal>. E' possibile accedere alla console di amministrazione web con il nome utente e la password di default (<literal>admin</literal> e <literal>adminadmin</literal> rispettivamente). Useremo la console di amministrazione per mettere in esecuzione i nostri esempi. E' anche possibile copiare i file EAR/WAR nella cartella <literal>glassfish/domains/domain1/autodeploy</literal> per metterli in esecuzione, ma non ci occuperemo di questo.

source: You can stop the server and database using:
fr_fr: Vous pouvez arrêter le serveur et la base de données en utilisant:
it_it: E' possibile fermare il server e il database usando:
ja_jp: サーバとデータベースを停止するには、以下のようにしてください。

source: The <literal>jee5/booking</literal> example
fr_fr: L'exemple <literal>jee5/booking</literal>
it_it: L'esempio <literal>jee5/booking</literal>
ja_jp: <literal>jee5/booking</literal> サンプル

source: The <literal>jee5/booking</literal> example is based on the Hotel Booking example (which runs on JBoss AS). Out of the box it is also designed to run on GlassFish. It is located in <literal>$SEAM_DIST/examples/jee5/booking</literal>.
fr_fr: L'exemple <literal>jee5/booking</literal> est basé sur l'exemple de réservation d'hotel (qui s'exécute sur JBoss AS). Par défaut, il est aussi prévu de fonctionner sur GlassFish. Il ets localisé dans <literal>$SEAM_DIST/examples/jee5/booking</literal>.
it_it: L'esempio <literal>jee5/booking</literal> è basato sull'esempio Hotel Booking (che gira su JBoss AS). Così com'è, è fatto per girare su GlassFish. Si trova in <literal>$SEAM_DIST/examples/jee5/booking</literal>.
ja_jp: <literal>jee5/booking</literal> サンプルは、(JBoss AS 上で動作する) ホテル予約サンプルに基づいています。そのままで GlassFish 上で動作するように設計されています。このサンプルは <literal>$SEAM_DIST/examples/jee5/booking</literal> にあります。

source: Building the <literal>jee5/booking</literal> example
fr_fr: Compilation de l'exemple <literal>jee5/booking</literal>
it_it: Compilare l'esempio <literal>jee5/booking</literal>

source: To build the example, simply execute the default <literal>ant</literal> target:
fr_fr: Pour construire l'exemple, exécuter simplement la cible par défaut <literal>ant</literal>:
it_it: Per compilare l'esempio, eseguire semplicemente il target <literal>ant</literal> di default:

source: in the <literal>examples/jee5/booking</literal> directory. This will create the <literal>dist</literal> and <literal>exploded-archives</literal> directories.
fr_fr: dans le dossier <literal>examples/jee5/booking</literal>. Ceci va créer les dossiers <literal>dist</literal> et <literal>exploded-archives</literal>.
it_it: nella cartella <literal>examples/jee5/booking</literal>. Questo creerà le cartelle <literal>dist</literal> e <literal>exploded-archives</literal>.

source: Deploying the application to GlassFish
fr_fr: Le déploiement de l'application dans GlassFish
it_it: Mettere in esecuzione l'applicazione su GlassFish
ja_jp: GlassFish へのアプリケーションのデプロイ

source: We will deploy the application on GlassFish using the GlassFish admin console.
fr_fr: Nous allons déployer l'application dans GlassFish en utilisant la console d'administration de GlassFish.
it_it: Metteremo in esecuzione l'applicazione su GlassFish usando la console di amministrazione GlassFish.
ja_jp: GlassFish 管理コンソールを利用して GlassFish にアプリケーションをデプロイします。

source: Log in to the admin console at <literal>http://localhost:4848</literal>
fr_fr: Connectez vous sur la console d'administration à l'adresse <literal>http://localhost:4848</literal>
it_it: Accedere alla console di amministrazione all'indirizzo <literal>http://localhost:4848</literal>
ja_jp: <literal>http://localhost:4848</literal> から管理コンソールにログインします。

source: Access the <literal>Enterprise Applications</literal> in the menu option under the <literal>Applications</literal> left side menu.
fr_fr: Accédez à <literal>Enterprise Applications</literal> dans le menu option sous <literal>Applications</literal> dans le menu à gauche.
it_it: Accedere all'opzione di menu <literal>Enterprise Applications</literal> sotto il menu <literal>Applications</literal> che si trova a sinistra.
ja_jp: 左側のサイドメニュー <literal>Applications (アプリケーション)</literal> の下にあるメニューオプションで <literal>Enterprise Applications (エンタープライズアプリケーション)</literal> にアクセスしてください。

source: At the top of the <literal>Enterprise Application</literal> table select <literal>Deploy</literal>. Follow through the wizard, using these hints:
fr_fr: En haut, le tableau <literal>Enterprise Application</literal> sélectionnez <literal>Deploy</literal>. Suivez l'assistant, en utilisant ces indications:
it_it: In cima alla tabella delle <literal>Enterprise Applications</literal> selezionare <literal>Deploy</literal>. Seguire la procedura guidata usando questi suggerimenti:
ja_jp: <literal>Enterprise Application (エンタープライズアプリケーション)</literal> テーブルのトップで <literal>Deploy (配備)</literal> を選択してください。以下のヒントを使って、ウィザードを最後まで進めてください。

source: Preparing for the application installation
fr_fr: La préparation de l'installation de l'application
it_it: Preparazione dell'installazione dell'applicazione
ja_jp: アプリケーションのインストール準備

source: Browse to <literal>examples/jee5/booking/dist/jboss-seam-jee5.ear</literal>.
fr_fr: Navigers vers <literal>examples/jee5/booking/dist/jboss-seam-jee5.ear</literal>.
it_it: Navigare su <literal>examples/jee5/booking/dist/jboss-seam-jee5.ear</literal>.
ja_jp: ブラウザで <literal>examples/jee5/booking/dist/jboss-seam-jee5.ear</literal> を指定してください。

source: Select the <literal>OK</literal> button.
fr_fr: Sélectionnez le bouton <literal>OK</literal>.
it_it: Selezionare il pulsante <literal>OK</literal>.
ja_jp: <literal>OK</literal> ボタンを選択してください。

source: You can now access the application at <literal>http://localhost:8081/seam-jee5/</literal>.
fr_fr: Vous pouvez maintenant accéder à l'application sur <literal>http://localhost:8081/seam-jee5/</literal>.
it_it: Ora è possibile accedere all'applicazione all'indirizzo <literal>http://localhost:8081/seam-jee5/</literal>.
ja_jp: <literal>http://localhost:8081/seam-jee5/</literal> からアプリケーションにアクセスできます。

source: The <literal>jpa</literal> booking example
fr_fr: L'exemple de réservation <literal>jpa</literal>
it_it: L'esempio booking <literal>jpa</literal>
ja_jp: <literal>jpa</literal> booking サンプル

source: This is the Hotel Booking example implemented in Seam POJOs and using Hibernate JPA with JPA transactions. It does not require EJB3 support to run on application server.
fr_fr: Ceci est l'exemple de la réservation d'hotel en implémenté en POJOs de Seam et utilisant les transactions JPA avec d'Hibernate JPA. Il ne nécéssite par le support de EJB3 pour s'exécuter sur le serveur d'application.
it_it: Si tratta dell'esempio Hotel Booking implementato con componente Seam POJO e usando Hibernate JPA con transazioni JPA. Non richiede che il supporto EJB3 sia in funzione sull'application server.
ja_jp: これは、Hibernate JPA と JPA トランザクションを利用して Seam POJO で実装されたホテル予約サンプルです。アプリケーションサーバで動作させるのに、EJB3 サポートを必要としません。

source: The example already has a break-out of configurations and build scripts for many of the common containers including GlassFish.
fr_fr: Cet exemple à déjà à disposition les configurations et les scripts de compilation pour la plus part des containeurs y compris GlassFish.
it_it: L'esempio ha numerose configurazioni e script per compilare per molti dei più comuni application server, incluso GlassFish.
ja_jp: サンプルには、GlassFish も含めた多くのコンテナ用の構成とビルドスクリプトが既に用意されています。

source: Building the <literal>jpa</literal> example
fr_fr: La construction de l'exemple <literal>jpa</literal>
it_it: Compilazione dell'esempio <literal>jpa</literal>
ja_jp: <literal>jpa</literal> サンプルのビルド

source: To build the example, use the <literal>glassfish</literal> target:
fr_fr: Pour compiler l'exemple, utilisez la cible <literal>glassfish</literal>:
it_it: Per compilare l'esempio usare il target <literal>glassfish</literal>:
ja_jp: サンプルをビルドするためには、<literal>glassfish</literal> ターゲットを使用します。

source: This will create the container specific <literal>dist-glassfish</literal> and <literal>exploded-archives-glasfish</literal> directories.
fr_fr: Ceci va construire pour le containeur spécifique les dossiers <literal>dist-glassfish</literal> and <literal>exploded-archives-glasfish</literal>
it_it: Questo creerà le cartelle specifiche per l'application server <literal>dist-glassfish</literal> e <literal>exploded-archives-glassfish</literal>.
ja_jp: これによりコンテナに対応した <literal>dist-glassfish</literal> ディレクトリと <literal>exploded-archives-glassfish</literal> ディレクトリが作成されます。

source: Deploying the <literal>jpa</literal> example
fr_fr: Le déploiement de l'exemple <literal>jpa</literal>
it_it: Deploy dell'esempio <literal>jpa</literal>
ja_jp: <literal>jpa</literal> サンプルのデプロイ

source: This is very similar to the <literal>jee5</literal> example at <xref linkend="jee5-glassfish-deploy"/> except that this is a <literal>war</literal> and not an <literal>ear</literal>.
fr_fr: Ceci est très similaire à l'exemple <literal>jee5</literal> à voir <xref linkend="jee5-glassfish-deploy"/> exception faire que c'est un <literal>war</literal> et non un <literal>ear</literal>.
it_it: Questo è molto simile all'esempio <literal>jee5</literal> descritto in <xref linkend="jee5-glassfish-deploy"/> eccetto che questo è un <literal>war</literal> e non un <literal>ear</literal>.

source: Log in to the administration console:
fr_fr: Connectez vous à la console d'administraiton:
it_it: Accedere alla console di amministrazione
ja_jp: 管理コンソールへログインしてください。

source: Access the <literal>Web Applications</literal> in the menu option under the <literal>Applications</literal> left side menu.
fr_fr: Accédez au <literal>Web Applications</literal> dans le menu d'option sous <literal>Applications</literal> dans le menu de gauche.
it_it: Accedere all'opzione di menu <literal>Web Applications</literal> sotto il menu <literal>Applications</literal> che si trova a sinistra.
ja_jp: 左側のサイドメニュー <literal>Applications (アプリケーション)</literal> の下にあるメニューオプションで <literal>Web Applications (Web アプリケーション)</literal> にアクセスしてください。

source: Browse to <literal>examples/jpa/dist-glassfish/jboss-seam-jpa.war</literal>.
fr_fr: Navigez vers <literal>examples/jpa/dist-glassfish/jboss-seam-jpa.war</literal>.
it_it: Navigare su <literal>examples/jpa/dist-glassfish/jboss-seam-jpa.war</literal>.
ja_jp: ブラウザで <literal>examples/jpa/dist-glassfish/jboss-seam-jpa.war</literal> を指定してください。

source: You can now access the application at <literal>http://localhost:8081/jboss-seam-jpa/</literal>.
fr_fr: Vous pouvez maintenant accéder à l'application sur <literal>http://localhost:8081/jboss-seam-jpa/</literal>.
it_it: Ora è possibile accedere all'applicazione all'indirizzo <literal>http://localhost:8081/jboss-seam-jpa/</literal>.
ja_jp: <literal>http://localhost:8081/jboss-seam-jpa/</literal> からアプリケーションにアクセスできます。

source: Using Derby instead of Hypersonic SQL DB
fr_fr: En utilisant Derby au lieur d'Hypersonic SQL DB
it_it: Usare Derby anziché Hypersonic SQL DB
ja_jp: Hypersonic SQL DB の代わりに Derby を使用

source: In order for the app to work out of the box with GlassFish, we have used the Derby (aka JavaDB) database in GlassFish. However, we strongly recommend that you use another database (e.g. HSQL). <literal>examples/jpa/resources-glassfish/WEB-INF/classes/GlassfishDerbyDialect.class</literal> is a hack to get around a Derby bug in GlassFish server. You must use it as your Hibernate dialect if you use Derby with GlassFish.
fr_fr: Pour que l'application fonctionne immédiatement avec GlassFish, nous avons utilisé la base de données Derby (aussi connu JavaDB) dans GlassFish. Cependant, nous recommandons particulièrement d'utiliser une autre base de données (par exemple HSQL). <literal>examples/jpa/resources-glassfish/WEB-INF/classes/GlassfishDerbyDialect.class</literal> est un truc pour contourner un bug de Derby dans le serveur GlassFish. Vous devez l'utiliser comme dialecte Hibernate, si vous utilisez Derby avec GlassFish.
it_it: Per fare funzionare l'applicazione così com'è con GlassFish abbiamo usato il database Derby (detto anche JavaDB) in GlassFish. Comunque è fortemente raccomandato che venga usato un altro database (ad esempio HSQL). <literal>examples/jpa/resources-glassfish/WEB-INF/classes/GlassfishDerbyDialect.class</literal> è un accorgimento per aggirare un problema di Derby nel server GlassFish. Va usato come dialect per Hibernate se si usa Derby con GlassFish.

source: What's different for GlassFish v2 UR2
fr_fr: Ce qui est différent pour GlassFish v2 UR2
it_it: Quali sono le differenze in GlassFish v2 UR2
ja_jp: GlassFish v2 UR2 での変更点

source: <para>Configuration file changes</para>
it_it: <para>Cambiamenti al file di configurazione</para>
ja_jp: <para>構成ファイルの変更</para>

source: <literal>META-INF/persistence.xml</literal> — the main changes needed are the datasource JNDI, switching to the GlassFish transaction manager lookup class, and changing the hibernate dialect to be <literal>GlassfishDerbyDialect</literal>.
fr_fr: <literal>META-INF/persistence.xml</literal> — le principal changement nécéssaire est le datasource JNDI, le basculement vers la classe de scrutation du gestionnaire de transaction de GlassFish , et en changeant le dialecte d'hibernate pour <literal>GlassfishDerbyDialect</literal>.
it_it: <literal>META-INF/persistence.xml</literal> - i principali cambiamenti necessari sono la datasource JNDI, il passaggio alla classe che esegue la risoluzione del gestore delle transazioni di GlassFish e il cambiamento del dialect Hibernate che deve essere <literal>GlassfishDerbyDialect</literal>.

source: <literal>WEB-INF/classes/GlassfishDerbyDialect.class</literal> — this class is needed for the Hibernate dialect change to <literal>GlassfishDerbyDialect</literal>
fr_fr: <literal>WEB-INF/classes/GlassfishDerbyDialect.class</literal> — cette classe est nécesssaire pour que le dialecte d'Hibernate soit changé en <literal>GlassfishDerbyDialect</literal>
it_it: <literal>WEB-INF/classes/GlassFishDerbyDialect.class</literal> — questa classe è necessaria per cambiare il dialect Hibernate in <literal>GlassfishDerbyDialect</literal>

source: <literal>import.sql</literal> — either for the dialect or Derby DB the <literal>ID</literal> column can not be populated by this file and was removed.
fr_fr: <literal>import.sql</literal> — tout comme pour le dialecte la colonne <literal>ID</literal> de Derby DB ne peut être remplie par ce fichier et a été retiré.
it_it: <literal>import.sql</literal> — sia per il diverso dialect che per il database Derby le colonne <literal>ID</literal> non possono essere popolate da questo file sono state rimosse.
ja_jp: <literal>import.sql</literal> &#8212; ダイアレクトと Derby DB のいずれでも <literal>ID</literal> カラムは生成されないので、このファイルから削除されています。

source: Deploying an application generated by <literal>seam-gen</literal> on GlassFish v2 UR2
fr_fr: Le déploiement d'une application générée par <literal>seam-gen</literal> sur GlassFish v2 UR2
it_it: Mettere in esecuzione un'applicazione generata con <literal>seam-gen</literal> su GlassFish v2 UR2
ja_jp: <literal>seam-gen</literal> により生成されたアプリケーションの GlassFish v2 UR2 へのデプロイ

source: <literal>seam-gen</literal> is a very useful tool for developers to quickly get an application up and running, and provides a foundation to add your own functionality. Out of box <literal>seam-gen</literal> will produce applications configured to run on JBoss AS. These instructions will show the steps needed to get it to run on GlassFish.
fr_fr: <literal>seam-gen</literal> est un outil très utile pour les développeurs qui rapidement ont une application opérationnelle et s'exécutant et fourni des fondations pour ajouter vos fonctionnalités. Par défaut<literal>seam-gen</literal> va poduire des applications configurés pour s'exécuter sur JBoss AS. Ces instructions vont montrer les étapes nécéssaire poiyr les avoir pour GlassFish.
it_it: <literal>seam-gen</literal> è uno strumento molto utile per i programmatori per avere velocemente un'applicazione pronta e funzionante, e fornisce la base su cui aggiungere le proprie funzionalità. Così com'è <literal>seam-gen</literal> produrrà un'applicazione configurata per girare su JBoss AS. Le seguenti istruzioni mostrano i passi necessari per farla girare su GlassFish.

source: Running <literal>seam-gen</literal> Setup
fr_fr: Exécution du configurateur <literal>seam-gen</literal>
it_it: Eseguire il setup di <literal>seam-gen</literal>
ja_jp: <literal>seam-gen</literal> セットアップの実行

source: The first step is setting up <literal>seam-gen</literal> to construct the base project. There are several choices made below, specifically the datasource and hibernate values that we will adjust once the project is created.
fr_fr: La première étape est de configurer <literal>seam-gen</literal> pour construire le projet de base. Ils ya plusieurs choix à faire plus bas, particulièrement poiyr le datasource et les valeurs d'hibernate que nous allons modifier une fois que le projet a été créé.
it_it: Il primo passo è configurare <literal>seam-gen</literal> per costruire il progetto base. Ci sono diverse scelte fatte qui sotto, e in particolare i valori della datasource e di Hibernate che metteremo a posto una volta che il progetto è stato creato.
ja_jp: 第一ステップは、雛形となるプロジェクトを生成できるように <literal>seam-gen</literal> をセットアップすることです。以下に実行したように、設定すべき項目がいくつかあります。特に、データソースと Hibernate の設定値は、プロジェクトを生成する環境に合わせて設定します。

source: Type <literal>$ ./seam new-project</literal> to create your project and then <literal>cd /projects/seamgen_example</literal> to the newly created structure.
fr_fr: Entrez <literal>$ ./seam new-project</literal> pour créer votre projet et ensuite <literal>cd /projects/seamgen_example</literal> pour aller dans la structure nouvellement créée.
it_it: Scrivere <literal>$./seam new-project</literal> per creare il progetto e poi fare <literal>cd /projects/seamgen_example</literal> sulla nuova struttura che è stata creata.
ja_jp: プロジェクトを作成するためには、<literal>$ ./seam new-project</literal> と入力してください。そして <literal>cd /projects/seamgen_example</literal> と入力して新しく作成されたディレクトリへ移動してください。

source: Changes needed for deployment to GlassFish
fr_fr: Les modifications nécéssaires pour le déploiement dans GlassFish
it_it: Modifiche necessarie per l'esecuzione su GlassFish
ja_jp: GlassFish へのデプロイに必要な変更点

source: We now need to make some changes to the generated project.
fr_fr: Nous allons maintenant faire quelques modificaitions dans le projet généré.
it_it: Ora dobbiamo fare alcune modifiche al progetto generato.
ja_jp: 生成されたプロジェクトに変更を行う必要があります。

source: <title>Configuration file changes</title>
it_it: <title>Cambiamenti al file di configurazione</title>
ja_jp: <title>構成ファイルの変更</title>
