Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Itext.po
Languages: fr_fr

source: <literal>labelPaint</literal> &#8212; The color used to draw the section labels
fr_fr: <literal>labelPaint</literal> &#8212; La couleur utilisé pour dessiner les labels des sections.

source: <literal>labelGap</literal> &#8212; The gap between the labels and the plot as a percentage of the plot width.
fr_fr: <literal>labelGap</literal> &#8212; La distance entre les labels et les points comme un pourcentage de la largeur du point.

source: <literal>labelBackgroundPaint</literal> &#8212; The color used to draw the background of the section labels. If this is null, the background is not filled.
fr_fr: <literal>labelBackgroundPaint</literal> &#8212; La couleur utilisée pour dessiner l'arrière plan des labels de sections. Si null, l'arrière plan n'est pas rempli.

source: <literal>startAngle</literal> &#8212; The starting angle of the first section.
fr_fr: <literal>startAngle</literal> &#8212; L'angle de départ de la première section.

source: <literal>circular</literal> &#8212; A boolean value indicating that the chart should be drawn as a circle. If false, the chart is drawn as an ellipse. The default is true.
fr_fr: <literal>circular</literal> &#8212; Une valeur boolléenne indicant que le diagramme devrait être dessiné comme un cercle. Si faux, le driagramme est déssiné comme une elipse. Par défaut à vrai.

source: <literal>direction</literal> &#8212; The direction the pie section are drawn. One of: <literal>clockwise</literal> or <literal>anticlockwise</literal>. The default is <literal>clockwise</literal>.
fr_fr: <literal>direction</literal> &#8212; La direction dont la section du camembert est dessinée. Soit: <literal>clockwise</literal> ou <literal>anticlockwise</literal>. Par défaut a <literal>clockwise</literal>.

source: <literal>sectionOutlinePaint</literal> &#8212; The outline paint for all sections.
fr_fr: <literal>sectionOutlinePaint</literal> &#8212; La couleur de bordure pour toutes les sections.

source: <literal>sectionOutlineStroke</literal> &#8212; The outline stroke for all sections
fr_fr: <literal>sectionOutlineStroke</literal> &#8212; Le type de bordure pour toutes les sections

source: <literal>sectionOutlinesVisible</literal> &#8212; Indicates whether an outline is drawn for each section in the plot.
fr_fr: <literal>sectionOutlinesVisible</literal> &#8212; Indique si une bordure est dessinée pour chaque section du point.

source: <literal>baseSectionOutlinePaint</literal> &#8212; The base section outline paint.
fr_fr: <literal>baseSectionOutlinePaint</literal> &#8212; La bordure de la section de base à dessiner.

source: <literal>baseSectionPaint</literal> &#8212; The base section paint.
fr_fr: <literal>baseSectionPaint</literal> &#8212; Le dessin de la section de base.

source: <literal>baseSectionOutlineStroke</literal> &#8212; The base section outline stroke.
fr_fr: <literal>baseSectionOutlineStroke</literal> &#8212; Le style de trait pour la bordure extérieure .

source: Category data can be broken down into series. The series tag is used to categorize a set of data with a series and apply styling to the entire series.
fr_fr: Les données de catégories peuvent être divisées en séries. La balise de la série est utilisée pour catégoriser un groupe de données et lui appliquer un style sur toute la série.

source: <literal>key</literal> &#8212; The series name.
fr_fr: <literal>key</literal> &#8212; Le nom de la série.

source: <literal>seriesPaint</literal> &#8212; The color of each item in the series
fr_fr: <literal>seriesPaint</literal> &#8212; La couleur de chaque élément de la série

source: <literal>seriesOutlinePaint</literal> &#8212; The outline color for each item in the series.
fr_fr: <literal>seriesOutlinePaint</literal> &#8212; La couleur pour chaque élément de la série.

source: <literal>seriesOutlineStroke</literal> &#8212; The stroke used to draw each item in the series.
fr_fr: <literal>seriesOutlineStroke</literal> &#8212; Le style de bordure à utiliser pour chaque élément de la série.

source: <literal>seriesVisible</literal> &#8212; A boolean indicating if the series should be displayed.
fr_fr: <literal>seriesVisible</literal> &#8212; Un booléen indiquant si la série doit ête affichée.

source: <literal>seriesVisibleInLegend</literal> &#8212; A boolean indicating if the series should be listed in the legend.
fr_fr: <literal>seriesVisibleInLegend</literal> &#8212; Un booléen indiquant si la serie doit être listé dans la légende.

source: The data tag describes each data point to be displayed in the graph.
fr_fr: La balise data décrit chaque point à afficher pour le graphe.

source: <literal>key</literal> &#8212; The name of the data item.
fr_fr: <literal>key</literal> &#8212; Le nom d'élément donnée.

source: <literal>series</literal> &#8212; The series name, when not embedded inside a <code>&lt;p:series&gt;</code>.
fr_fr: <literal>series</literal> &#8212; Le nom de la série, quand elle n'est pas embarquée dans un <code>&lt;p:series&gt;</code>.

source: <literal>value</literal> &#8212; The numeric data value.
fr_fr: <literal>value</literal> &#8212; La donnée en valeur numéique.

source: <literal>explodedPercent</literal> &#8212; For pie charts, indicates how exploded a from the pie a piece is.
fr_fr: <literal>explodedPercent</literal> &#8212; Pour les diagramme en camembert, indique comme éclater les parts du camembert.

source: <literal>sectionOutlinePaint</literal> &#8212; For bar charts, the color of the section outline.
fr_fr: <literal>sectionOutlinePaint</literal> &#8212; Pour les diagrammes en baton, la couleur de la bordure de la section.

source: <literal>sectionOutlineStroke</literal> &#8212; For bar charts, the stroke type for the section outline.
fr_fr: <literal>sectionOutlineStroke</literal> &#8212; Pour les diagrammes en baton, le type de bordure pour la section.

source: <literal>sectionPaint</literal> &#8212; For bar charts, the color of the section.
fr_fr: <literal>sectionPaint</literal> &#8212; Pour les diagramme en baton, la couleur de la section.

source: The color component declares a color or gradient than can be referenced when drawing filled shapes.
fr_fr: Le composant couleur déclare une couleur ou un dégradé qui peut être utilisé quand on dessine des formes géométriques pleines.

source: <literal>color</literal> &#8212; The color value. For gradient colors, this the starting color.
fr_fr: <literal>color</literal> &#8212; La valeur de la couleur. Pour un dégradé, ceci ets la couleur de départ.

source: <literal>color2</literal> &#8212; For gradient colors, this is the color that ends the gradient.
fr_fr: <literal>color2</literal> &#8212; Pour le dégradé, ceci ets la couleur de fin.

source: <literal>point</literal> &#8212; The co-ordinates where the gradient color begins.
fr_fr: <literal>point</literal> &#8212; La coordonnée où le dégrradé de couleur commence.

source: <literal>point2</literal> &#8212; The co-ordinates where the gradient color ends.
fr_fr: <literal>point2</literal> &#8212; La coordonnées où le dégradé de couleur fini.

source: Describes a stroke used to draw lines in a chart.
fr_fr: Description d'un trait pour dessiner des lignes dans un diagramme.

source: <literal>width</literal> &#8212; The width of the stroke.
fr_fr: <literal>width</literal> &#8212; La largeur du trait.

source: <literal>cap</literal> &#8212; The line cap type. Valid values are <literal>butt</literal>, <literal>round</literal> and <literal>square</literal>
fr_fr: <literal>cap</literal> &#8212; Le type de ligne. Les valeurs valident sont <literal>butt</literal>, <literal>round</literal> et <literal>square</literal>

source: <literal>join</literal> &#8212; The line join type. Valid values are <literal>miter</literal>, <literal>round</literal> and <literal>bevel</literal>
fr_fr: <literal>join</literal> &#8212; Le type de ligne de liaison. Les valeurs valident sont <literal>miter</literal>, <literal>round</literal> et <literal>bevel</literal>

source: <literal>miterLimit</literal> &#8212; For miter joins, this value is the limit of the size of the join.
fr_fr: <literal>miterLimit</literal> &#8212; Pour une liaison en angle, cette valeur est la taille limite de la liaison.

source: <literal>dash</literal> &#8212; The dash value sets the dash pattern to be used to draw the line. The space separated integers indicate the length of each alternating drawn and undrawn segments.
fr_fr: <literal>dash</literal> &#8212; La valeur des tirets défini pour le patron de tirets à utiliser pour dessiner la ligne. Des entiers séparés par des espaces indique la longeur de chaque segments d'espacement, puis de tiret.

source: Bar codes
fr_fr: Les codes Bar.

source: Seam can use iText to generate barcodes in a wide variety of formats. These barcodes can be embedded in a PDF document or displayed as an image on a web page. Note that when used with HTML images, barcodes can not currently display barcode text in the barcode.
fr_fr: Seam peut utiliser iText pour générer des codes barres dans une grande variété de formats. Ces codes barres peuvent être embarqués dans un document PDF ou affichés comme une image sur une page Web. Notez que quand on utilise comme une image en HTML, les codes barres ne peuvent pas afficher de texte dans le code barre.

source: Displays a barcode image.
fr_fr: Affichage d'une image barcode.

source: <literal>type</literal> &#8212; A barcode type supported by iText. Valid values include: <literal>EAN13</literal>, <literal>EAN8</literal>, <literal>UPCA</literal>, <literal>UPCE</literal>, <literal>SUPP2</literal>, <literal>SUPP5</literal>, <literal>POSTNET</literal>, <literal>PLANET</literal>, <literal>CODE128</literal>, <literal>CODE128_UCC</literal>, <literal>CODE128_RAW</literal> and <literal>CODABAR</literal>.
fr_fr: <literal>type</literal> &#8212; Un type de code barre supporté par iText. Les valeurs valident sont : <literal>EAN13</literal>, <literal>EAN8</literal>, <literal>UPCA</literal>, <literal>UPCE</literal>, <literal>SUPP2</literal>, <literal>SUPP5</literal>, <literal>POSTNET</literal>, <literal>PLANET</literal>, <literal>CODE128</literal>, <literal>CODE128_UCC</literal>, <literal>CODE128_RAW</literal> et <literal>CODABAR</literal>.

source: <literal>code</literal> &#8212; The value to be encoded by the barcode.
fr_fr: <literal>code</literal> &#8212; La valeur a encodé comme un code barres.

source: <literal>xpos</literal> &#8212; For PDFs, the absolute y position of the barcode on the page.
fr_fr: <literal>xpos</literal> &#8212; Pour les PDFs, la position absolue en y du barre code dans la page .

source: <literal>ypos</literal> &#8212; For PDFs, the absolute y position of the barcode on the page.
fr_fr: <literal>ypos</literal> &#8212; Pour les PDFs, la position absolue en y du code barre dans la page.

source: <literal>rotDegrees</literal> &#8212; For PDFs, the rotation factor of the barcode in degrees.
fr_fr: <literal>rotDegrees</literal> &#8212; Pour les PDFs, le facteur de rotation du code barre en degrée.

source: <literal>barHeight</literal> &#8212; The height of the bars in the barCode
fr_fr: <literal>barHeight</literal> &#8212; La hauteur du code barre dans le barCode

source: <literal>minBarWidth</literal> &#8212; The minimum bar width.
fr_fr: <literal>minBarWidth</literal> &#8212; La largeur minimale de la barre.

source: <literal>barMultiplier</literal> &#8212; The bar multiplier for wide bars or the distance between bars for <literal>POSTNET</literal> and <literal>PLANET</literal> code.
fr_fr: <literal>barMultiplier</literal> &#8212; Le facteur multiplicateur de la barre pour les barres larges ou la ditance entre les barres pour les codes <literal>POSTNET</literal> et<literal>PLANET</literal>.

source: <literal>barColor</literal> &#8212; The color to draw the bars.
fr_fr: <literal>barColor</literal> &#8212; La couleur pour déssiner les barres.

source: <literal>textColor</literal> &#8212; The color of any text on the barcode.
fr_fr: <literal>textColor</literal> &#8212; La couleur pour tout texte sur le code barres.

source: <literal>textSize</literal> &#8212; The size of the barcode text, if any.
fr_fr: <literal>textSize</literal> &#8212; La taille du texte du code barres s'il y a du texte.

source: <literal>altText</literal> &#8212; The <literal>alt</literal> text for HTML image links.
fr_fr: <literal>altText</literal> &#8212; Le texte <literal>alt</literal> pour les liens des images en HTML.

source: Fill-in-forms
fr_fr: Remplissage de formulaires

source: If you have a complex, pre-generated PDF with named fields, you can easily fill in the values from your application and present it to the user.
fr_fr: Si vous avez un PDF prégénéré et complexe avec des champs de formunaire, vous pouvez facillement remplir les valeurs depuis votre applicatio et le présenter aux utilisateurs.

source: Defines a form template to populate
fr_fr: Définissez un modèle de formulaire à remplir

source: <literal>URL</literal> &#8212; An URL pointing to the PDF file to use as a template. If the value has no protocol part (://), the file is read locally.
fr_fr: <literal>URL</literal> &#8212; Une URL indiquant où le fichier PDF est à utiliser comme modèle. Si la valeur n'a pas de partie avec un protocole(://), le fichier est lu localement.

source: <literal>filename</literal> &#8212; The filename to use for the generated PDF file.
fr_fr: <literal>filename</literal> &#8212; Le nom de fichier à utiliser pour générer le fichier PDDF

source: <literal>exportKey</literal> &#8212; Place the generated PDF file in a DocumentData object under the specified key in the event context. If set, no redirect will occur.
fr_fr: <literal>exportKey</literal> &#8212; Placez le fichier PDF à générer dans un objet DocumentData sous la clé spécifiée dans le contexte evenementiel. Si défini, aucune redirection n'intervient.

source: Connects a field name to its value
fr_fr: Connectez le nom d'un champs à sa valeur

source: <literal>name</literal> &#8212; The name of the field
fr_fr: <literal>name</literal> &#8212; Le nom du champs.

source: <literal>value</literal> &#8212; The value of the field
fr_fr: <literal>value</literal> &#8212; La valeur du champs

source: <literal>readOnly</literal> &#8212; Should the field be read-only? Defaults to true.
fr_fr: <literal>readOnly</literal> &#8212; Le champ est-il en lecture seule? Par défaut à vrai.

source: Rendering Swing/AWT components
fr_fr: Le rendu des composants Swing/AWT

source: Seam now provides experimental support for rendering Swing components to into a PDF image. Some Swing look and feels supports, notably ones that use native widgets, will not render correctly.
fr_fr: Seam fourni maintenant un support expérimental pour le rendu des composants Swing dans une image PDF. Quelques supports de thème de Swing, notablement ce qui utilisent des widgets natifs, ne seront pas rendu correctement.

source: Renders a Swing component into a PDF document.
fr_fr: Rendre un composant Swing dans un document PDF.

source: <literal>width</literal> &#8212; The width of the component to be rendered.
fr_fr: <literal>width</literal> &#8212; La largeur du document à rendre.

source: <literal>height</literal> &#8212; The height of the component to be rendered.
fr_fr: <literal>height</literal> &#8212; La hauteur du document à rendre.

source: <literal>component</literal> &#8212; An expression whose value is a Swing or AWT component.
fr_fr: <literal>component</literal> &#8212; Une expression dont la valeur est un composant Swing ou AWT.

source: Configuring iText
fr_fr: La configuration de iText

source: Document generation works out of the box with no additional configuration needed. However, there are a few points of configuration that are needed for more serious applications.
fr_fr: La génération de document fonctionne tel quelle sans aucune configurationns additionnelles nécéssaire. Cependant, il y a quelques éléments de configuration qui sont écéssaire pour des applications plus importantes.

source: The default implementation serves PDF documents from a generic URL, <literal>/seam-doc.seam</literal>. Many browsers (and users) would prefer to see URLs that contain the actual PDF name like <literal>/myDocument.pdf</literal>. This capability requires some configuration. To serve PDF files, all <literal>*.pdf</literal> resources should be mapped to the DocumentStoreServlet:
fr_fr: L'implémentation par défaut délivre des documents PDF depuis une URL générique, <literal>/seam-doc.seam</literal>. Beaucoup de navigateurs (et d'utilisateurs) préfèrerons voir les URLs qui contienne un véritable nom de PDF comme <literal>/myDocument.pdf</literal>. Cette capacité nécéssite un peu de configuration. Pour délivrer des fichiers PDF , toutes les resources <literal>*.pdf</literal> devrait être liées au DocumentStoreServlet:

source: The <literal>use-extensions</literal> option on the document store component completes the functionality by instructing the document store to generate URLs with the correct filename extension for the document type being generated.
fr_fr: L'option <literal>use-extensions</literal> sur le document stocke le composant complète la fonctionnalité en introduisant le document stocké en générant les URLs avec l'extension sur le nom de fichier correcte pour le document ayant été généré.

source: The document store stores documents in conversation scope, and documents will expire when the conversation ends. At that point, references to the document will be invalid. You can specify a default view to be shown when a document does not exist using the <literal>error-page</literal> property of the <literal>documentStore</literal>.
fr_fr: Le porte-document stocke les documents dans l'étendue de conversation et les document vont expirés quand la conversation se terminera. A ce moment là, les références vers le document seront invalidées. Vous pouvez spécifier uen vue par défaut à afficher quand un document n'existe pas en utilisant la propriété <literal>error-page</literal> du <literal>documentStore</literal>.

source: Further documentation
fr_fr: Pour plus de documentation

source: For further information on iText, see:
fr_fr: Pour plus d'informations sur iText, voir:

source: iText Home Page
fr_fr: Site Web de iText

source: iText in Action
fr_fr: iText en Action
