Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Itext.po
Languages: fr_fr

source: iText PDF generation
fr_fr: Génération iText PDF

source: Seam now includes a component set for generating documents using iText. The primary focus of Seam's iText document support is for the generation of PDF documents, but Seam also offers basic support for RTF document generation.
fr_fr: Seam inclus maintenant un groupe de composant pour la génération de documents en utilisant iText. le premier but du support de document iText de Seam est pour la génération de documents PDF, mais Seam offre aussi un support basique pour la génération de document RTF.

source: Using PDF Support
fr_fr: Utilisation du support PDF

source: iText support is provided by <literal>jboss-seam-pdf.jar</literal>. This JAR contains the iText JSF controls, which are used to construct views that can render to PDF, and the DocumentStore component, which serves the rendered documents to the user. To include PDF support in your application, put <literal>jboss-seam-pdf.jar</literal> in your <literal>WEB-INF/lib</literal> directory along with the iText JAR file. There is no further configuration needed to use Seam's iText support.
fr_fr: Le support de iText est fournie par <literal>jboss-seam-pdf.jar</literal>. Ce JAR contient les contrôles iText JSF, qui sont utilisés pour construire les vues qui peuvent être rendues vers le PDF et le composant DocumentStore qui servent pour rendre les documents à l'utilisateur. Pour inclure le support PDF dans votre application, il faut inclure<literal>jboss-seam-pdf.jar</literal> dans votre dossier <literal>WEB-INF/lib</literal> avec le fichier iText JAR. Il n'y a pas plus comme configuration nécéssaire pour le support de iText de Seam.

source: The Seam iText module requires the use of Facelets as the view technology. Future versions of the library may also support the use of JSP. Additionally, it requires the use of the seam-ui package.
fr_fr: Le module de Seam iText requière l'utilisation de Facelets comme technologie d'affichage. Les versions futures de la bibliothèque pourrons aussi supporter l'utilisation de JSP. En plus, il faut utiliser le paquet seam-ui.

source: The <literal>examples/itext</literal> project contains an example of the PDF support in action. It demonstrates proper deployment packaging, and it contains a number examples that demonstrate the key PDF generation features current supported.
fr_fr: Le projet <literal>examples/itext</literal> contient un exemple du support de PDF en action. Il démontre comment est fait le déploiement propre des paquets et il contient de nombreux exemples qui montre les fonctionnalités clef de la génération de PDF actuellement supportées.

source: Creating a document
fr_fr: La création d'un document

source: Documents are generated by facelet XHTML files using tags in the <literal>http://jboss.com/products/seam/pdf</literal> namespace. Documents should always have the <literal>document</literal> tag at the root of the document. The <literal>document</literal> tag prepares Seam to generate a document into the DocumentStore and renders an HTML redirect to that stored content.
fr_fr: Les documents sont générés par les documents facelets en utilisant les tags dans l'espace de nom <literal>http://jboss.com/products/seam/pdf</literal>. Les documents devraient toujours avoir le tag <literal>document</literal> comme racine du document. Le tag <literal>document</literal> prépare Seam pour générer un document dans le DocumentStore et à le rendre en HTML en redirigeant le contenu stocké.

source: Attributes
fr_fr: Attribues

source: <literal>type</literal> &#8212; The type of the document to be produced. Valid values are <literal>PDF</literal>, <literal>RTF</literal> and <literal>HTML</literal> modes. Seam defaults to PDF generation, and many of the features only work correctly when generating PDF documents.
fr_fr: <literal>type</literal> &#8212; Le type de document qui doit être produit. Les valeurs valides sont les modes <literal>PDF</literal>, <literal>RTF</literal> et <literal>HTML</literal> . Seam prends par défaut une génération PDF et beaucoup de fonctionnalités ne fonctionnent correctement qu'en génération des documents PDF.

source: <literal>pageSize</literal> &#8212; The size of the page to be generate. The most commonly used values would be <literal>LETTER</literal> and <literal>A4</literal>. A full list of supported pages sizes can be found in <literal>com.lowagie.text.PageSize</literal> class. Alternatively, pageSize can provide the width and height of the page directly. The value "612 792", for example, is equivalent to the LETTER page size.
fr_fr: <literal>pageSize</literal> &#8212; La taille de page à générer. Les valeurs utilisées de manière classiques devraient être <literal>LETTER</literal> et <literal>A4</literal>. Une pleine liste de tailles de pages supportées peut être trouvée dans la classe <literal>com.lowagie.text.PageSize</literal>. Autrement, pageSize peut fournir une largeur et une hauteur de page directement. La valeur "612 792", par exemple, est équivalent à une taille de page de type LETTER.

source: <literal>orientation</literal> &#8212; The orientation of the page. Valid values are <literal>portrait</literal> and <literal>landscape</literal>. In landscape mode, the height and width page size values are reversed.
fr_fr: <literal>orientation</literal> &#8212; L'orientation de la page. Les valeurs valides sont <literal>portrait</literal> et <literal>landscape</literal>. En mode paysage, la les valeurs de largeur et la hauteur de la page sont inversées.

source: <literal>margins</literal> &#8212; The left, right, top and bottom margin values.
fr_fr: <literal>margins</literal> &#8212; Les valeurs de marges haute, basse , droite et gauche.

source: <literal>marginMirroring</literal> &#8212; Indicates that margin settings should be reversed an alternating pages.
fr_fr: <literal>marginMirroring</literal> &#8212; Indique si les valeurs des marges doivent être inversées sur la page suivante.

source: <literal>disposition</literal> &#8212; When generating PDFs in a web browser, this determines the HTTP <literal>Content-Disposition</literal> of the document. Valid values are <literal>inline</literal>, which indicates the document should be displayed in the browser window if possible, and <literal>attachment</literal>, which indicates that the document should be treated as a download. The default value is <literal>inline</literal>.
fr_fr: <literal>disposition</literal> &#8212; Avec la génération de PDF dans un navigateur web ceci détermine le <literal>Content-Disposition</literal> HTTP du docment. Les valeurs valides sont <literal>inline</literal>, qui indique que le document devrait ête affiché dans la fenêtre du navigateur si c'est possible, et <literal>attachment</literal>, qui indique le document devrait être traité comme téléchargeable. La valeur par défaut est <literal>inline</literal>.

source: <literal>fileName</literal> &#8212; For attachments, this value overrides the downloaded file name.
fr_fr: <literal>fileName</literal> &#8212; Pour les pièces jointes, cette valeur surcharge le nom du fichier téléchargé.

source: Basic Text Elements
fr_fr: Les éléments d textes basiques

source: Useful documents will need to contain more than just text; however, the standard UI components are geared towards HTML generation and are not useful for generating PDF content. Instead, Seam provides a special UI components for generating suitable PDF content. Tags like <literal>&lt;p:image&gt;</literal> and <literal>&lt;p:paragraph&gt;</literal> are the basic foundations of simple documents. Tags like <literal>&lt;p:font&gt;</literal> provide style information to all the content surrounding them.
fr_fr: Les documents courrants ont besoin de contenir bien plus que seulement du texte; cependant, les composants UI standards sont prévue pour la génération HTML et pas très utile pour la génération de contenu PDF. Ainis, Seam fourni des composants UI spéciaux pour la génération de parfait contenu PDF. Les balises comme <literal>&lt;p:image&gt;</literal> et <literal>&lt;p:paragraph&gt;</literal> sont les fondations de bases de simples documents. Les balises comme <literal>&lt;p:font&gt;</literal> fournissent des informations sur le style de tous les contenues autour d'elles.

source: Most uses of text should be sectioned into paragraphs so that text fragments can be flowed, formatted and styled in logical groups.
fr_fr: La plus part des textes doivent pouvoir être divisés en paragraphes donc les fragments de texte peuvent être enchainnées, formatés et disposant d'un style en groupes logiques.

source: <literal>spacingBefore</literal> &#8212; The blank space to be inserted before the element.
fr_fr: <literal>spacingBefore</literal> &#8212; Un espace doit être inséré avant l'élément.

source: <literal>spacingAfter</literal> &#8212; The blank space to be inserted after the element.
fr_fr: <literal>spacingAfter</literal> &#8212; Un espace doit être inséré après l'élément.

source: The <literal>text</literal> tag allows text fragments to be produced from application data using normal JSF converter mechanisms. It is very similar to the <literal>outputText</literal> tag used when rendering HTML documents.
fr_fr: La balise <literal>text</literal> permet aux fragments de textes d'être produit depuis des donnnées de l'application en utilisant les méchanisme de conversation JSF classique. De manière similaire à la balise <literal>outputText</literal> utilisé pour rendre les documents en HTML.

source: <literal>value</literal> &#8212; The value to be displayed. This will typically be a value binding expression.
fr_fr: <literal>value</literal> &#8212; La valeur a affiché. Ceci sera typiquement une expression liée à une valeur.

source: The <literal>html</literal> tag renders HTML content into the PDF.
fr_fr: La balise <literal>html</literal> rends le contenu Html en PDF.

source: <literal>value</literal> &#8212; The text to be displayed.
fr_fr: <literal>value</literal> &#8212; Le texte à afficher.

source: The font tag defines the default font to be used for all text inside of it.
fr_fr: La balise de police de la police par défauit à utiliser pour tous les textes qu'elle englobe.

source: <literal>name</literal> &#8212; The font name, for example: <literal>COURIER</literal>, <literal>HELVETICA</literal>, <literal>TIMES-ROMAN</literal>, <literal>SYMBOL</literal> or <literal>ZAPFDINGBATS</literal>.
fr_fr: <literal>name</literal> &#8212; Le nom de la police, par exemple: <literal>COURIER</literal>, <literal>HELVETICA</literal>, <literal>TIMES-ROMAN</literal>, <literal>SYMBOL</literal> ou <literal>ZAPFDINGBATS</literal>.

source: <literal>size</literal> &#8212; The point size of the font.
fr_fr: <literal>size</literal> &#8212; La taille en point de la police.

source: <literal>style</literal> &#8212; The font styles. Any combination of : <literal>NORMAL</literal>, <literal>BOLD</literal>, <literal>ITALIC</literal>, <literal>OBLIQUE</literal>, <literal>UNDERLINE</literal>, <literal>LINE-THROUGH</literal>
fr_fr: <literal>style</literal> &#8212; Le style de la police. Toute combinaison de : <literal>NORMAL</literal>, <literal>BOLD</literal>, <literal>ITALIC</literal>, <literal>OBLIQUE</literal>, <literal>UNDERLINE</literal>, <literal>LINE-THROUGH</literal>

source: <literal>color</literal> &#8212; The font color. (see <xref linkend="itext.colors"/> for color values)
fr_fr: <literal>color</literal> &#8212; La couleur de la police. (voir <xref linkend="itext.colors"/> pour les valeurs des couleurs)

source: <literal>encoding</literal> &#8212; The character set encoding.
fr_fr: <literal>encoding</literal> &#8212; Le groupe d'encodage de caractères.

source: <literal>p:newPage</literal> inserts a page break.
fr_fr: <literal>p:newPage</literal> insère un saut de page.

source: <literal>p:image</literal> inserts an image into the document. Images can be loaded from the classpath or from the web application context using the <literal>value</literal> attribute.
fr_fr: <literal>p:image</literal> insère une image dans le document. Les images peuvent être chargées depuis le classpath ou depuis le contexte de l'applicationw web en utilisant l'attribut <literal>value</literal>.

source: Resources can also be dynamically generated by application code. The <literal>imageData</literal> attribute can specify a value binding expression whose value is a <literal>java.awt.Image</literal> object.
fr_fr: Les resources peuvent aussi être générée dynamiquement par le code de l'application. L'attribut <literal>imageData</literal> peut spécifier une expression en liaison avec une valeur cette valeur est un objet <literal>java.awt.Image</literal>.

source: <literal>value</literal> &#8212; A resource name or a method expression binding to an application-generated image.
fr_fr: <literal>value</literal> &#8212; Un nom de ressource ou une relation avec une expression d'une méthode pour l'imagé générée de l'application.

source: <literal>rotation</literal> &#8212; The rotation of the image in degrees.
fr_fr: <literal>rotation</literal> &#8212; La rotation de l'image en degrée.

source: <literal>height</literal> &#8212; The height of the image.
fr_fr: <literal>height</literal> &#8212; La hauteur de l'image .

source: <literal>width</literal> &#8212; The width of the image.
fr_fr: <literal>width</literal> &#8212; La largeur de l'image.

source: <literal>alignment</literal>&#8212; The alignment of the image. (see <xref linkend="itext.alignment"/> for possible values)
fr_fr: <literal>alignment</literal>&#8212; L'alignement de l'image (voir <xref linkend="itext.alignment"/> pour les valeurs possibles)

source: <literal>alt</literal> &#8212; Alternative text representation for the image.
fr_fr: <literal>alt</literal> &#8212; Texte alternatif pour la représentation de l'image.

source: <literal>scalePercent</literal> &#8212; The scaling factor (as a percentage) to use for the image. This can be expressed as a single percentage value or as two percentage values representing separate x and y scaling percentages.
fr_fr: <literal>scalePercent</literal> &#8212; La facteur de mise à l'échelle (en pourcentage) à utiliser pour l'image. Ceci peut être exprimée comme un seul pourcentage ou par deux valeurs représentant des pourcentages différents sur l'échelle de x et de y.

source: <literal>scaleToFit</literal> &#8212; Specifies the X any Y size to scale the image to. The image will be scale to fit those dimensions as closely as possible while preserving the XY ratio of the image.
fr_fr: <literal>scaleToFit</literal> &#8212; Indique la taille en X et la taille Y sera calculé pour mettre à l'échelle l'image. L'image sera mise à l'échelle pour faire correspondre à ces dimnesions de manière aussi proche que possible pour préserver le ratio XY de l'image.

source: <literal>p:anchor</literal> defines clickable links from a document. It supports the following attributes:
fr_fr: <literal>p:anchor</literal> défini des liens cliquables pour un document. Il supporte les attributs suivants:

source: <literal>name</literal> &#8212; The name of an in-document anchor destination.
fr_fr: <literal>name</literal> &#8212; Le nom du point d'ancrage dans le document de destination.

source: <literal>reference</literal> &#8212; The destination the link refers to. Links to other points in the document should begin with a "#". For example, "#link1" to refer to an anchor position with a <literal>name</literal> of <literal>link1</literal>. Links may also be a full URL to point to a resource outside of the document.
fr_fr: <literal>reference</literal> &#8212; La destination du lien référé par. Les liens vers des autres points dans le document devraient commencer par un "#". Par exemple, "#link1" pour indiquer une position d'ancrage avec un <literal>name</literal> à <literal>link1</literal>. Les liens peuvent aussi avoir un URL complète pour indiquer une ressource à l'extérieure du document.

source: Headers and Footers
fr_fr: Entêtes et pieds de page

source: The <literal>p:header</literal> and <literal>p:footer</literal> components provide the ability to place header and footer text on each page of a generated document. Header and footer declarations should appear at the beginning of a document.
fr_fr: Les composants <literal>p:header</literal> et <literal>p:footer</literal> fournissent la capacité de placer des textes en entêtes et en pieds de pages sur chaque page du document généré. Les déclarations d'entêtes et de pieds de pages devrait apparaitrent au début du document.

source: <literal>alignment</literal> &#8212; The alignment of the header/footer box section. (see <xref linkend="itext.alignment"/> for alignment values)
fr_fr: <literal>alignment</literal> &#8212; L'alignement de la section de la boite d'entête ou de pied de page. (voir <xref linkend="itext.alignment"/> pour les valeurs d'alignements)

source: <literal>backgroundColor</literal> &#8212; The background color of the header/footer box. (see <xref linkend="itext.colors"/> for color values)
fr_fr: <literal>backgroundColor</literal> &#8212; La couleur d'arrière plan de la boite d'entête ou de pied de page. (voir <xref linkend="itext.colors"/> pour les valeurs des couleurs)

source: <literal>borderColor</literal> &#8212; The border color of the header/footer box. Individual border sides can be set using <literal>borderColorLeft</literal>, <literal>borderColorRight</literal>, <literal>borderColorTop</literal> and <literal>borderColorBottom</literal>.(see <xref linkend="itext.colors"/> for color values)
fr_fr: <literal>borderColor</literal> &#8212; La couleur de la bordure de la boit d'entête oude pied de page. Les traits de bordures peuvent être définis individuellement en utilisant <literal>borderColorLeft</literal>, <literal>borderColorRight</literal>, <literal>borderColorTop</literal> et <literal>borderColorBottom</literal>.(voir <xref linkend="itext.colors"/> pour les valeurs des couleurs)

source: <literal>borderWidth</literal> &#8212; The width of the border. Individual border sides can be specified using <literal>borderWidthLeft</literal>, <literal>borderWidthRight</literal>, <literal>borderWidthTop</literal> and <literal>borderWidthBottom</literal>.
fr_fr: <literal>borderWidth</literal> &#8212; La largeur de la bordure. Les traits de bordures peuvent être définie individuellement en utilisant <literal>borderWidthLeft</literal>, <literal>borderWidthRight</literal>, <literal>borderWidthTop</literal> et <literal>borderWidthBottom</literal>.

source: The current page number can be placed inside of a header or footer using the <literal>p:pageNumber</literal> tag. The page number tag can only be used in the context of a header or footer and can only be used once.
fr_fr: Le numéro de page courrant peut être placé dans l'entête ou le pied de page en utilisant la balise <literal>p:pageNumber</literal>. La balise de numéro de page peut seulement être utilisé dans le contexte d'une entête ou d'un pied de page et ne peut être utilisé qu'une fois.

source: Chapters and Sections
fr_fr: Les chapitres et les sections

source: If the generated document follows a book/article structure, the <literal>p:chapter</literal> and <literal>p:section</literal> tags can be used to provide the necessary structure. Sections can only be used inside of chapters, but they may be nested arbitrarily deep. Most PDF viewers provide easy navigation between chapters and sections in a document.
fr_fr: Si le document généré suit la structure d'un livre ou d'un article, les balises <literal>p:chapter</literal> et <literal>p:section</literal> peuvent être utilisés pour fournir la structure nécéssaire. Les sections peuvent seulement être utilisé dans des chapitres mais peuvent être englobé de manière arbitraire quelquesoit la profondeur de leur encapsulation. La plus part des visualisateurs de PDF fournissent une navigation facilitée entre les chapitres et les sections dans un document.

source: <literal>number</literal> &#8212; The chapter number. Every chapter should be assigned a chapter number.
fr_fr: <literal>number</literal> &#8212; Le numéro de chapitre. Chaque chapitre devrait avoir un numérod e chapitre assigné.

source: <literal>numberDepth</literal> &#8212; The depth of numbering for section. All sections are numbered relative to their surrounding chapter/sections. The fourth section of the first section of chapter three would be section 3.1.4, if displayed at the default number depth of three. To omit the chapter number, a number depth of 2 should be used. In that case, the section number would be displayed as 1.4.
fr_fr: <literal>numberDepth</literal> &#8212; La profondeur de la numérotation de la section. Toutes les sections ont un numéro relatif au chapitre/section les englobant. La quatrième section de la première section du chapitre trois devrait être la section 3.1.4, si on affiche la profondeur par défaut à 3 nombres. Pour masquer le numéro de chapitre, une profondeur de 2 devrait être utilisé. Dans ce cas, la section sera affiché comme 1.4.

source: Any chapter or section can contain a <literal>p:title</literal>. The title will be displayed next to the chapter/section number. The body of the title may contain raw text or may be a <literal>p:paragraph</literal>.
fr_fr: Tout chapitre ou section devrait contenur un <literal>p:title</literal>. Le titre sera affiché à côté du numéro de chapitre ou de section. Le corps du titre peut contenir un texte but ou peut être un <literal>p:paragraph</literal>.

source: Lists
fr_fr: Les listes

source: List structures can be displayed using the <literal>p:list</literal> and <literal>p:listItem</literal> tags. Lists may contain arbitrarily-nested sublists. List items may not be used outside of a list. The following document uses the <literal>ui:repeat</literal> tag to to display a list of values retrieved from a Seam component.
fr_fr: Les structures de listes peuvent être affiché en utilisant les balises <literal>p:list</literal> et <literal>p:listItem</literal>. Les listes peuvent contenir des sous-listes englobées arbitrairement. Les éléments de la liste ne devraient pas être utilisés à l'extérieur de la liste. Le document suivant utilise la balise <literal>ui:repeat</literal> pour afficher une liste des valeurs extraites depuis un composant de Seam.

source: <literal>style</literal> &#8212; The ordering/bulleting style of list. One of: <literal>NUMBERED</literal>, <literal>LETTERED</literal>, <literal>GREEK</literal>, <literal>ROMAN</literal>, <literal>ZAPFDINGBATS</literal>, <literal>ZAPFDINGBATS_NUMBER</literal>. If no style is given, the list items are bulleted.
fr_fr: <literal>style</literal> &#8212; Les styles de listes de type ordonnées/numérotées. Une parmis: <literal>NUMBERED</literal>, <literal>LETTERED</literal>, <literal>GREEK</literal>, <literal>ROMAN</literal>, <literal>ZAPFDINGBATS</literal>, <literal>ZAPFDINGBATS_NUMBER</literal>. Si aucun style n'est données, les éléments de la listes sont précédés d'un rond.

source: <literal>listSymbol</literal> &#8212; For bulleted lists, specifies the bullet symbol.
fr_fr: <literal>listSymbol</literal> &#8212; Pour les listes avec symboles, indique le type de symbole.

source: <literal>indent</literal> &#8212; The indentation level of the list.
fr_fr: <literal>indent</literal> &#8212; Le niveau d'indentation de la liste.

source: <literal>lowerCase</literal> &#8212; For list styles using letters, indicates whether the letters should be lower case.
fr_fr: <literal>lowerCase</literal> &#8212; Pour les styles de listes utilisant les lettres, indique si les lettres doivent être en minuscules.
