Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Itext.po
Languages: fr_fr

source: <literal>charNumber</literal> &#8212; For ZAPFDINGBATS, indicates the character code of the bullet character.
fr_fr: <literal>charNumber</literal> &#8212; Pour le style ZAPFDINGBATS, indique si le code du caractères précédant l'élément de la liste.

source: <literal>numberType</literal> &#8212; For ZAPFDINGBATS_NUMBER, indicates the numbering style.
fr_fr: <literal>numberType</literal> &#8212; Pour le style ZAPFDINGBATS_NUMBER, indique le style de numérotation.

source: <literal>p:listItem</literal> supports the following attributes:
fr_fr: <literal>p:listItem</literal> dispose des attributs suivant:

source: <literal>alignment</literal> &#8212; The alignment of the list item. (See <xref linkend="itext.alignment"/> for possible values)
fr_fr: <literal>alignment</literal> &#8212; L'alignement de l'élément de la liste. (Voir <xref linkend="itext.alignment"/> pour les valeurs possibles)

source: <literal>indentationLeft</literal> &#8212; The left indentation amount.
fr_fr: <literal>indentationLeft</literal> &#8212; La quantité d'indentation à gauche.

source: <literal>indentationRight</literal> &#8212; The right indentation amount.
fr_fr: <literal>indentationRight</literal> &#8212; La quantité d'indentation à droite.

source: <literal>listSymbol</literal> &#8212; Overrides the default list symbol for this list item.
fr_fr: <literal>listSymbol</literal> &#8212; Remplace le symbole de la liste par défaut pour cet élement de la liste.

source: Tables
fr_fr: Les tableaux

source: Table structures can be created using the <literal>p:table</literal> and <literal>p:cell</literal> tags. Unlike many table structures, there is no explicit row declaration. If a table has 3 columns, then every 3 cells will automatically form a row. Header and footer rows can be declared, and the headers and footers will be repeated in the event a table structure spans multiple pages.
fr_fr: Les structures d'un tableau peuvent être créés en uutilisant les balises <literal>p:table</literal> et <literal>p:cell</literal>. A l'inverse de beaucoup de structures de tableaux, il n'y a pas de déclaration explicite de ligne. Si un tableau a 3 colonnes, alors chacune des trois cellules devront automatiquement former une ligne. Les lignes d'entêtes et de pieds de pages peuvent être déclarées et seront répétées dans le cas ou la structure du tableau s'étallerait sur plusieurs pages.

source: <literal>p:table</literal> supports the following attributes.
fr_fr: <literal>p:table</literal> dispose des attributs suivants.

source: <literal>columns</literal> &#8212; The number of columns (cells) that make up a table row.
fr_fr: <literal>columns</literal> &#8212; Le nombre de colonnes (cellules) qui font une ligne de tableau.

source: <literal>widths</literal> &#8212; The relative widths of each column. There should be one value for each column. For example: widths="2 1 1" would indicate that there are 3 columns and the first column should be twice the size of the second and third column.
fr_fr: <literal>widths</literal> &#8212; La largeur relative de chaque colonne. Il faudrait une valeur pour chacune des colonnes. Par exemple: widths="2 1 1" devrait indiquer qu'il y a 3 colonnes, et que la première colonne devrait être deux fois plus grande que la seconde et la troisième.

source: <literal>headerRows</literal> &#8212; The initial number of rows which are considered to be headers or footer rows and should be repeated if the table spans multiple pages.
fr_fr: <literal>headerRows</literal> &#8212; Le nombre initial de ligne qui seront considérés comme des lignes d'entêtes ou des bas de tableau et devrait être répétés si le tableau s'étalle sur plusieurs pages.

source: <literal>footerRows</literal> &#8212; The number of rows that are considered to be footer rows. This value is subtracted from the <literal>headerRows</literal> value. If document has 2 rows which make up the header and one row that makes up the footer, <literal>headerRows</literal> should be set to 3 and <literal>footerRows</literal> should be set to 1
fr_fr: <literal>footerRows</literal> &#8212; Le nombre de ligne qui sont à considérées comme des lignes de bas de tableaux. Cette valeur est soustraite de la valeur<literal>headerRows</literal>. Si le document a 2 lignes qui constituent un entête et une ligne qui constitut le bas du tableau, <literal>headerRows</literal> devrait être défini à 3 et <literal>footerRows</literal> devrait être définie à 1

source: <literal>widthPercentage</literal> &#8212; The percentage of the page width that the table spans.
fr_fr: <literal>widthPercentage</literal> &#8212; Le pourcentage de la largeur de page que le tableau occupe.

source: <literal>horizontalAlignment</literal> &#8212; The horizontal alignment of the table. (See <xref linkend="itext.alignment"/> for possible values)
fr_fr: <literal>horizontalAlignment</literal> &#8212; L'alignement horizontal du tableau. (Voir <xref linkend="itext.alignment"/> pour les valeurs possibles)

source: <literal>p:cell</literal> supports the following attributes.
fr_fr: <literal>p:cell</literal> dispose des attributs suivants.

source: <literal>colspan</literal> &#8212; Cells can span more than one column by declaring a <literal>colspan</literal> greater than 1. Tables do not have the ability to span across multiple rows.
fr_fr: <literal>colspan</literal> &#8212; Les cellules peuvent s'étendre sur plus d'une colonne en déclarant un <literal>colspan</literal> suppérieur à 1. Les tableaux ne n'ont pas la possibilité de s'étendre sur plusieurs lignes.

source: <literal>horizontalAlignment</literal> &#8212; The horizontal alignment of the cell. (see <xref linkend="itext.alignment"/> for possible values)
fr_fr: <literal>horizontalAlignment</literal> &#8212; L'alignement horizontal de la cellule. (voir <xref linkend="itext.alignment"/> pour les valeurs possibles)

source: <literal>verticalAlignment</literal> &#8212; The vertical alignment of the cell. (see <xref linkend="itext.alignment"/> for possible values)
fr_fr: <literal>verticalAlignment</literal> &#8212; L'alignement vertical de la cellule. (voir <xref linkend="itext.alignment"/> pour les valeurs possibles)

source: <literal>padding</literal> &#8212; Padding on a given side can also be specified using <literal>paddingLeft</literal>, <literal>paddingRight</literal>, <literal>paddingTop</literal> and <literal>paddingBottom</literal>.
fr_fr: <literal>padding</literal> &#8212; L'encadrement d'un côté donné peut être spécifiés en utilisant <literal>paddingLeft</literal>, <literal>paddingRight</literal>, <literal>paddingTop</literal> et <literal>paddingBottom</literal>.

source: Document Constants
fr_fr: Les constantes du document

source: This section documents some of the constants shared by attributes on multiple tags.
fr_fr: Cette section documente quelques unes des constantes partagées par de multiples balises.

source: Color Values
fr_fr: Les valeurs des couleurs

source: Several ways of specifying colors are provided. A limited number of colors are supported by name. They are: <literal>white</literal>, <literal>gray</literal>, <literal>lightgray</literal>, <literal>darkgray</literal>, <literal>black</literal>, <literal>red</literal>, <literal>pink</literal>, <literal>yellow</literal>, <literal>green</literal>, <literal>magenta</literal>, <literal>cyan</literal> and <literal>blue</literal>. Colors can be specified as an integer value, as definied by <literal>java.awt.Color</literal>. Finally a color value may be specified as <literal>rgb(r,g,b)</literal> or <literal>rgb(r,g,b,a)</literal> with the red, green, blue alpha values specified as an integer between 0 and 255 or as a floating point percentages followed by a '%' sign.
fr_fr: Plusieurs façons de spécifier les coleurs sont proposées. Un nombre limité de couleurs sont disponibles par leur nom. Il y a : <literal>white</literal>, <literal>gray</literal>, <literal>lightgray</literal>, <literal>darkgray</literal>, <literal>black</literal>, <literal>red</literal>, <literal>pink</literal>, <literal>yellow</literal>, <literal>green</literal>, <literal>magenta</literal>, <literal>cyan</literal> et <literal>blue</literal>. Les couleurs peuvent être" spécifiées comme une valeur intière, tout comme défini par <literal>java.awt.Color</literal>. Enfin, une valeur de couleur peut être spécifiée par <literal>rgb(r,g,b)</literal> ou <literal>rgb(r,g,b,a)</literal> avec les valeurs de rouge, vert, blue et alpha indiqué par un entier entre 0 et 255 ou comme un pourcentage avec un nombre à virgule suivi du signe '%'.

source: Alignment Values
fr_fr: Les valeurs des aignments

source: Where alignment values are used, the Seam PDF supports the following horizontal alignment values: <literal>left</literal>, <literal>right</literal>, <literal>center</literal>, <literal>justify</literal> and <literal>justifyall</literal>. The vertical alignment values are <literal>top</literal>, <literal>middle</literal>, <literal>bottom</literal>, and <literal>baseline</literal>.
fr_fr: Quand les valeurs des alignements sont utilisées, le PDF de Seam permet d'avoir les valeurs d'alignement horizontales suivants: <literal>left</literal>, <literal>right</literal>, <literal>center</literal>, <literal>justify</literal> et <literal>justifyall</literal>. Les valeurs d'alignement verticales sont <literal>top</literal>, <literal>middle</literal>, <literal>bottom</literal>, et <literal>baseline</literal>.

source: Charting
fr_fr: Diagrammes

source: Charting support is also provided with <literal>jboss-seam-pdf.jar</literal>. Charts can be used in PDF documents or can be used as images in an HTML page. Charting requires the JFreeChart library (<literal>jfreechart.jar</literal> and <literal>jcommon.jar</literal>) to be added to the <literal>WEB-INF/lib</literal> directory. Four types of charts are currently supported: pie charts, bar charts and line charts. Where greater variety or control is needed, it is possible to construct charts using Java code.
fr_fr: Le support des diagrammes est aussi fourni avec <literal>jboss-seam-pdf.jar</literal>. Les diagrammes peuvent être utilisé dans des documents PDF pi peuvent être utilisés comme des images dans une page HTML. Faire des diagrammes nécéssite que la bibliothèque JFreeChart (<literal>jfreechart.jar</literal> et<literal>jcommon.jar</literal>) soit ajouté au dossier <literal>WEB-INF/lib</literal>. Quatres types de diagrammes sont actuellement diponibles: diagramme en camenbert, diagramme en baton et diagramme avec des courbes. Avec beaucoup de variantes ou de controles selon les besoin, il est possible de contruire des diagrammes en utilisant du code Java.

source: Displays a chart created in Java by a Seam component.
fr_fr: L'affichage d'une diagramme créé en Java par un composant de Seam.

source: <literal>chart</literal> &#8212; The chart object to display.
fr_fr: <literal>chart</literal> &#8212; L'objet diagramme à afficher.

source: <literal>height</literal> &#8212; The height of the chart.
fr_fr: <literal>height</literal> &#8212; La hauteur du diagramme.

source: <literal>width</literal> &#8212; The width of the chart.
fr_fr: <literal>width</literal> &#8212; La largeur du diagramme.

source: Displays a bar chart.
fr_fr: L'affichage d'une diagramme en baton.

source: <literal>chart</literal> &#8212; The chart object to display, if programmatic chart creation is being used.
fr_fr: <literal>chart</literal> &#8212; L'objet diagramme à afficher, si la création du diagramme via la programmation est utilisée.

source: <literal>dataset</literal> &#8212; The dataset to be displayed, if programmatic dataset is being used.
fr_fr: <literal>dataset</literal> &#8212; Le groupe de données à afficher, si le groupe de données via la programmation est utilisé.

source: <literal>borderVisible</literal> &#8212; Controls whether or not a border is displayed around the entire chart.
fr_fr: <literal>borderVisible</literal> &#8212; Controle si oui ou non la bordure doit être affichée autour de tout le diagramme.

source: <literal>borderPaint</literal> &#8212; The color of the border, if visible;
fr_fr: <literal>borderPaint</literal> &#8212; La couleur de la bordure, si elle est visible;

source: <literal>borderBackgroundPaint</literal> &#8212; The default background color of the chart.
fr_fr: <literal>borderBackgroundPaint</literal> &#8212; La couleur d'arrière plan par défaut du diagramme.

source: <literal>domainAxisLabel</literal> &#8212; The text label for the domain axis.
fr_fr: <literal>domainAxisLabel</literal> &#8212; Le label du texte pour l'axe du domaine.

source: <literal>domainLabelPosition</literal> &#8212; The angle of the domain axis category labels. Valid values are <literal>STANDARD</literal>, <literal>UP_45</literal>, <literal>UP_90</literal>, <literal>DOWN_45</literal> and <literal>DOWN_90</literal>. Alternatively, the value can the positive or negative angle in radians.
fr_fr: <literal>domainLabelPosition</literal> &#8212; L'angle pour les labels de categorie de l'axe du domaine. les valeurs valident sont <literal>STANDARD</literal>, <literal>UP_45</literal>, <literal>UP_90</literal>, <literal>DOWN_45</literal> et <literal>DOWN_90</literal>. Autrement, la valeur peut être une valeur dangle postive ou négative en radians.

source: <literal>domainAxisPaint</literal> &#8212; The color of the domain axis label.
fr_fr: <literal>domainAxisPaint</literal> &#8212; La couleur du label de l'axe du domaine.

source: <literal>domainGridlinesVisible</literal>&#8212; Controls whether or not gridlines for the domain axis are shown on the chart.
fr_fr: <literal>domainGridlinesVisible</literal>&#8212; Les contrôles que les lignes d'arrière plan pour les axes du domaines soient visibles ou non dans le diagramme.

source: <literal>domainGridlinePaint</literal>&#8212; The color of the domain gridlines, if visible.
fr_fr: <literal>domainGridlinePaint</literal>&#8212; La couleur des lignes d'arrière plan, si visible.

source: <literal>domainGridlineStroke</literal> &#8212; The stroke style of the domain gridlines, if visible.
fr_fr: <literal>domainGridlineStroke</literal> &#8212; Le style de ligne pour les lignes d'arrière plan du domaine, si visible.

source: <literal>is3D</literal> &#8212; A boolean value indicating that the chart should be rendered in 3D instead of 2D.
fr_fr: <literal>is3D</literal> &#8212; Une valeur booléenne indiquant qe le diagramme devrait être rendu en 3D au lieu d'être en 2D.

source: <literal>legend</literal> &#8212; A boolean value indicating whether or not the chart should include a legend.
fr_fr: <literal>legend</literal> &#8212; Une valeur booléenne indiquant s'il faut ou non que le diagramme doit inclure une legende.

source: <literal>legendItemPaint</literal>&#8212; The default color of the text labels in the legend.
fr_fr: <literal>legendItemPaint</literal>&#8212; La couleur par défaut pour les labels de texte dans la légende.

source: <literal>legendItemBackgoundPaint</literal>&#8212; The background color for the legend, if different from the chart background color.
fr_fr: <literal>legendItemBackgoundPaint</literal>&#8212; La couleur d'arrière plan pour la légende, si différente de la couleur d'arrière plan du diagramme.

source: <literal>legendOutlinePaint</literal>&#8212; The color of the border around the legend.
fr_fr: <literal>legendOutlinePaint</literal>&#8212; La couleur de la bordure autour de la légende.

source: <literal>orientation</literal> &#8212; The orientation of the plot, either <code>vertical</code> (the default) or <code>horizontal</code>.
fr_fr: <literal>orientation</literal> &#8212; L'orientation du point , soit <code>vertical</code> (par défaut) ou <code>horizontal</code>.

source: <literal>plotBackgroundPaint</literal>&#8212; The color of the plot background.
fr_fr: <literal>plotBackgroundPaint</literal>&#8212; La couleur de l'arrière plan du point.

source: <literal>plotBackgroundAlpha</literal>&#8212; The alpha (transparency) level of the plot background. It should be a number between 0 (completely transparent) and 1 (completely opaque).
fr_fr: <literal>plotBackgroundAlpha</literal>&#8212; Le niveau alpha (transparence) de l'arrière plan du point. Il devrait être entre 0 (complètement transparant) et 1 (complètement opaque).

source: <literal>plotForegroundAlpha</literal>&#8212; The alpha (transparency) level of the plot. It should be a number between 0 (completely transparent) and 1 (completely opaque).
fr_fr: <literal>plotForegroundAlpha</literal>&#8212; Le niveau alpha (transparence) du point. Il devrait être entre 0 (complètement transparant) et 1 (complètement opaque).

source: <literal>plotOutlinePaint</literal>&#8212; The color of the range gridlines, if visible.
fr_fr: <literal>plotOutlinePaint</literal>&#8212; La couleur du dégradé des lignes de grilles d'arrière plan, si visible.

source: <literal>plotOutlineStroke</literal> &#8212; The stroke style of the range gridlines, if visible.
fr_fr: <literal>plotOutlineStroke</literal> &#8212; Le style de trait pour le dégradé des lignes de grilles d'arrière plan, si visible.

source: <literal>rangeAxisLabel</literal> &#8212; The text label for the range axis.
fr_fr: <literal>rangeAxisLabel</literal> &#8212; Le label du texte de l'axe vertical .

source: <literal>rangeAxisPaint</literal> &#8212; The color of the range axis label.
fr_fr: <literal>rangeAxisPaint</literal> &#8212; La couleur du label de l'axe vertical.

source: <literal>rangeGridlinesVisible</literal>&#8212; Controls whether or not gridlines for the range axis are shown on the chart.
fr_fr: <literal>rangeGridlinesVisible</literal>&#8212; Controle si les lignes de grilles darrière plan sont visibles ou non dans le diagramme.

source: <literal>rangeGridlinePaint</literal>&#8212; The color of the range gridlines, if visible.
fr_fr: <literal>rangeGridlinePaint</literal>&#8212; La couleur des lignes de grille d'arrière plan verticales, si visibles.

source: <literal>rangeGridlineStroke</literal> &#8212; The stroke style of the range gridlines, if visible.
fr_fr: <literal>rangeGridlineStroke</literal> &#8212; La style de lignes pour les lignes d'arrières plan verticales, si visible.

source: <literal>title</literal> &#8212; The chart title text.
fr_fr: <literal>title</literal> &#8212; Le texte du titre du diagramme.

source: <literal>titlePaint</literal>&#8212; The color of the chart title text.
fr_fr: <literal>titlePaint</literal>&#8212; La couleur du texte du titre du diagramme.

source: <literal>titleBackgroundPaint</literal>&#8212; The background color around the chart title.
fr_fr: <literal>titleBackgroundPaint</literal>&#8212; La couleur d'arrière plan autour du titre du diagramme.

source: Displays a line chart.
fr_fr: Affichage d'une diagramme avec des courbes.

source: <literal>legendItemPaint</literal> &#8212; The default color of the text labels in the legend.
fr_fr: <literal>legendItemPaint</literal> &#8212; La couleur par défaut pour les labels de texte dans la légende.

source: <literal>legendItemBackgoundPaint</literal> &#8212; The background color for the legend, if different from the chart background color.
fr_fr: <literal>legendItemBackgoundPaint</literal> &#8212; La couleur d'arrière plan pour la légende, si différent de la couleur d'arrière plan du diagramme.

source: <literal>legendOutlinePaint</literal> &#8212; The color of the border around the legend.
fr_fr: <literal>legendOutlinePaint</literal> &#8212; La couleur de la bordure autour de la légende.

source: <literal>plotBackgroundPaint</literal> &#8212; The color of the plot background.
fr_fr: <literal>plotBackgroundPaint</literal> &#8212; La couleur de l'arrière plan du point.

source: <literal>plotBackgroundAlpha</literal> &#8212; The alpha (transparency) level of the plot background. It should be a number between 0 (completely transparent) and 1 (completely opaque).
fr_fr: <literal>plotBackgroundAlpha</literal> &#8212; Le niveau alpha (transparence) pour l'arrière plan du point. Il devrait être un nombre entre 0 (complètement transparant) et 1 (complètement opaque).

source: <literal>plotForegroundAlpha</literal> &#8212; The alpha (transparency) level of the plot. It should be a number between 0 (completely transparent) and 1 (completely opaque).
fr_fr: <literal>plotForegroundAlpha</literal> &#8212; Le niveau alpha (transparent) du point. Il devrait être un nombre entre 0 (complètement transparant) et 1 (complètement opaque).

source: <literal>plotOutlinePaint</literal> &#8212; The color of the range gridlines, if visible.
fr_fr: <literal>plotOutlinePaint</literal> &#8212; La couleur des lignes de grilles d'arrièreplans verticales, si visible.

source: <literal>rangeGridlinesVisible</literal> &#8212; Controls whether or not gridlines for the range axis are shown on the chart.
fr_fr: <literal>rangeGridlinesVisible</literal> &#8212; Controle si les lignes d'arrière plans pour l'axe vertical doivent être visibles sur le diagramme.

source: <literal>rangeGridlinePaint</literal> &#8212; The color of the range gridlines, if visible.
fr_fr: <literal>rangeGridlinePaint</literal> &#8212; La couleur des lignes d'arrière plan, si visible.

source: <literal>titlePaint</literal> &#8212; The color of the chart title text.
fr_fr: <literal>titlePaint</literal> &#8212; La couleur du texte du titre du diagramme.

source: <literal>titleBackgroundPaint</literal> &#8212; The background color around the chart title.
fr_fr: <literal>titleBackgroundPaint</literal> &#8212; La couleur d'arrière plan aaout du titre du diagramme.

source: Displays a pie chart.
fr_fr: Affichage d'un diagramme en cammenbert.

source: <literal>label</literal> &#8212; The default label text for pie sections.
fr_fr: <literal>label</literal> &#8212; Le texte du label par défaut pour les sections de camembert.

source: <literal>legend</literal> &#8212; A boolean value indicating whether or not the chart should include a legend. Default value is true
fr_fr: <literal>legend</literal> &#8212; Une valeur booléenne indiquant si le diagramme devrait inclure une legende ou pas. Par défaut la valeur est à vrai.

source: <literal>is3D</literal> &#8212;A boolean value indicating that the chart should be rendered in 3D instead of 2D.
fr_fr: <literal>is3D</literal> &#8212;Une valeur booléenne indiquant que le diagramme devrait êtrere rendue en 3D au lieu d'en 2D.

source: <literal>labelLinkMargin</literal> &#8212; The link margin for labels.
fr_fr: <literal>labelLinkMargin</literal> &#8212; La marge de lien pour les labels.

source: <literal>labelLinkPaint</literal> &#8212; The paint used for the label linking lines.
fr_fr: <literal>labelLinkPaint</literal> &#8212; La couleur utilisé pour les lignes de liens des labels.

source: <literal>labelLinkStroke</literal> &#8212; he stroke used for the label linking lines.
fr_fr: <literal>labelLinkStroke</literal> &#8212; le type de bordure utilisé pour les lignes liant les labels.

source: <literal>labelLinksVisible</literal> &#8212; A flag that controls whether or not the label links are drawn.
fr_fr: <literal>labelLinksVisible</literal> &#8212; Un drapeau qui controle si les liens vers les labels sont déssinés.

source: <literal>labelOutlinePaint</literal> &#8212; The paint used to draw the outline of the section labels.
fr_fr: <literal>labelOutlinePaint</literal> &#8212; La couleur utilisé pour déssiner les bordure des labels de sections.

source: <literal>labelOutlineStroke</literal> &#8212; The stroke used to draw the outline of the section labels.
fr_fr: <literal>labelOutlineStroke</literal> &#8212; Le type de bordure utilisé pour dessiner les bordures des labels des sections.

source: <literal>labelShadowPaint</literal> &#8212; The paint used to draw the shadow for the section labels.
fr_fr: <literal>labelShadowPaint</literal> &#8212; La couleur utilisée pour dessiner l'ombrée sur les labels des sections.
