Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Mail.po
Languages: it_it, ja_jp

source: Seam now includes an optional components for templating and sending emails.
it_it: Seam include ora dei componenti opzionali per modellare e spedire le email.
ja_jp: Seam には 電子メールの送信およびテンプレート作成用のオプションコンポーネントが含まれるようになります。

source: Email support is provided by <literal>jboss-seam-mail.jar</literal>. This JAR contains the mail JSF controls, which are used to construct emails, and the <literal>mailSession</literal> manager component.
it_it: Il supporto email è fornito da <literal>jboss-seam-mail.jar</literal>. Questo JAR contiene i controlli JSF per la mail, che vengono impiegati per costruire le email, ed il componente manager <literal>mailSession</literal>.
ja_jp: 電子メールのサポートは <literal>jboss-seam-mail.jar</literal> により提供されます。 この JAR にはメールの作成に使用されるメール JSF コントロールおよび <literal>mailSession</literal> 管理コンポーネントが含まれます。

source: The examples/mail project contains an example of the email support in action. It demonstrates proper packaging, and it contains a number of example that demonstrate the key features currently supported.
it_it: Il progetto examples/mail contiene un esempio di supporto email in azione. Mostra un pacchetto idoneo e contiene esempi che mostrano le funzionalità chiave attualmente supportate.
ja_jp: examples/mail プロジェクトには実行可能なデモ用電子メールサポートのサンプルが含まれています。 正しいパッケージングの方法を行い、 また現在サポートされている主要な機能を実際に示すサンプルがいくつか含まれています。

source: You can also test your mail's using Seam's integration testing environment. See <xref linkend="testing.mail"/>.
it_it: Si può testare la propria mail usando l'ambiente di test di Seam. Si veda <xref linkend="testing.mail"/>.
ja_jp: Seamの統合テスト環境で電子メールの動作をテストする事ができます。 <xref linkend="testing.mail"/>参照

source: Creating a message
it_it: Creare un messaggio
ja_jp: メッセージを作成する

source: You don't need to learn a whole new templating language to use Seam Mail &#8212; an email is just facelet!
it_it: Non occorre imparare un nuovo linguaggio di template per usare Seam Mail &#8212; un'email è semplicemente un facelet!
ja_jp: Seamの電子メール機能はFaceletsを利用して記述しているので、新たなテンプレート用の言語を学ぶ必要はありません。

source: The <literal>&lt;m:message&gt;</literal> tag wraps the whole message, and tells Seam to start rendering an email. Inside the <literal>&lt;m:message&gt;</literal> tag we use an <literal>&lt;m:from&gt;</literal> tag to set who the message is from, a <literal>&lt;m:to&gt;</literal> tag to specify a sender (notice how we use EL as we would in a normal facelet), and a <literal>&lt;m:subject&gt;</literal> tag.
it_it: Il tag <literal>&lt;m:message&gt;</literal> racchiude l'intero messaggio e dice a Seam di iniziare a generare la mail. Dentro al tag <literal>&lt;m:message&gt;</literal> si usa un tag <literal>&lt;m:from&gt;</literal> per impostare il mittente, un tag <literal>&lt;m:to&gt;</literal> per specificare un destinatario (si noti che EL viene impiegato come in un facelet normale), e un tag <literal>&lt;m:subject&gt;</literal>.
ja_jp: <literal>&lt;m:message&gt;</literal> タグはメッセージ全体を包み、 Seam に email のレンダリングを開始するよう指示します。 <literal>&lt;m:message&gt;</literal> タグ内では、 メッセージの送信元の設定に <literal>&lt;m:from&gt;</literal> タグ、 送信者の指定に <literal>&lt;m:to&gt;</literal> タグ (通常のFacelets 内にあるのでそれに応じた EL の使用方法に注意してください)、 また <literal>&lt;m:subject&gt;</literal> タグを使用します。

source: The <literal>&lt;m:body&gt;</literal> tag wraps the body of the email. You can use regular HTML tags inside the body as well as JSF components.
it_it: Il tag <literal>&lt;m:body&gt;</literal> racchiude il corpo della mail. Si possono usare tag HTML dentro il corpo così come componenti JSF.
ja_jp: <literal>&lt;m:body&gt;</literal> は email のボディを囲みます。 HTML 正規タグをボディ内や JSF コンポーネント内に使用することができます。

source: So, now you have your email template, how do you go about sending it? Well, at the end of rendering the <literal>m:message</literal> the <literal>mailSession</literal> is called to send the email, so all you have to do is ask Seam to render the view:
it_it: Adesso che si ha un modello di email, come lo si spedisce? Alla fine della generazione di <literal>m:message</literal> viene chiamato <literal>mailSession</literal> per spedire l'email, e quindi semplicemente occorre chiedere a Seam di generare la vista:
ja_jp: これで電子メールテンプレートのできあがりです。 送信方法についてですが、 <literal>m:message</literal> のレンダリングの最後に、 <literal>mailSession</literal> が email を送信するようコールされるので、 ユーザーがすべきことは Seam にそのビューをレンダリングするよう指示するだけです。

source: If, for example, you entered an invalid email address, then an exception would be thrown, which is caught and then displayed to the user.
it_it: Per esempio, se si digita un indirizzo email non valido, allora viene lanciata un'eccezione che viene catturata e quindi mostrata all'utente.
ja_jp: たとえば、 無効な電子メールアドレスを入力すると例外が投げられ、 その例外がキャッチされてユーザーに表示されます。

source: Attachments
it_it: Allegati
ja_jp: 添付ファイル

source: Seam makes it easy to attach files to an email. It supports most of the standard java types used when working with files.
it_it: Seam semplifica l'uso degli allegati ad una mail. Supporta la maggior parte dei tipi java standard usati con i file.
ja_jp: Seam では電子メールへのファイル添付が容易になっています。 ファイルを操作する際に使用される標準 java タイプのほとんどに対応しています。

source: If you wanted to email the <literal>jboss-seam-mail.jar</literal>:
it_it: Se si vuole spedire <literal>jboss-seam-mail.jar</literal>:
ja_jp: <literal>jboss-seam-mail.jar</literal> に電子メール 送信をしたい場合、

source: Seam will load the file from the classpath, and attach it to the email. By default it would be attached as <literal>jboss-seam-mail.jar</literal>; if you wanted it to have another name you would just add the <literal>fileName</literal> attribute:
it_it: Seam caricherà il file dal classpath e lo allegherà alla mail. Di default verrà allegato come <literal>jboss-seam-mail.jar</literal>; se si vuole avere un altro nome basta aggiungere l'attributo <literal>fileName</literal>:
ja_jp: Seam はファイルをクラスパスからロードして、 電子メールにそのファイルを添付します。 デフォルトでは、 <literal>jboss-seam-mail.jar</literal> という名前で添付されます。 別の名前にしたい場合は <literal>fileName</literal> 属性を追加するだけです。

source: You could also attach a <literal>java.io.File</literal>, a <literal>java.net.URL</literal>:
it_it: Si può anche allegare un <literal>java.io.File</literal>, un <literal>java.net.URL</literal>:
ja_jp: <literal>java.io.File</literal>, <literal>java.net.URL</literal> を添付することもできます。

source: Or a <literal>byte[]</literal> or a <literal>java.io.InputStream</literal>:
it_it: Oppure un <literal>byte[]</literal> o un <literal>java.io.InputStream</literal>:
ja_jp: または、 <literal>byte[]</literal> あるいは <literal>java.io.InputStream</literal>

source: You'll notice that for a <literal>byte[]</literal> and a <literal>java.io.InputStream</literal> you need to specify the MIME type of the attachment (as that information is not carried as part of the file).
it_it: Si noterà che per <literal>byte[]</literal> e <literal>java.io.InputStream</literal> occorrerà specificare il tipo MIME dell'allegato (poiché quest'informazione non viene trasportata come parte del file).
ja_jp: コード例から、<literal>byte[]</literal>や<literal>java.io.InputStream</literal>を使うためには、添付ファイルのMIMEタイプを指定する必要があることが分かると思います。

source: And it gets even better, you can attach a Seam generated PDF, or any standard JSF view, just by wrapping a <literal>&lt;m:attachment&gt;</literal> around the normal tags you would use:
it_it: Ancora meglio si può allegare un PDF generato da Seam, o ogni altra vista JSF standard, semplicemente mettendo un <literal>&lt;m:attachment&gt;</literal> attorno ai normali tag:
ja_jp: さらに便利なことに、 使用する通常のタグの前後を <literal>&lt;m:attachment&gt;</literal> で囲むだけで Seam 生成 PDF や標準 JSF ビュー を添付することができます。

source: If you had a set of files you wanted to attach (for example a set of pictures loaded from a database) you can just use a <literal>&lt;ui:repeat&gt;</literal>:
it_it: Con un set di file da allegare (per esempio un gruppo di fotografie caricate da un database) si utilizza un <literal>&lt;ui:repeat&gt;</literal>:
ja_jp: 添付したいファイル一式が手元にある場合 (例、 データベースからロードした写真一式)、 <literal>&lt;ui:repeat&gt;</literal> を使うだけで添付できます。

source: And if you want to display an attached image inline:
it_it: E se si vuole mostrare un'immagine allegata inline:
ja_jp: また、添付のイメージファイルをインラインで表示したい場合には

source: You may be wondering what <literal>cid:#{...}</literal> does. Well, the IETF specified that by putting this as the src for your image, the attachments will be looked at when trying to locate the image (the <literal>Content-ID</literal>'s must match) &#8212; magic!
it_it: Ci si potrebbe chiedere a cosa serva <literal>cid:#{...}</literal>. IETF specifica che mettendo questo come src dell'immagine, verranno visualizzati gli allegati quando si tenta di localizzare l'immagine (il <literal>Content-ID</literal> deve corrispondere) &#8212; magia!
ja_jp: <literal>cid:#{...}</literal>が何をするのか疑問に思わるかもしれませんが、IETFの規則によればイメージファイルのソースにこれを指定すれば、イメージを見ようとすると添付ファイルを参照する（但し、<literal>Content-ID</literal>が一致している必要があります）とあります。

source: You must declare the attachment before trying to access the status object.
it_it: Occorre dichiarare l'allegato prima di tentare di accedere allo stato dell'oggetto.
ja_jp: "status"で指定したオブジェクトにアクセスする前に、添付することをを宣言しなければいけません。

source: Whilst most mail readers nowadays support HTML, some don't, so you can add a plain text alternative to your email body:
it_it: Nonostante la maggior parte dei lettori email oggi supportino HTML, alcuni non lo fanno, quindi è possibile aggiungere un'alternativa di puro testo al corpo della mail:
ja_jp: 現在ではほとんどのメールリーダーがHTMLをサポートしていますが、一部でサポートしていないメールリーダーもありますので、メール本体にプレーンなテキストを追加する事もできます。

source: Multiple recipients
it_it: Destinatari multipli
ja_jp: 複数の受信者

source: Often you'll want to send an email to a group of recipients (for example your users). All of the recipient mail tags can be placed inside a <literal>&lt;ui:repeat&gt;</literal>:
it_it: Spesso si vuole spedire una mail ad un gruppo di destinatari (per esempio i propri utenti). Tutti i tag dei destinatari possono essere messi dentro un <literal>&lt;ui:repeat&gt;</literal>:
ja_jp: 複数の受信者が属するグループに対して電子メールを送信したい場合には、すべての受信者のメールタグを繰り返しタグ<literal>&lt;ui:repeat&gt;</literal>の中に置くことができます。

source: Multiple messages
it_it: Messaggi multipli
ja_jp: 複数のメッセージ

source: Sometimes, however, you need to send a slightly different message to each recipient (e.g. a password reset). The best way to do this is to place the whole message inside a <literal>&lt;ui:repeat&gt;</literal>:
it_it: A volte, comunque, occorre spedire un messaggio leggermente diverso a ciascun utente (es. una password resettata). Il miglior modo per farlo è mettere l'interno messaggio dentro un <literal>&lt;ui:repeat&gt;</literal>:
ja_jp: ただし、 若干異なる内容のメッセージを各受信者に送信する必要がある場合もあります (パスワードのリセットなど)。 最適な方法としては、 メッセージ全体を <literal>&lt;ui:repeat&gt;</literal> 内に配置することです。

source: Templating
it_it: Comporre template
ja_jp: テンプレートの作成

source: The mail templating example shows that facelets templating just works with the Seam mail tags.
it_it: L'esempio mail templating mostra che il templating facelets funziona solo con i tag mail di Seam.

source: Our <literal>template.xhtml</literal> contains:
it_it: <literal>template.xhtml</literal> contiene:
ja_jp: jboss.org の <literal>template.xhtml</literal> には次の内容が含まれています。

source: Our <literal>templating.xhtml</literal> contains:
it_it: <literal>templating.xhtml</literal> contiene:
ja_jp: jboss.org の <literal>templating.xhtml</literal> には次の内容が含まれています。

source: You can also use facelets source tags in your email, but you must place them in a jar in <literal>WEB-INF/lib</literal> - referencing the <literal>.taglib.xml</literal> from <literal>web.xml</literal> isn't reliable when using Seam Mail (if you send your mail asynchrounously Seam Mail doesn't have access to the full JSF or Servlet context, and so doesn't know about <literal>web.xml</literal> configuration parameters).
it_it: Si possono usare anche i tag sorgente di facelets nella propria email, ma occorre metterli in un jar dentro <literal>WEB-INF/lib</literal> - fare riferimento a <literal>.taglib.xml</literal> da <literal>web.xml</literal> non è molto affidabile quando si usa Seam Mail (se si spedisce la mail in modo asincrono Seam Mail non ha accesso all'intero contesto JSF o Servlet, e quindi non conosce i parametri di configurazione di <literal>web.xml</literal>).
ja_jp: <literal>WEB-INF/lib</literal>にjarファイルを入れて置く事によりFaceletsのソースタグもメールの中で使う事ができます。 Seamのメールでは<literal>web.xml</literal>から<literal>.taglib.xml</literal>を参照する方法は安定性を欠いています（非同期でメールを送信する場合、SeamメールはJSFあるいはサーブレットのコンテキストすべてにアクセスするわけではないので、 <literal>web.xml</literal>の設定パラメータを認識しません）。

source: If you do need more configure Facelets or JSF when sending mail, you'll need to override the Renderer component and do the configuration programmatically - only for advanced users!
it_it: Se occorre configurare Facelets o JSF per spedire mail, servirà eseguire l'override del componente Renderer e configurarlo programmaticamente - solo per utenti avanzati!
ja_jp: メール送信時にFaceletsやJSFの設定をさらにしておきたい場合には、レンダラーコンポーネントをオーバーライドして、プログラムで設定するようにします。－上級ユーザー用。

source: Internationalisation
it_it: Internazionalizzazione
ja_jp: 国際化

source: Seam supports sending internationalised messages. By default, the encoding provided by JSF is used, but this can be overridden on the template:
it_it: Seam supporta l'invio di messaggi internazionalizzati. Di default, viene usata la codifica fornita da JSF, ma questa può essere sovrascritta nel template:
ja_jp: Seam は国際化メッセージの送信に対応しています。 デフォルトでは、 JSF で提供されるエンコーディングが使用されますが、 テンプレートで上書きすることができます。

source: The body, subject and recipient (and from) name will be encoded. You'll need to make sure facelets uses the correct charset for parsing your pages by setting encoding of the template:
it_it: Il corpo, soggetto e nome destinatario (e mittente) verranno codificati. Occorre assicurarsi che facelets usi il set di caratteri corretto per il parsing delle pagine, impostando la codifica del template:
ja_jp: 本文、タイトルと受信者名はエンコードされます。 テンプレートのエンコーディングを設定して、Faceletsがメールを指定したページをパースする際に正しい文字セットを確実に指定する事が必要になります。

source: Other Headers
it_it: Altre intestazioni
ja_jp: その他のヘッダー

source: Sometimes you'll want to add other headers to your email. Seam provides support for some (see <xref linkend="mail.tags"/>). For example, we can set the importance of the email, and ask for a read receipt:
it_it: A volte si vogliono aggiungere altre intestazioni alla mail. Seam fornisce supporta per alcune di queste (si veda <xref linkend="mail.tags"/>). Per esempio, si può impostare l'importanza della mail e chiedere una conferma di lettura:
ja_jp: 場合により、前述以外のヘッダー情報を追加したい場合があると思いますが、Seamはこれらのいくつかをサポートしています（<xref linkend="mail.tags"/>参照）。 例として、メールの重要度の設定や、受信者の受取確認の要求等を設定する事ができます。

source: Otherwise you can add any header to the message using the <literal>&lt;m:header&gt;</literal> tag:
it_it: Altrimenti si può aggiunge una qualsiasi intestazione al messaggio usando il tag <literal>&lt;m:header&gt;</literal>:

source: Receiving emails
it_it: Ricevere email
ja_jp: 電子メールを受信する

source: If you are using EJB then you can use a MDB (Message Driven Bean) to receive email. JBoss provides a JCA adaptor &#8212; <literal>mail-ra.rar</literal> &#8212; but the version distributed with JBoss AS has a number of limitations (and isn't bundled in some versions) therefore we recommend using the <literal>mail-ra.rar</literal> distributed with Seam (it's in the <literal>extras/</literal> directory in the Seam bundle). <literal>mail-ra.rar</literal> should be placed in <literal>$JBOSS_HOME/server/default/deploy</literal>; if the version of JBoss AS you use already has this file, replace it.
it_it: Se si usa EJB, allora si può impiegare MDB (Message Driven Bean) per ricevere una mail. JBoss fornisce un adattatore JCA &#8212; <literal>mail-ra.rar</literal> &#8212; ma la versione distribuita con JBoss AS ha un numero di limitazioni (e non è incorporata in alcune versioni) quindi si raccomanda di usare <literal>mail-ra.rar</literal> distribuito con Seam (si trova nella directory <literal>extras/</literal> nella distribuzione Seam). <literal>mail-ra.rar</literal> deve essere messo in <literal>$JBOSS_HOME/server/default/deploy</literal>; se la versione di JBoss già lo contiene, lo si sostituisca.

source: You can configure it like this:
it_it: Lo si può configurare come:
ja_jp: 次のように設定することができます。

source: Each message received will cause <literal>onMessage(Message message)</literal> to be called. Most Seam annotations will work inside a MDB but you musn't access the persistence context.
it_it: Ogni messaggio ricevuto causerà una chiamata a <literal>onMessage(Message message)</literal>. La maggior parte delle annotazioni di Seam funzioneranno dentro MDB, ma non sarà possibile accedere al contesto di persistenza.
ja_jp: メッセージの受信の度に<literal>onMessage(Message message)</literal>が呼ばれています。 MDBの中ではほとんどのSeamのアノテーションを使用可能ですが、MDBの中でpersistence contextにアクセスしてはいけません。

source: You can find more information on <literal>mail-ra.rar</literal> at <ulink url="http://www.jboss.org/community/wiki/InboundJavaMail">http://www.jboss.org/community/wiki/InboundJavaMail</ulink>.
it_it: Si possono trovare maggiori informazioni su <literal>mail-ra.rar</literal> all'indirizzo <ulink url="http://www.jboss.org/community/wiki/InboundJavaMail">http://www.jboss.org/community/wiki/InboundJavaMail</ulink>.

source: If you aren't using JBoss AS you can still use <literal>mail-ra.rar</literal> or you may find your application server includes a similar adapter.
it_it: Se non si usa JBoss AS si può comunque usare <literal>mail-ra.rar</literal> oppure si cerchi se il proprio application server include un adattatore simile.
ja_jp: JBoss ASをアプリケーションサーバーとして使用していない場合にも、<literal>mail-ra.rar</literal>を使用する事はできますし、お使いのアプリケーションサーバーが同様の機能を提供しているはずです。

source: Configuration
it_it: Configurazione
ja_jp: 設定

source: To include Email support in your application, include <literal>jboss-seam-mail.jar</literal> in your <literal>WEB-INF/lib</literal> directory. If you are using JBoss AS there is no further configuration needed to use Seam's email support. Otherwise you need to make sure you have the JavaMail API, an implementation of the JavaMail API present (the API and impl used in JBoss AS are distributed with seam as <literal>lib/mail.jar</literal>), and a copy of the Java Activation Framework (distributed with Seam as <literal>lib/activation.jar</literal>.
it_it: Per includere il supporto email nella propria applicazione, si includa <literal>jboss-seam-mail.jar</literal> nella directory <literal>WEB-INF/lib</literal>. Se si usa JBoss AS non c'è nessuna configurazione ulteriore per usare il supporto email di Seam. Altrimenti occorre assicurarsi di avere JavaMail API, un'implementazione di JavaMail API presente (l'API e l'impl usate in JBoss AS sono distribuite con seam in <literal>lib/mail.jar</literal>), ed una copia di Java Activation Framework (distribuito con seam in <literal>lib/activation.jar</literal>.
ja_jp: Seamアプリケーションでメールサポートをする場合には、<literal>jboss-seam-mail.jar</literal>を<literal>WEB-INF/lib</literal>に配置してください。 JBoss ASをアプリケーションサーバーとして使用している場合には、Seamのメールサポートのためにこれ以上の設定は必要ありません。 JBoss AS以外を使用している場合には、JavaMailAPIがサポートされていること（JBoss ASで使用されるAPIとImplは<literal>lib/mail.jar</literal>としてSeamの配布ファイルに同梱されています）とJava Activation Frameworkのコピー（<literal>lib/activation.jar</literal>としてSeamの配布ファイルに同梱）が利用可能であることを確認してください。

source: The Seam Mail module requires the use of Facelets as the view technology. Future versions of the library may also support the use of JSP. Additionally, it requires the use of the seam-ui package.
it_it: Il modulo Seam Mail richiede l'uso di Facelets come tecnologia per la vista. Future versioni della libreria potranno supportare l'uso di JSP. In aggiunta si richiede l'uso del pacchetto seam-ui.

source: The <literal>mailSession</literal> component uses JavaMail to talk to a 'real' SMTP server.
it_it: Il componente <literal>mailSession</literal> usa JavaMail per dialogare con un server SMTP 'reale'.
ja_jp: <literal>mailSession</literal>コンポーネントはSMTPサーバと通信するときにJavaMailを使用しています。

source: A JavaMail Session may be available via a JNDI lookup if you are working in an JEE environment or you can use a Seam configured Session.
it_it: Una sessione JavaMail può essere disponibile via ricerca JNDI se si lavora in ambiente JEE o si può usare una sessione configurata da Seam.
ja_jp: JEE 環境で作業している、 または Seam 設定のSessionオブジェクトを使用できる場合、 JNDI ルックアップからjavaMailのSessionオブジェクトが使用できます。

source: The mailSession component's properties are described in more detail in <xref linkend="components.mail"/>.
it_it: Le proprietà del componente mailSession sono descritte con maggior dettaglio in <xref linkend="components.mail"/>.
ja_jp: mailSessionコンポーネントのプロパティの詳細は<xref linkend="components.mail"/>を参照してください。

source: The JBossAS <literal>deploy/mail-service.xml</literal> configures a JavaMail session binding into JNDI. The default service configuration will need altering for your network. <ulink url="http://www.jboss.org/community/wiki/JavaMail">http://www.jboss.org/community/wiki/JavaMail</ulink> describes the service in more detail.
it_it: <literal>deploy/mail-service.xml</literal> di JBoss AS configura una sessione JavaMail legandola a JNDI. La configurazione di default del servizio deve essere modificata per la propria rete. <ulink url="http://www.jboss.org/community/wiki/JavaMail">http://www.jboss.org/community/wiki/JavaMail</ulink> descrive il servizio con maggiore dettaglio.

source: Here we tell Seam to get the mail session bound to <literal>java:/Mail</literal> from JNDI.
it_it: Qua viene detto a Seam di ottenere da JNDI la sessione mail associata <literal>java:/Mail</literal>.
ja_jp: ここで Seam に JNDI から <literal>java:/Mail</literal> に送られるmailSessionを取得するよう指示します。

source: Seam configured Session
it_it: Sessione configurata da Seam
ja_jp: Seam 設定のSession

source: A mail session can be configured via <literal>components.xml</literal>. Here we tell Seam to use <literal>smtp.example.com</literal> as the smtp server:
it_it: Una sessione mail può essere configurata via <literal>components.xml</literal>. Qua viene indicato a Seam di usare <literal>smtp.example.com</literal> come server SMTP:
ja_jp: mailSessionは<literal>components.xml</literal>で設定する事ができます。 ここでは、<literal>smtp.example.com</literal>によりSeamがsmtpサーバを使用するように指示しています。

source: Seam's mail examples use Meldware (from <ulink url="http://buni.org">buni.org</ulink>) as a mail server. Meldware is a groupware package that provides <literal>SMTP</literal>, <literal>POP3</literal>, <literal>IMAP</literal>, webmail, a shared calendar and an graphical admin tool; it's written as a JEE application so can be deployed onto JBoss AS alongside your Seam application.
it_it: L'esempio mail di Seam usa Meldware (da <ulink url="http://buni.org">buni.org</ulink>) come server mail. Meldware è un pacchetto groupware che fornisce <literal>SMTP</literal>, <literal>POP3</literal>, <literal>IMAP</literal>, webmail, un calendario condiviso ed un tool di amministrazione grafico; è scritto come applicazione JEE e quindi può essere deployato in JBoss AS assieme alla propria applicazione Seam.
ja_jp: Meldwareをメールサーバとして使用したSeamのメールの例です（<ulink url="http://buni.org">buni.org</ulink>より）。 Meldwareは<literal>SMTP</literal>, <literal>POP3</literal>, <literal>IMAP</literal>、webmail、共有カレンダー、グラフィカルな管理ツールを提供するグループウェアで、JEEアプリケーションとして書かれているので、Seamアプリケーションと共にJBoss ASにデプロイする事ができます。
