Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Mail.po
Languages: it_it, ja_jp

source: The version of Meldware distributed with Seam (downloaded on demand) is specially tailored for development - mailboxes, users and aliases (email addresses) are created every time the application deploys. If you want to use Meldware in production you should install the latest release from <ulink url="http://buni.org">buni.org</ulink>.
it_it: La versione di Meldware distribuita con Seam (scaricata a richiesta) è configurata per lo sviluppo - caselle di posta, utenti e alias (indirizzi email) sono creati ogni volta che si esegue il deploy dell'applicazione. Se si vuole usare Meldware in produzione occorre installare l'ultima release da <ulink url="http://buni.org">buni.org</ulink>.
ja_jp: Seamと共に配布されているMeldwareのバージョンは開発用のバージョンでメールボックス、ユーザー、メールアドレス（アライアス）等がアプリケーションがデプロイされる度に新規に作られます。 製品にMeldwareを使用するのでしたら、<ulink url="http://buni.org">buni.org</ulink>から最新のバージョンをダウンロードしてインストールしてください。

source: Tags
it_it: Tag
ja_jp: タグ

source: Emails are generated using tags in the <literal>http://jboss.com/products/seam/mail</literal> namespace. Documents should always have the <literal>message</literal> tag at the root of the message. The message tag prepares Seam to generate an email.
it_it: Le email vengono generate usando tag nel namespace <literal>http://jboss.com/products/seam/mail</literal>. I documenti dovrebbero sempre avere il tag <literal>message</literal> alla radice del messaggio. Il tag message prepara Seam a generare una email.
ja_jp: 電子メールは <literal>http://jboss.com/products/seam/mail</literal> の名前空間内でタグを使って生成されます。 ドキュメントには常にメッセージのルートに <literal>message</literal> タグがあるはずです。 メッセージタグは Seam による電子メール生成の準備を行います。

source: The standard templating tags of facelets can be used as normal. Inside the body you can use any JSF tag; if it requires access to external resources (stylesheets, javascript) then be sure to set the <literal>urlBase</literal>.
it_it: I tag standard per il templating di facelets possono venire usati normalmente. Dentro il corpo si può usare qualsiasi tag JSF; se viene richiesto l'accesso a risorse esterne (fogli di stile, javascript) allora ci si assicuri di impostare <literal>urlBase</literal>.
ja_jp: Faceletsの標準のテンプレートタグは、そのまま使う事ができます。 また、本文の中ではすべてのJSFタグを使う事ができます（もし、スタイルシートやJavascript等で外部のリソースへのアクセスが必要であれば<literal>urlBase</literal>を設定してください。

source: Root tag of a mail message
it_it: Tag radice di un messaggio mail
ja_jp: メールメッセージのルートタグ

source: <literal>importance</literal> &#8212; low, normal or high. By default normal, this sets the importance of the mail message.
it_it: <literal>importance</literal> &#8212; low, normal o high. Di default è normal, questo imposta l'importanza del messaggio email.
ja_jp: <literal>importance</literal> &#8212;メールの重要度の設定(low,normal,high)。デフォルトはnormalです

source: <literal>precedence</literal> &#8212; sets the precedence of the message (e.g. bulk).
it_it: <literal>precedence</literal> &#8212; imposta la precedenza del messaggio (es. bulk).
ja_jp: <literal>precedence</literal> &#8212;メッセージの順序を設定します（例：バルク）

source: <literal>requestReadReceipt</literal> &#8212; by default false, if set, a read receipt request will be will be added, with the read receipt being sent to the <literal>From:</literal> address.
it_it: <literal>requestReadReceipt</literal> &#8212; di default è false, se impostato, verrà aggiunta una richiesta di conferma di lettura, da inviare all'indirizzo <literal>From:</literal>.
ja_jp: <literal>requestReadReceipt</literal> &#8212;デフォルトでfalseに設定されています。 trueに設定すると、メールの受け取りを<literal>From:</literal> アドレスに送信の要求を追加します。

source: <literal>urlBase</literal> &#8212; If set, the value is prepended to the <literal>requestContextPath</literal> allowing you to use components such as <literal>&lt;h:graphicImage&gt;</literal> in your emails.
it_it: <literal>urlBase</literal> &#8212; Se impostato, il valore è messo prima di <literal>requestContextPath</literal> consentendo di usare nelle proprie email componenti quali <literal>&lt;h:graphicImage&gt;</literal>.
ja_jp: <literal>urlBase</literal> &#8212; 設定されている<literal>urlBase</literal>が<literal>requestContextPath</literal>の前に置かれ、メール中に <literal>&lt;h:graphicImage&gt;</literal>のようにコンポーネントを使用する事を可能にします。

source: <literal>messageId</literal> &#8212; Sets the Message-ID explicitly
it_it: <literal>messageId</literal> &#8212; Imposta esplicitamente il Message-ID
ja_jp: <literal>messageId</literal> &#8212; メッセージIDを明示的に設定します。

source: Set's the From: address for the email. You can only have one of these per email.
it_it: Si imposti l'indirizzo From: per la mail. Se ne può avere uno soltanto per email.
ja_jp: メール発信者のアドレス（From:)の設定。一つのメールに対して一つ設定できます。

source: <literal>name</literal> &#8212; the name the email should come from.
it_it: <literal>name</literal> &#8212; il nome da cui l'email deve provenire.
ja_jp: <literal>name</literal> &#8212;メール発信者の名前

source: <literal>address</literal> &#8212; the email address the email should come from.
it_it: <literal>address</literal> &#8212; l'indirizzo email da cui la mail deve provenire.
ja_jp: <literal>address</literal> &#8212; メール発信者のメールアドレス

source: Set's the Reply-to: address for the email. You can only have one of these per email.
it_it: Si imposti l'indirizzo Reply-to: per la mail. Se ne può avere uno soltanto per email.
ja_jp: メールの返信用のアドレス(Reply-to:)の設定。 一つのメールに対して一つのアドレスを設定する事ができます。

source: Add a recipient to the email. Use multiple &lt;m:to&gt; tags for multiple recipients. This tag can be safely placed inside a repeat tag such as &lt;ui:repeat&gt;.
it_it: Si aggiunga un destinatario alla mail. Si usino più tag &lt;m:to&gt; per destinatari multipli. Questo tag può essere collocato in modo sicuro dentro un tag repeat quale &lt;ui:repeat&gt;.
ja_jp: 電子メール に受信者を追加します。 受信者が複数の場合は複数の &lt;m:to&gt; タグを使用します。 このタグは &lt;ui:repeat&gt;. などの繰り返しタグ内に問題なく配置できます。

source: <literal>name</literal> &#8212; the name of the recipient.
it_it: <literal>name</literal> &#8212; il nome del destinatario.
ja_jp: <literal>name</literal> &#8212; 受信者の名前

source: <literal>address</literal> &#8212; the email address of the recipient.
it_it: <literal>address</literal> &#8212; l'indirizzo email del destinatario.
ja_jp: <literal>address</literal> &#8212; 受信者のメールアドレス

source: Add a cc recipient to the email. Use multiple &lt;m:cc&gt; tags for multiple ccs. This tag can be safely placed inside a iterator tag such as &lt;ui:repeat&gt;.
it_it: Si aggiunga un destinatario cc alla mail. Si usino più tag &lt;m:cc&gt; per destinatari cc multipli. Questo tag può essere collocato in modo sicuro dentro un tag iteratore quale &lt;ui:repeat&gt;.
ja_jp: email に CC の受信者を追加します。 CC が複数の場合は複数の &lt;m:cc&gt; タグを使用します。 このタグは &lt;ui:repeat&gt; などの繰り返しタグ内に問題なく配置できます。

source: Add a bcc recipient to the email. Use multiple &lt;m:bcc&gt; tags for multiple bccs. This tag can be safely placed inside a repeat tag such as &lt;ui:repeat&gt;.
it_it: Si aggiunga un destinatario ccn alla mail. Si usino più tag &lt;m:bcc&gt; per destinatari ccn multipli. Questo tag può essere collocato in modo sicuro dentro un tag repeat quale &lt;ui:repeat&gt;.
ja_jp: email に BCC の受信者を追加します。 BCC が複数の場合は複数の &lt;m:bcc&gt; タグを使用します。 このタグは &lt;ui:repeat&gt; などの繰り返しタグ内に問題なく配置できます。

source: Add a header to the email (e.g. <literal>X-Sent-From: JBoss Seam</literal>)
it_it: Aggiungere un'intestazione alla mail (es. <literal>X-Sent-From: JBoss Seam</literal>)
ja_jp: メールへのヘッダー情報の追加（例：<literal>X-Sent-From: JBoss Seam</literal>)

source: <literal>name</literal> &#8212; The name of the header to add (e.g. <literal>X-Sent-From</literal>).
it_it: <literal>name</literal> &#8212; Il nome dell'intestazione da aggiungere (es. <literal>X-Sent-From</literal>).
ja_jp: <literal>name</literal> &#8212; 追加するヘッダーの名前 (e.g. <literal>X-Sent-From</literal>).

source: <literal>value</literal> &#8212; The value of the header to add (e.g. <literal>JBoss Seam</literal>).
it_it: <literal>value</literal> &#8212; Il valore dell'intestazione da aggiungere (es. <literal>JBoss Seam</literal>).
ja_jp: <literal>value</literal> &#8212;ヘッダーに追加する値（例：<literal>JBoss Seam</literal>）

source: Add an attachment to the email.
it_it: Aggiungere un allegato alla mail.
ja_jp: 電子メール に添付を追加します。

source: <literal>value</literal> &#8212; The file to attach:
it_it: <literal>value</literal> &#8212; Il file da allegare.
ja_jp: <literal>value</literal> &#8212; 添付ファイル:

source: <literal>String</literal> &#8212; A <literal>String</literal> is interpreted as a path to file within the classpath
it_it: <literal>String</literal> &#8212; Una <literal>String</literal> è interpretata come path al file all'interno del classpath
ja_jp: <literal>String</literal> &#8212;<literal>String</literal>はクラスパス内のファイルへのパスと解釈されます。

source: <literal>java.io.File</literal> &#8212; An EL expression can reference a <literal>File</literal> object
it_it: <literal>java.io.File</literal> &#8212; Un'espressione EL può fare riferimento ad un oggetto <literal>File</literal>
ja_jp: <literal>java.io.File</literal> &#8212;EL式は<literal>File</literal> オブジェクトを参照する事ができます。

source: <literal>java.net.URL</literal> &#8212; An EL expression can reference a <literal>URL</literal> object
it_it: <literal>java.net.URL</literal> &#8212; Un'espressione EL può fare riferimento ad un oggetto <literal>URL</literal>
ja_jp: <literal>java.net.URL</literal> &#8212; EL式は<literal>URL</literal>オブジェクトを参照する事ができます

source: <literal>java.io.InputStream</literal> &#8212; An EL expression can reference an <literal>InputStream</literal>. In this case both a <literal>fileName</literal> and a <literal>contentType</literal> must be specified.
it_it: <literal>java.io.InputStream</literal> &#8212; Un'espressione EL può fare riferimento ad un oggetto <literal>InputStream</literal>. In questo caso devono essere specificati entrambi i <literal>fileName</literal> e <literal>contentType</literal>.
ja_jp: <literal>java.io.InputStream</literal> &#8212; EL式は<literal>InputStream</literal>を参照する事ができます。この場合、<literal>fileName</literal>と<literal>contentType</literal>が設定されていることが必要です。

source: <literal>byte[]</literal> &#8212; An EL expression can reference an <literal>byte[]</literal>. In this case both a <literal>fileName</literal> and a <literal>contentType</literal> must be specified.
it_it: <literal>byte[]</literal> &#8212; Un'espressione EL può fare riferimento a <literal>byte[]</literal>. In questo caso devono essere specificati entrambi i <literal>fileName</literal> e <literal>contentType</literal>.
ja_jp: <literal>byte[]</literal>&#8212; EL式は <literal>byte[]</literal>.を参照する事ができます。この場合、<literal>fileName</literal>と<literal>contentType</literal>が指定されていることが必要です。

source: If the value attribute is ommitted:
it_it: Se viene omesso l'attributo value:
ja_jp: 値属性が省略される場合、

source: If this tag contains a <literal>&lt;p:document&gt;</literal> tag, the document described will be generated and attached to the email. A <literal>fileName</literal> should be specified.
it_it: Se questo tag contiene un tag <literal>&lt;p:document&gt;</literal>, il documento descritto sarà generato ed allegato alla mail. Deve essere specificato un <literal>fileName</literal>.

source: If this tag contains other JSF tags a HTML document will be generated from them and attached to the email. A <literal>fileName</literal> should be specified.
it_it: Se questo tag contiene altri tag JSF, da questi verrà generato un documento HTML ed allegato alla mail. Un <literal>fileName</literal> dovrebbe sempre essere specificato.

source: <literal>fileName</literal> &#8212; Specify the file name to use for the attached file.
it_it: <literal>fileName</literal> &#8212; Specifica il nome del file da usare per il file allegato.
ja_jp: <literal>fileName</literal> &#8212; 添付ファイルのファイル名の指定

source: <literal>contentType</literal> &#8212; Specify the MIME type of the attached file
it_it: <literal>contentType</literal> &#8212; Specifica il tipo MIME del file allegato.
ja_jp: <literal>contentType</literal> &#8212;添付ファイルのMIMEタイプの指定

source: Set's the subject for the email.
it_it: Impostiamo l'oggetto della mail.
ja_jp: メールのタイトルの設定

source: Set's the body for the email. Supports an <literal>alternative</literal> facet which, if an HTML email is generated can contain alternative text for a mail reader which doesn't support html.
it_it: Si imposti il corpo della mail. Supporta un facet <literal>alternativo</literal> che, se viene generata una mail HTML, può contenere testo alternativo per un lettore di email che non supporta HTML.
ja_jp: メールの本文の設定。 <literal>alternative</literal>ファセットによりHTMLメールを作成する際、htmlメールをサポートしていないメールリーダのために、テキスト版を含めることができます。

source: <literal>type</literal> &#8212; If set to <literal>plain</literal> then a plain text email will be generated otherwise an HTML email is generated.
it_it: <literal>type</literal> &#8212; Se impostato a <literal>plain</literal> allora verrà generata una mail con semplice testo, altrimenti una mail HTML.
ja_jp: <literal>type</literal> &#8212; <literal>plain</literal>と設定してあれば、プレーンテキストのメールを生成しますが、それ以外ではHTMLメールを生成します。

source: Email
ja_jp: 電子メール

source: HTML/Text alternative part
ja_jp: HTML/Text 代替部分

source: JNDI lookup in JBoss AS
ja_jp: JBoss AS の JNDI ルックアップ
