Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Oc4j.po
Languages: it_it, ja_jp

source: Create an interface called <literal>Authenticator</literal> which <literal>AuthenticatorAction</literal> implements (EJB3 requires session beans to have a local interface). Annotate the interface with <literal>@Local</literal> , and add a single method with same signature as the <literal>authenticate</literal> in <literal>AuthenticatorAction</literal> .
it_it: Creare un interfaccia chiamata <literal>Authenticator</literal> implementata da <literal>AuthenticatorAction</literal>. (EJB3 richiede session bean con un'interfaccia locale). Si annoti l'interfaccia con <literal>@Local</literal> , ed aggiungere un singolo metodo con la stessa signature come <literal>authenticate</literal> in <literal>AuthenticatorAction</literal>.
ja_jp: <literal>AuthenticatorAction</literal> が実装する <literal>Authenticator</literal> という名前のインタフェースを作成してください (EJB3 ではセッション Bean にローカルインタフェースが必要)。インタフェースに <literal>@Local</literal> アノテーションを付与し、<literal>AuthenticatorAction</literal> の <literal>authenticate</literal> と同じシグニチャのメソッドを一つ追加してください。

source: Use <literal>@PersistenceContext</literal> to inject an EntityManager by adding this line the <literal>AuthenticatorAction</literal> class:
it_it: Usare <literal>@PersistenceContext</literal> per iniettare un EntityManager aggiungendo questa linea alla classe <literal>AuthenticatorAction</literal>:
ja_jp: <literal>AuthenticatorAction</literal> クラスに以下の行を追加することによって EntityManager をインジェクトするのに<literal>@PersistenceContext</literal> を使用してください。

source: Implement authenticate:
it_it: Implementa authenticate:
ja_jp: authenticate クラスを実装してください。

source: And then add the EJB3 reference to <literal>web.xml</literal> :
it_it: E aggiungere quindi il riferimento EJB3 a <literal>web.xml</literal>:
ja_jp: <literal>web.xml</literal> に EJB3 参照を追加してください。

source: Build and deploy as before and notice that now only actual username and passwords are accepted.
it_it: Eseguire il build ed il deploy come prima e notare che solo i veri username e password vengono accettati.
ja_jp: 前のようにビルドしてデプロイしてください、今は単に実際に入力されたユーザー名とパスワードが受け入れられることに注意してください。

source: Finishing up
it_it: Fine
ja_jp: 完成

source: That's it, we're through. You now have a great starting point for any Seam based application deployed to OC4J.
it_it: Ecco fatto, abbiamo finito. Ora si ha un buon punto di partenza per le applicazioni Seam deployate in OC4J.
ja_jp: 以上で完成です。OC4J にデプロイする Seam アプリケーションの出発点として利用できる雛形を作成できました。
