Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Oc4j.po
Languages: it_it, ja_jp

source: Seam on OC4J
it_it: Seam con OC4J
ja_jp: OC4J 上の Seam

source: OC4J (Oracle Containers for Java) 11g (currently a "Technology Preview" release) is Oracle's JEE5 application server. Seam application can be deployed to OC4J, but require some additional configuration changes, and dependencies. This chapter will show you exactly what must be done. We will start by looking at the building and deploying the JEE5 Hotel Booking example application which comes with Seam. Then we will deploy a project generated by <literal>seam-gen</literal> . First a basic <literal>seam-gen</literal> application with RichFaces ajax components, and facelets. Then expand that application to include Seam security with Drools, JPA provided with hibernate, and automatic CRUD reverse engineering of a MySQL database.
it_it: OC4J (Oracle Containers for Java) 11g (attualmente una release "Technology Preview") è l'application server JEE5 di Oracle. Un'applicazione Seam può essere deployata in OC4J, ma richiede alcuni cambiamenti aggiuntivi alla configurazione e alle dipendenze. Questo capitolo mostra come fare. Partiamo guardando alla fase di build e deploy dell'applicazione d'esempio Prenotazione Hotel che è assieme a Seam. Poi si eseguirà il deploy di un progetto generato con <literal>seam-gen</literal>. Verrà creata un'applicazione base <literal>seam-gen</literal> con componenti RichFaces ajax e facelets. Poi si espanderà l'applicazione per includere la sicurezza di Seam con Drools, JPA fornito con Hibernate e il reverse engineering CRUD di un database MySQL.
ja_jp: OC4J (Oracle Containers for Java) 11g (現時点では "Technology Preview" リリース) は、Oracle の JEE5 アプリケーションサーバーです。Seam アプリケーションは、OC4J にデプロイすることが可能ですが、構成の変更と依存関係の追加が必要になります。この章では、まさに何が必要であるかを説明します。Seam に同梱されている JEE5 ホテル予約サンプルアプリケーションのビルドとデプロイを説明するところから始めます。それから、<literal>seam-gen</literal> によって生成されるプロジェクトをデプロイします。 まず最初に、RichFaces の ajax コンポーネントと facelets を使用した基本的な <literal>seam-gen</literal> アプリケーションを動作させます。次にこのアプリケーションを、Drools を使用した Seam セキュリティ、Hibernate により提供されるJPA、MySQL データベースからのリバースエンジニアリングを使用した CRUD 自動アプリケーションへと拡張してゆきます。

source: Installation and operation of OC4J
it_it: Installazione ed operazione di OC4J
ja_jp: OC4J のインストールと操作

source: First we need to install the target container - OC4j. This chapter requires you to use OC4J 11g Technology Preview (not OC4J 10g). You can download OC4J 11g from <ulink url="http://www.oracle.com/technology/tech/java/oc4j/11/"> http://www.oracle.com/technology/tech/java/oc4j/11/ </ulink> Below are instructions to install. launch, access, and shutdown the 11g release. For further information on installing OC4J, consult the <literal>readme.txt</literal> distributed with OC4J, or the OC4J installation guide and release notes.
it_it: Prima occorre installare il container OC4j. Questo capitolo richiede di usare OC4J 11g Technology Preview (non OC4J 10g). Eseguire il download OC4J 11g da <ulink url="http://www.oracle.com/technology/tech/java/oc4j/11/"> http://www.oracle.com/technology/tech/java/oc4j/11/ </ulink>. Sotto ci sono le istruzioni per installare, lanciare, accedere e spegnere la release 11g. Per ulteriori informazioni sull'installazione di OC4J, consultare il file <literal>readme.txt</literal> distribuito con OC4J, oppure la guida e le release note di OC4J.
ja_jp: 最初にターゲットコンテナ - OC4J のインストールが必要です。 この章では、OC4J 11g Technology Preview (OC4J 10g ではありません) の使用が必要です。OC4J 11g は <ulink url="http://www.oracle.com/technology/tech/java/oc4j/11/"> http://www.oracle.com/technology/tech/java/oc4j/11/ </ulink> からダウンロードできます。以下は、OC4J 11g のインストール、起動、アクセス、終了の手順です。OC4J のインストールについてのさらなる情報については、OC4J と一緒に配布されている <literal>readme.txt</literal> や、OC4J インストールガイド (installation guide) 、リリースノート (release notes)を参照してください。

source: Download and unzip OC4J
it_it: Scaricare e decomprimere OC4J
ja_jp: OC4J をダウンロードして解凍してください。

source: Make sure you have <literal>$JAVA_HOME</literal> and <literal>$ORACLE_HOME</literal> set as environment variables ( <literal>$ORACLE_HOME</literal> is the directory to which you unzip OC4J). For further information on installing OC4J, consult the <literal>readme.txt</literal> distributed with OC4J
it_it: Assicurarsi di avere impostato <literal>$JAVA_HOME</literal> e <literal>$ORACLE_HOME</literal> come variabili d'ambiente (<literal>$ORACLE_HOME</literal> è la directory in cui si decomprime OC4J). Per ulteriori informazioni sull'installazione di OC4J, consultare il file <literal>readme.txt</literal> distribuito con OC4J.
ja_jp: 環境変数として <literal>$JAVA_HOME</literal> と <literal>$ORACLE_HOME</literal> が設定されていることを確認してください (<literal>$ORACLE_HOME</literal> は OC4J を解凍したディレクトリです)。 OC4J のインストールの詳細については、OC4J と一緒に配布された <literal>readme.txt</literal> を参考にしてください

source: Applications (ear/war) are deployed to the <literal>$ORACLE_HOME/j2ee/home/applications</literal> directory.
it_it: Le applicazioni (ear/war) vengono deployate nella directory <literal>$ORACLE_HOME/j2ee/home/applications</literal>.
ja_jp: <literal>$ORACLE_HOME/j2ee/home/applications</literal> ディレクトリにアプリケーション (ear/war) をデプロイしてください。

source: Note that OC4J does not support hot deployment by default. This means every time you deploy the application you must restart the server.
it_it: Si noti che OC4J non supporta di default l'hot deployment. Questo significa che ogni volta che si esegue il deploy dell'applicazione occorre riavviare il server.
ja_jp: OC4J は、デフォルトではホットデプロイをサポートしていないことに注意してください。 これは、アプリケーションをデプロイするたびにサーバを再起動しなければならないことを意味します。

source: Start OC4J: <literal> $ORACLE_HOME/j2ee/home/java -jar -XX:MaxPermSize=256M oc4j.jar </literal>
it_it: Avviare OC4J: <literal> $ORACLE_HOME/j2ee/home/java -jar -XX:MaxPermSize=256M oc4j.jar </literal>
ja_jp: OC4J を起動してください。 <literal> $ORACLE_HOME/j2ee/home/java -jar -XX:MaxPermSize=256M oc4j.jar </literal>

source: You must override the default PermGen memory settings using above command. See <ulink url="http://www.oracle.com/technology/tech/java/oc4j/11/oc4j-relnotes.html"> OC4J release notes </ulink> for details.
it_it: Occore ridefinire le impostazioni di default per la memoria PermGn usando il comando di cui sopra. Si veda <ulink url="http://www.oracle.com/technology/tech/java/oc4j/11/oc4j-relnotes.html"> OC4J release notes</ulink> per i dettagli.
ja_jp: 上記のコマンドを使用して、デフォルトの PermGen メモリ設定を上書きしなければなりません。詳細は、<ulink url="http://www.oracle.com/technology/tech/java/oc4j/11/oc4j-relnotes.html"> OC4J リリースノート </ulink> を参照してください。

source: You will be asked to set the admin password if this is the first time you have started OC4J
it_it: Verrà chiesto di impostare la password di admin se è la prima volta che si avvia OC4J.
ja_jp: OC4J の初回起動時には、管理パスワードを設定するように求められます。

source: Once deployed you can check out your applications at <literal>http://localhost:8888/&lt;your-app-path&gt;</literal>
it_it: Una volta eseguito il deploy si può controllare l'applicazione all'indirizzo <literal>http://localhost:8888/&lt;your-app-path&gt;</literal>
ja_jp: デプロイできればすぐに、<literal>http://localhost:8888/&lt;your-app-path&gt;</literal> にアクセスしてアプリケーションを確認できます。

source: You can stop the server by pressing <literal>CTRL-C</literal> in the console on which the server is running.
it_it: Si può spegnere il server premendo <literal>CTRL-C</literal> nella console su cui gira il server.
ja_jp: サーバを停止するには、サーバを実行させているコンソールで <literal>CTRL-C</literal> を押します。

source: The <literal>jee5/booking</literal> example
it_it: L'esempio <literal>jee5/booking</literal>
ja_jp: <literal>jee5/booking</literal> サンプル

source: The <literal>jee5/booking</literal> example is based on the Hotel Booking example (which runs on JBoss AS). Out of the box it is designed to run on Glassfish, but it's easy to build it for OC4J. It is located in the <literal>$SEAM_DIST/examples/jee5/booking</literal> directory.
it_it: L'esempio <literal>jee5/booking</literal> è basato sull'esempio Prenotazione Hotel (che gira su JBoss AS). Gira anche su Glassh, ma è facile fare il build per OC4J. E' localizzato nella directory <literal>$SEAM_DIST/examples/jee5/booking</literal>.
ja_jp: <literal>jee5/booking</literal> サンプルは、(JBoss AS 上で動作する) ホテル予約サンプルに基づいています。そのままで GlassFish 上で動作するように設計されていますが、OC4J 上でも簡単に動作させることができます。このサンプルは <literal>$SEAM_DIST/examples/jee5/booking</literal> にあります。

source: Booking Example Dependencies
it_it: Dipendenze dell'esempio Prenotazione
ja_jp: ホテル予約サンプルの依存関係

source: First, lets look at the basic dependencies of the booking example. Armed with this knowledge we can look at the extra dependencies requirements that OC4J adds.
it_it: Innanzitutto guardiamo le dipendenze base dell'esempio prenotazione. Armati di conoscenza possiamo guardare i requisiti di dipendenze extra che OC4J aggiunge.
ja_jp: まずホテル予約サンプルの基本的な依存関係を調べます。この知識をもとに OC4J に必要となる追加の依存関係を調べます。

source: We will show you how to get these dependencies into the application in <xref linkend="oc4j-build-jee5"/> below.
it_it: Si mostrerà come ottenere queste dipendenze nell'applicazione <xref linkend="oc4j-build-jee5"/> sotto.
ja_jp: アプリケーションに依存関係を含める方法は、後の <xref linkend="oc4j-build-jee5"/> で説明します。

source: Core Seam dependencies
it_it: Dipendenze core di Seam
ja_jp: Seam コアの依存関係

source: <literal>jboss-seam.jar</literal> &#8212; We declare this as an EJB3 module (why? well Seam needs to be able to interact with container managed transactions; this is implemented as an EJB3 Stateful Session Bean)
it_it: <literal>jboss-seam.jar</literal> &#8212; viene dichiarato questo come modulo EJB3 (perché? Seam deve essere in grado di interagire con le transazioni gestite da container; questo è implementato come EJB3 Stateful Session Bean)
ja_jp: <literal>jboss-seam.jar</literal> &#8212; EJB3 モジュールとして宣言します (Seam はコンテナ管理のトランザクションと連携する必要があるからです。そのため EJB3 ステートフルセッション Bean として実装されています)

source: <literal>jboss-seam-ui.jar</literal> &#8212; Seam's JSF controls depend on Apache's commons-beanutils
it_it: <literal>jboss-seam-ui.jar</literal> &#8212; i controlli JSF di Seam dipendono da commons-beanutils di Apache
ja_jp: <literal>jboss-seam-ui.jar</literal> &#8212; Seam の JSF コントロールは Apache の commons-beanutils に依存しています

source: <literal>richfaces-api.jar</literal> , <literal>richfaces-impl.jar</literal> and <literal>richfaces-ui.jar</literal> &#8212; which requires Apache commons-digester and commons-beanutils
it_it: <literal>richfaces-api.jar</literal> , <literal>richfaces-impl.jar</literal> e <literal>richfaces-ui.jar</literal> &#8212; richiede Apache commons-digester e commons-beanutils
ja_jp: <literal>richfaces-api.jar</literal> と <literal>richfaces-impl.jar</literal> と <literal>richfaces-ui.jar</literal> &#8212; これらは Apache commons-digester と commons-beanutils を必要とします

source: Extra dependencies
it_it: Extra dipendenze
ja_jp: 追加の依存関係

source: Hibernate &#8212; of course, we decided to use Hibernate as the JPA provider (rather than TopLink Essentials which ships with OC4J).
it_it: Hibernate &#8212; si usa Hibernate come provider JPA(piuttosto di TopLink Essentials che viene dato con OC4J).
ja_jp: Hibernate &#8212; もちろん JPA プロバイダとして (OC4J に同梱されて出荷される TopLink Essentials ではなく) Hibernate を使用します。

source: To use Hibernate as your JPA provider you need the following jars:
it_it: Per usare Hibernate come provider JPA occorrono i seguenti jar:
ja_jp: Hibernate を JPA プロバイダとして使用するためには、以下の jar が必要です。

source: Third party jars &#8212; various jars needed for seam and this example to run.
it_it: Jar di Terze Parti &#8212;vari jar servono a Seam e a questo esempio per poter funzionare.
ja_jp: サードパーティの jar &#8212; Seam とサンプルを実行させるには、さまざまな jar が必要になります。

source: <literal>log4j.jar</literal> &#8212; This can be left out if you are not going to configure log4j. If it is packaged but not configured logging will be hidden in oc4j.
it_it: <literal>log4j.jar</literal> &#8212; si può tralasciare se non si usa log4j. Se viene impacchettato ma non configurato, verrà nascosto in OC4J.
ja_jp: <literal>log4j.jar</literal> &#8212; log4j を構成しないのであれば、これは省略できます。アーカイブに含めても構成しないのであれば、OC4J に隠蔽されてしまいます。

source: Extra OC4J jars &#8212; Running Seam on most application servers (such as JBoss AS or Glassfish) you only need to include the dependencies for those bits of Seam you actually use (e.g. if you use Seam Text you need to include ANTLR); but, on OC4J, due to its "interesting" classloading you must always include them:
it_it: Extra OC4J jar &#8212; Per eseguire Seam sulla maggior parte degli application server (quali JBoss AS o Glassfish) serve solo includere le dipendenze usate in Seam (es. se si usa Seam Text, serve ANTLR); ma su OC4J a causa del su "interessante" classloader occorre sempre includerli:
ja_jp: 追加の OC4J jar &#8212; 通常のアプリケーションサーバー (例えば JBoss AS や Glassfish) で Seam を実行するには、単に実際に使用する Seam 機能の依存関係のみを含めれば十分です (例えば Seam テキストを使用するためには ANTLR を含む必要があります)。しかし OC4J では、 "面白い" クラスローディング機能のために、以下のものを必ず含める必要があります。

source: <literal>hibernate-common-annotations.jar</literal> &#8212; needed for hibernate search
it_it: <literal>hibernate-common-annotations.jar</literal> &#8212; serve a Hibernate Search
ja_jp: <literal>hibernate-common-annotations.jar</literal> &#8212; Hibernate search に必要

source: <literal>lucene-core.jar</literal> &#8212; needed for hibernate search
it_it: <literal>lucene-core.jar</literal> &#8212; occorre a hibernate search
ja_jp: <literal>lucene-core.jar</literal> &#8212; Hibernate search に必要

source: <literal>antlr.jar</literal> &#8212; needed for Seam Text
it_it: <literal>antlr.jar</literal> &#8212; occorra a Seam Text
ja_jp: <literal>antlr.jar</literal> &#8212; Seam テキストに必要

source: <literal>jbpm-jpdl.jar</literal> &#8212; needed for Seam's JBPM
it_it: <literal>jbpm-jpdl.jar</literal> &#8212; occorre a JBPM di Seam
ja_jp: <literal>jbpm-jpdl.jar</literal> &#8212; Seam JBPM に必要

source: <literal>dbunit.jar</literal> &#8212; needed for some testing classes
it_it: <literal>dbunit.jar</literal> &#8212; occorre per alcune classi di test
ja_jp: <literal>dbunit.jar</literal> &#8212; テスト用クラスに必要

source: <literal>jboss-embedded-api.jar</literal> &#8212; needed for some testing classes
it_it: <literal>jboss-embedded-api.jar</literal> &#8212; serve per alcune classi di testing
ja_jp: <literal>jboss-embedded-api.jar</literal> &#8212; テスト用クラスに必要

source: Drools &#8212; needed for Seam Security. We aren't using Seam security with Drools, but have to include it. Drools consists of 6 jars: <itemizedlist> <listitem> <simpara> <literal>drools-core.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>drools-compiler.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>janino.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>mvel141.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>core.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>antlr-runtime.jar</literal> </simpara> </listitem> </itemizedlist> Drools integration is not used in the example.
it_it: Drools &#8212; occorre a Seam Security. Anche se non si usa Seam Security con Drools, occorre includerlo. Drools consiste di 6 jar: <itemizedlist> <listitem> <simpara> <literal>drools-core.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>drools-compiler.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>janino.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>mvel141.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>core.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>antlr-runtime.jar</literal> </simpara> </listitem> </itemizedlist> L'integrazione con Drools non viene usata in quest'esempio.
ja_jp: Drools &#8212; Seam セキュリティのために必要です。Drools による Seam セキュリティは使用しませんが含める必要があります。Drools は 6 つの jar からなります。<itemizedlist> <listitem> <simpara> <literal>drools-core.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>drools-compiler.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>janino.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>mvel141.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>core.jar</literal> </simpara> </listitem> <listitem> <simpara> <literal>antlr-runtime.jar</literal> </simpara> </listitem> </itemizedlist> Drools 連携はこのサンプルでは使用されません。

source: Configuration file changes
it_it: Modifiche al file di configurazione
ja_jp: 構成ファイルの変更点

source: There are just a few changes to be made:
it_it: Ci sono solo poche modifiche da fare:
ja_jp: 必要な変更点はほんのわずかです。

source: You need to declare all your ejb's in the <literal>web.xml</literal> . This is a silly requirement of a number of JEE5 application servers - for example OC4J and Glassfish.
it_it: Bisogna dichiarare tutti gli EJB in <literal>web.xml</literal>. Questo è uno sciocco requisito di molti application server JEE5 - per esempio OC4J e Glassfish.
ja_jp: <literal>web.xml</literal> にすべての EJB を宣言する必要があります。 これは多くの JEE5 アプリケーションサーバー - 例えば OC4J と GlassFish - で必要となる思慮のない要求です。

source: This is already done in the example's web.xml file, below is an example.
it_it: Questo è già fatto nel file web.xml d'esempio. Sotto segue l'esempio.
ja_jp: 以下の例は、すでに変更を完了したサンプルの web.xml ファイルです。

source: You need to provide the correct configuration for your JPA implementation. We are using Hibernate and due to OC4J bundling an old ANTLR, we need to use an alternative query factory, we also want to use the OC4J transaction manager:
it_it: Bisogna fornire la configurazione corretta per l'implementazione JPA. Si usa Hibernate e poichP OC4J fornisce un vecchio ANTLR, serve usare una query factory alternativa, si vuole anche usare il gestore delle transazioni di OC4J:
ja_jp: JPA 実装の正しい構成を設定する必要があります。Hibernate を使用します。OC4J は古い ANTLR を同梱しているために別のクエリーファクトリを使用する必要があります。OC4J トランザクションマネージャも使用します。

source: For our example modify the <literal>resources/META-INF/persistence.xml</literal> file. Comment out the Glassfish properties and un-comment the OC4J properties.
it_it: Per l'esempio in questione modificare il file <literal>resources/META-INF/persistence.xml</literal>. Commentare le proprietà di Glassfish e decommentare le proprietà di OC4J.
ja_jp: サンプルのために <literal>resources/META-INF/persistence.xml</literal> ファイルを修正してください。Glassfish プロパティをコメントアウトし OC4J プロパティのコメントアウトをはずしてください。

source: Building the <literal>jee5/booking</literal> example
it_it: Build dell'esempio <literal>jee5/booking</literal>
ja_jp: <literal>jee5/booking</literal> サンプルのビルド

source: Modify the <literal>build.xml</literal> file in the example:
it_it: Modificare il file <literal>build.xml</literal> nell'esempio:
ja_jp: サンプルの <literal>build.xml</literal> ファイルを修正してください。

source: Un-comment the labeled OC4J-related library properties. This will include all the extra dependencies discussed above.
it_it: Decommentare le proprietà della libreria con etichetta OC4J. Questo includerà tutte le dipendenze extra discusse sopra.
ja_jp: OC4J 用とラベル付けされたライブラリプロパティのコメントアウトをはずしてください。これにより上記で説明した追加のライブラリが含まれます。

source: It should look like the following:
it_it: dovrebbe così apparire:
ja_jp: 以下のようになります。

source: Build the demo app by running <literal>ant</literal> in the <literal>examples/jee5/booking</literal> directory. The build target is <literal>dist/jboss-seam-jee5.ear</literal>
it_it: Fare il build dell'applicazione eseguendo <literal>ant</literal> nella directory <literal>examples/jee5/booking</literal>. Il build target è <literal>dist/jboss-seam-jee5.ear</literal>
ja_jp: <literal>examples/jee5/booking</literal> ディレクトリで<literal>ant</literal> を実行してデモアプリケーションをビルドします。ビルドされるターゲットは <literal>dist/jboss-seam-jee5.ear</literal> です。

source: Copy <literal>dist/jboss-seam-jee5.ear</literal> following the instructions below.
it_it: Copiare <literal>dist/jboss-seam-jee5.ear</literal> seguendo le istruzioni.
ja_jp: 以下の手順に従って <literal>dist/jboss-seam-jee5.ear</literal> をコピーしてください。

source: Deploying the Seam application to OC4J
it_it: Deploy dell'applicazione Seam in OC4J
ja_jp: OC4J への Seam アプリケーションのデプロイ

source: This mini-tutorial describes the (fairly tedious) steps required to deploy a JEE 5 application to OC4J. It assumes you have already downloaded and installed it following the instructions in <xref linkend="oc4j-install-operation"/>. It also assumes you are deploying the <literal>jee5/booking</literal> example, using the embedded hsqldb database. To deploy another application you would need to alter the datasource and application name.
it_it: Questo mini-tutorial descrive i passi (abbastanza noiosi) richiesti per il deploy di un'applicazione JEE5 in OC4J. Si assume che si abbia già scaricato ed installato tutto seguendo le istruzioni in <xref linkend="oc4j-install-operation"/>. Si assume anche che si stia facendo il deploy dell'esempio <literal>jee5/booking</literal>, usando il database mbedded hsqldb. Per il deploy di un'altra applicazione occorre modificare il datasource ed il nome dell'applicazione.
ja_jp: このミニチュートリアルでは、JEE 5 アプリケーションを OC4J にデプロイするのに必要な (とても退屈な) 手順を説明します。<xref linkend="oc4j-install-operation"/> の手順に従ってすでに OC4J をダウンロードしインストールを終えているものとして進めます。 組み込み hsqldb データベースを使用して <literal>jee5/booking</literal> サンプルをデプロイすることします。別のアプリケーションをデプロイするために、データソースとアプリケーション名を変更する必要があります。

source: Copy <literal>hsqldb.jar</literal> to OC4J shared library directory: <literal> cp $SEAM_HOME/lib/hsqldb.jar $ORACLE_HOME/j2ee/home/applib/ </literal> (OC4J doesn't come with an embedded database so we decided to use HSQLDB)
it_it: Copiare <literal>hsqldb.jar</literal> nella directory della libreria condivisa di OC4J: <literal> cp $SEAM_HOME/lib/hsqldb.jar $ORACLE_HOME/j2ee/home/applib/ </literal> (OC4J non fornisce un embedded database, quindi optiamo per HSQLDB)
ja_jp: OC4J 共用ライブラリディレクトリへ <literal>hsqldb.jar</literal> をコピーしてください。<literal> cp $SEAM_HOME/lib/hsqldb.jar $ORACLE_HOME/j2ee/home/applib/ </literal> (OC4J には組み込みデータベースが同梱されていないので HSQLDB を使用することにします)

source: Edit the OC4J datasource file <literal>$ORACLE_HOME/j2ee/home/config/data-sources.xml</literal> and, inside <literal>&lt;data-sources&gt;</literal> , add
it_it: Modificare il file datasource di OC4J <literal>$ORACLE_HOME/j2ee/home/config/data-sources.xml</literal> e, dentro <literal>&lt;data-sources&gt;</literal> , aggiungere
ja_jp: OC4J データソースファイル <literal>$ORACLE_HOME/j2ee/home/config/data-sources.xml</literal> を編集して、<literal>&lt;data-sources&gt;</literal> の内側に以下を追加してください

source: The <literal>jndi-name</literal> is used as the <literal>jta-data-source</literal> in <literal>persistence.xml</literal> .
it_it: <literal>jndi-name</literal> viene usato come <literal>jta-data-source</literal> in <literal>persistence.xml</literal> .
ja_jp: <literal>jndi-name</literal> は <literal>persistence.xml</literal> で <literal>jta-data-source</literal> として使用されます。

source: Edit <literal>$ORACLE_HOME/j2ee/home/config/server.xml</literal> and, inside <literal>&lt;application-server&gt;</literal> , add
it_it: Modificare <literal>$ORACLE_HOME/j2ee/home/config/server.xml</literal> e, dentro <literal>&lt;application-server&gt;</literal>, aggiungere
ja_jp: <literal>$ORACLE_HOME/j2ee/home/config/server.xml</literal> を編集して、<literal>&lt;application-server&gt;</literal> の内側に以下を追加してください

source: To keep things simple use the same names as you used for project.
it_it: Per mantenere le cose semplici usare nel progetto gli stessi nomi come si è abituati.
ja_jp: 簡単にするために、プロジェクトに使用したのと同じ名前を使用してください。

source: Edit <literal> $ORACLE_HOME/j2ee/home/config/default-web-site.xml </literal> , and, inside <literal>&lt;web-site&gt;</literal> , add
it_it: Modificare <literal> $ORACLE_HOME/j2ee/home/config/default-web-site.xml </literal>, e, dentro <literal>&lt;web-site&gt;</literal>, aggiungere
ja_jp: <literal> $ORACLE_HOME/j2ee/home/config/default-web-site.xml </literal> を編集して、<literal>&lt;web-site&gt;</literal> の内側に以下を追加してください
