Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Oc4j.po
Languages: it_it, ja_jp

source: The <literal>root</literal> is the context path you will put into your web browser to access the application.
it_it: <literal>root</literal> è il cotext path da mettere nel browser per accedere all'applicazione.
ja_jp: <literal>root</literal> は、アプリケーションにアクセスするために Web ブラウザに入力するコンテキストパスです。

source: Copy the application to OC4J: <literal> cp dist/jboss-seam-jee5.ear $ORACLE_HOME/j2ee/home/applications/ </literal>
it_it: Copiare l'applicazione in OC4J: <literal> cp dist/jboss-seam-jee5.ear $ORACLE_HOME/j2ee/home/applications/ </literal>
ja_jp: アプリケーションを OC4J にコピーしてください。<literal> cp dist/jboss-seam-jee5.ear $ORACLE_HOME/j2ee/home/applications/ </literal>

source: Start/stop OC4J following instructions in <xref linkend="oc4j-install-operation"/> above.
it_it: Avviare/Interrompere OC4J come visto in <xref linkend="oc4j-install-operation"/>.
ja_jp: 上記の <xref linkend="oc4j-install-operation"/> の手順に従って、OC4J を起動 / 終了してください。

source: Checkout the app at: <literal>http://localhost:8888/seam-jee5</literal>
it_it: Controllare l'applicazione in: <literal>http://localhost:8888/seam-jee5</literal>
ja_jp: <literal>http://localhost:8888/seam-jee5</literal> をブラウズしてアプリケーションを確認してください。

source: Deploying an application created using <literal>seam-gen</literal> to OC4J
it_it: Deploy in OC4J di un'applicazione creata con <literal>seam-gen</literal>
ja_jp: <literal>seam-gen</literal> により生成されたアプリケーションの OC4J へのデプロイ

source: <literal>seam-gen</literal> is a great tool for developers that can quickly get you up and running with a full Seam application. However the project that it created is configured to run on JBoss AS. This means there are some extra steps needed to have it execute on OC4j. The following explanation assumes you are using the command line and a simple text editor, but of course you can use your favorite IDE. <literal>seam-gen</literal> projects come with support for Eclipse and Netbeans.
it_it: <literal>seam-gen</literal> è uno grande strumento per gli sviluppatore che possono velocemente mettere in piedi applicazioni con Seam. Comunque il progetto che viene creato è configurato per JBoss AS. Questo significa che ci sono alcuni passi aggiuntivi da compiere per eseguirla su OC4J. Le seguenti istruzioni assumono che si usi la linea di comando ed un semplice editor, ma certamente si può usare il proprio IDE. I progetti <literal>seam-gen</literal> supportano Eclipse e Netbeans.
ja_jp: <literal>seam-gen</literal>は、開発者が素早く完全な Seam アプリケーションを準備し動作させることができる優れたツールです。しかし生成されるプロジェクトは、JBoss AS 上で動作させるように構成されています。そのため OC4J で実行させるためには、追加の手順が必要になります。以下の説明は、コマンドラインとシンプルなテキストエディタを使用していることを想定します。しかし、もちろんお気に入りの IDE を使用することもできます。<literal>seam-gen</literal> プロジェクトは Eclipse と Netbeans のサポート機能も一緒に生成されます。

source: We will start by creating and deploying a pretty simple application using <literal>seam-gen</literal> . Then we'll show you how easy it is to use <literal>seam-gen</literal> and Hibernate Tools to reverse engineer a database schema into a functional CRUD application. <literal>seam-gen</literal> will create JPA entity beans, Seam Application Framework components and JSF views for you. We will also add Seam security using Drools.
it_it: Cominceremo creando e deployando un'applicazione semplice usando <literal>seam-gen</literal>. Poi si mostrerà quanto è semplice usare <literal>seam-gen</literal> ed Hibernate Tools per compiere il reverse engineer di un database in un'applicazione con funzionalità CRUD. <literal>seam-gen</literal> crerà entity bean JPA, componenti del Seam Application Framework e le viste JSF al posto vostro. Aggiungeremo anche Seam Security usando Drools.
ja_jp: <literal>seam-gen</literal> 使用した簡単なアプリケーションを作成してデプロイすることから始めます。次に、<literal>seam-gen</literal> と Hibernate Tools を使用して、データベーススキーマからのリバースエンジニアリングにより基礎的な CRUD アプリケーションを生成するのがいかに簡単であるかを示します。<literal>seam-gen</literal> は、 JPA エンティティ Bean や Seam アプリケーションフレームワークコンポーネント、 JSF ビューを作成します。Drools を使用した Seam セキュリティも追加します。

source: This tutorial uses MySQL (but of course you could use any database, altering the SQL and datasources as appropriate); install, configure and run MySQL, then create a database with some sample data. Don't forget to also download the <literal>mysql-connector-java-X.jar</literal> for jdbc support. When setting up Seam security this tutorial will assume there is a table named <literal>User</literal> with columns <literal>username</literal> and <literal>password</literal> with at least one entry. Beyond that you can set up any type of sample data and tables you would like.
it_it: Questo tutorial usa MySQL (ma certamente si possono usare altri database, modificando l'SQL ed i datasource in modo appropriato); installare, configurare ed eseguire MySQL, poi create un database con alcuni dati d'esempio. Non si dimentichi di scaricare <literal>mysql-connector-java-X.jar</literal> per il support JDBC. Impostando Seam Security, questo tutorial assume che ci sia una tabella chiamata <literal>User</literal> con colonne <literal>username</literal> e <literal>password</literal> con almeno una riga. Oltre a ciò si possono impostare qualsiasi altro tipo di dati e tabelle d'esempio.
ja_jp: このチュートリアルは MySQL を使用します (しかしもちろん SQL とデータソースを適切に変更して、どんなデータベースも使用できます); MySQL をインストールし構成して実行して、サンプルデータを持つデータベースを作成してください。JDBC サポートのために <literal>mysql-connector-java-X.jar</literal> もダウンロードするのを忘れないでください。このチュートリアルで Seam セキュリティを設定するには、<literal>username</literal> と <literal>password</literal> カラムを持つ <literal>User</literal> という名前のテーブルと最低一つのエントリがあることを想定します。さらに好きなどんなタイプのサンプルデータとテーブルを設定することもできます。

source: Generating a basic <literal>seam-gen</literal> application
it_it: Generazione di un'applicazione base <literal>seam-gen</literal>
ja_jp: <literal>seam-gen</literal> アプリケーションの雛形の生成

source: First we need to tell the <literal>seam-gen</literal> what we want, run <literal>./seam setup</literal> in the seam distribution directory. Follow the settings example below based on your system and setup (ex. use your database name instead of <literal>oc4jexample</literal> ).
it_it: Innanzitutto <literal>seam-gen</literal> deve essere istruito riguardo a ciò che si vuole ottenere, si esegua <literal>./seam setup</literal> nella directory di distribuzione di Seam. Seguire le impostazioni d'esempio elencate qua sotto per il proprio sistema e setup(es. usare il nome del database invece di <literal>oc4jexample</literal>).
ja_jp: まず <literal>seam-gen</literal> をセットアップする必要があります。Seam ディストリビューションディレクトリで <literal>./seam setup</literal> を実行します。以下の設定例に従い、あなたのシステムと設定に基づいて設定してください (例えば <literal>oc4jexample</literal> の代わりに自分のデータベース名を使用してください)。

source: Type <literal>./seam new-project</literal> to create your project and <literal>cd /home/jbalunas/workspace/oc4j_example</literal> to the newly created project.
it_it: Digitare <literal>./seam new-project</literal> per creare il progetto e <literal>cd /home/jbalunas/workspace/oc4j_example</literal> nel nuovo progetto creato.
ja_jp: プロジェクトを作成するためには、<literal>$ ./seam new-project</literal> と入力してください。そして <literal>cd /home/jbalunas/workspace/oc4j_example</literal> と入力して新しく作成されたディレクトリへ移動してください。

source: Changes needed for deployment to OC4J
it_it: Modifiche richieste per il deploy in OC4J
ja_jp: OC4J へのデプロイに必要な変更点

source: We now need to make some changes to the generated project.
it_it: Occore fare alcune modifiche al progetto generato.
ja_jp: 生成されたプロジェクトに変更を行う必要があります。

source: Let's start with the configuration files:
it_it: Iniziamo con i file di configurazione:
ja_jp: 構成ファイルの変更から始めましょう:

source: Change the default target to archive (we aren't going to cover automatic deployment to OC4J).
it_it: Cambiare il target di default per l'archivio (non copriremo il deploy automatico in OC4J).
ja_jp: デフォルトのターゲットを archive に変更します (OC4J への自動的なデプロイを行いません)。

source: OC4J looks for the drools file <literal>/security.drl</literal> file in the root of the <literal>war</literal> file instead of the root of the <literal>ear</literal> file so we need to have the <literal>build.xml</literal> move it to the correct location at build time. The following must be added at the top of the <literal> &lt;target name="war" depends="compile" description="Build the distribution .war file"&gt; </literal> target.
it_it: OC4J cercherà il file <literal>/security.drl</literal> nella directory radice del file <literal>war</literal> invece che nella radice di <literal>ear</literal>, quindi occorre spostare <literal>build.xml</literal> nella corretta posizione a build time. Si aggiunga la seguente riga in cima al target: <literal> &lt;target name="war" depends="compile" description="Build the distribution .war file"&gt; </literal>.
ja_jp: OC4J は、<literal>ear</literal> ファイルのルートではなく <literal>war</literal> ファイルのルートで drools の <literal>/security.drl</literal> ファイルを探すので、ビルド時には正しい場所へ移動させるように <literal>build.xml</literal> に設定する必要があります。以下の変更は、<literal> &lt;target name="war" depends="compile" description="Build the distribution .war file"&gt; </literal> ターゲットの先頭に追加しなければなりません。

source: Alter the <literal>jta-data-source</literal> to be <literal>jdbc/__oc4jexample</literal> (and use this as the <literal>jndi-name</literal> when creating the data source in <literal>data-sources.xml</literal> later during deployment).
it_it: Modificare <literal>jta-data-source</literal> in <literal>jdbc/__oc4jexample</literal> (ed usare questo come <literal>jndi-name</literal> quando si crea un datasource in <literal>data-sources.xml</literal> più avanti nel deploy).
ja_jp: <literal>jta-data-source</literal> を <literal>jdbc/__oc4jexample</literal> に修正してください (後述のデプロイ時に <literal>data-sources.xml</literal> にデータソースを作成する場合は、<literal>jndi-name</literal> としてこれを指定してください)。

source: Add the properties (described in <literal>jee5/booking</literal> example):
it_it: Aggiungere le proprietà (descritto nell'esempio <literal>jee5/booking</literal>):
ja_jp: プロパティを追加してください (<literal>jee5/booking</literal> サンプルで述べられています)。

source: Remove the JBoss AS specific method of exposing the EntityManagerFactory:
it_it: Rimuovere il metodo specifico per JBoss AS per esporre EntityManagerFactory:
ja_jp: EntityManagerFactory を定義する JBoss AS 固有のメソッドを取り除いてください。

source: You'll need to alter <literal>persistence-prod.xml</literal> as well if you want to deploy to OC4J using the prod profile.
it_it: Occorre modificare <literal>persistence-prod.xml</literal> anche se si vuole eseguire il deploy in OC4J usando il profile prod.
ja_jp: prod プロファイルを使用して OC4J にデプロイしたければ、<literal>persistence-prod.xml</literal> も同様に修正する必要があります。

source: You can delete this file as we aren't deploying to JBoss AS ( <literal>jboss-app.xml</literal> is used to enable classloading isolation in JBoss AS)
it_it: Si può cancellare questo file poiché non si sta facendo il deploy in JBoss AS (<literal>jboss-app.xml</literal> viene usato per abilitare l'isolamento del classloading in JBoss AS)
ja_jp: JBoss AS にはデプロイしないのでこのファイルを削除できます (JBoss AS では <literal>jboss-app.xml</literal> を使用して、クラスローディングの分離を有効にします)

source: You can delete these file as we aren't deploying to JBoss AS (these files define datasources in JBoss AS, in OC4J you have to edit the master <literal>data-sources.xml</literal> file)
it_it: Si possono cancellare questi file poiché non si sta facendo il deploy in JBoss AS (questi file definiscono i datasource in JBoss AS, in OC4J bisogna editare il file master <literal>data-sources.xml</literal>)
ja_jp: JBoss AS にはデプロイしないのでこのファイルを削除できます (これらのファイルは、JBoss AS ではデータソースを定義していますが、OC4J ではマスタの <literal>data-sources.xml</literal> ファイルを編集しなければなりません)

source: Enable container managed transaction integration - add the <literal> &lt;transaction:ejb-transaction /&gt; </literal> component, and it's namespace declaration <literal> xmlns:transaction="http://jboss.com/products/seam/transaction" </literal>
it_it: Abilitare l'integrazione delle transazioni gestite dal container - aggiungere il componente <literal> &lt;transaction:ejb-transaction /&gt; </literal> e la dichiarazione del namespace <literal> xmlns:transaction="http://jboss.com/products/seam/transaction" </literal>
ja_jp: コンテナ管理トランザクションの統合を有効にします - <literal> &lt;transaction:ejb-transaction /&gt; </literal> コンポーネントと、その名前空間宣言 <literal>xmlns:transaction="http://jboss.com/products/seam/transaction"</literal> を追記してください

source: Alter the <literal>jndi-pattern</literal> to <literal> java:comp/env/oc4j_example/#{ejbName}/local </literal>
it_it: Modificare <literal>jndi-pattern</literal> in </literal> java:comp/env/oc4j_example/#{ejbName}/local </literal>
ja_jp: <literal>jndi-pattern</literal> を <literal> java:comp/env/oc4j_example/#{ejbName}/local </literal> に修正します

source: We want to use a Seam Managed Persistence Context in our application. Unfortunately OC4J doesn't expose the EntityManagerFactory in JNDI, but Seam provides a built-in manager component. To activate add the following entry:
it_it: Vogliamo avere un contesto di persistenza gestito da Seam. Sfortunatamente OC4J non espone l'EntityManagerFactory in JNDI, ma Seam fornisce un componente manager predefinito. Per attivarlo aggiungere:
ja_jp: アプリケーションで Seam 管理永続コンテキストを使用できるようにします。残念なことに OC4J は JNDI に EntityManagerFactory を登録しませんが、Seam が組み込みのマネージャコンポーネントを提供しています。このコンポーネントを有効にするために、以下のエントリを追加します。

source: We then need to tell Seam to use it, so we alter the <literal>managed-persistence-context</literal> injecting the Entity Manager Factory into the existing element:
it_it: Occorre poi dire a Seam di usarlo, quindi modificare <literal>managed-persistence-context</literal> iniettando Entity Manager Factory nell'elemento esistente:
ja_jp: Seam に組み込みのマネージャコンポーネントを使用するように設定する必要があるので、<literal>managed-persistence-context</literal> を修正して、存在する要素へ EntityManagerFactory を挿入します。

source: You must add the Seam container managed transaction integration EJB entry below. Remember for OC4j you need to declare all your EJBs here if you modify the application further.
it_it: Occorre aggiungere la riga sottostante per l'integrazione delle transazioni gestite dal container in Seam. Ricordarsi che per OC4J serve dichiarare tutti gli EJB se si modifica ulteriormente l'applicazione.
ja_jp: 以下の Seam コンテナ管理トランザクション統合 EJB のエントリを追加しなければなりません。 OC4J では、アプリケーションをさらに修正すれば、EJB をここで宣言する必要があることを思い出してください。

source: This is a file that you must create so that RichFaces and Ajax4Jsf stylesheets will work with OC4J. This file basically tells OC4J not force its own inherited URL settings.
it_it: Questo file va creato affinché i foglio di stile RichFaces e Ajax4Jsf funzionino con OC4J. Questo file dice a OC4j di non forzare le proprie impostazioni URL ereditate.
ja_jp: これは、OC4J で RichFaces と Ajax4Jsf スタイルシートを稼動させるために作成しなければないないファイルです。このファイルは、基本的に OC4J がそれ自身の受け継がれた URL 設定で動作しないように設定します。

source: Now you need to tell the <literal>build.xml</literal> file that it needs to copy this file to the <literal>ear</literal> archive. Find the <literal> &lt;target name="ear" description="Build the EAR"&gt; </literal> target and modify the <literal> &lt;copy todir="${ear.dir}/META-INF"&gt; </literal> section to look like the following:
it_it: Occorre indicare nel file <literal>build.xml</literal> che serve copiare questo file nell'archivio <literal>ear</literal>. Cercare il target <literal> &lt;target name="ear" description="Build the EAR"&gt; </literal> e modificare la sezione <literal> &lt;copy todir="${ear.dir}/META-INF"&gt; </literal> in modo che appaia così:
ja_jp: <literal>ear</literal> アーカイブにこのファイルをコピーするように、<literal>build.xml</literal> ファイルを設定する必要があります。<literal> &lt;target name="ear" description="Build the EAR"&gt; </literal> ターゲットを見つけて、<literal> &lt;copy todir="${ear.dir}/META-INF"&gt; </literal> セクションを以下のように修正してくだい

source: Extra jar dependencies
it_it: Dipendenze extra jar
ja_jp: 追加の jar 依存関係

source: This application has similar requirements as the <literal>jee5/booking</literal> example above.
it_it: Quest'applicazione ha requisiti simili all'esempio <literal>jee5/booking</literal>.
ja_jp: このアプリケーションは、<literal>jee5/booking</literal> サンプルと同様の変更が必要となります。

source: The <literal>build.xml</literal> must be modified to add the jars listed below to the generated archive files. Look for the <literal>&lt;fileset dir="${basedir}"&gt;</literal> section below and add the imports underneath the other libraries being imported.
it_it: Il <literal>build.xml</literal> deve essere modificato affinché vengano aggiunti i jar elencati qua sotto all'archivio generato. Si guardi la sezione <literal>&lt;fileset dir="${basedir}"&gt;</literal> e si aggiungano gli import sotto tutte le altre librerie importate.
ja_jp: <literal>build.xml</literal> は、生成するアーカイブファイルに以下にリストした jar を追加するように修正しなければなりません。以下の <literal>&lt;fileset dir="${basedir}"&gt;</literal> セクションを探して、 その下にインポートされる他のライブラリを追加してください。

source: Hibernate:
ja_jp: Hibernate 依存関係

source: Drools &#8212; because we are using Drools to provide Seam Security rules, we need to add in Eclipse JDT compiler (you don't need this on JBoss AS; again this is due to OC4J's classloading):
it_it: Drools &#8212; poiché si usa Drools per fornire le regole di Seam Security, occorre aggiungere il compilator JDT di Eclipse (non serve in JBoss AS; ancora è dovuto al classloading di OC4J):
ja_jp: Drools &#8212; Seam セキュリティルールのために Drools を使用するので、Eclipse JDT コンパイラに追加する必要があります (これは JBoss AS では必要ありません; これは OC4J のクラスローディングの問題のためです)。

source: Third party jars &#8212; most of these are only needed because of OC4J's classloading:
it_it: Jar di Terze Parti &#8212; la maggior parte di questi servono a causa del classloading di OC4J:
ja_jp: サードパーティ jar &#8212; これらの多くは OC4J クラスローディングのためのみに必要です。

source: You should end up with something like:
it_it: Si termina con qualcosa del tipo:
ja_jp: 最後には以下のようになります。

source: Building and deploying the seam-gen'd application to OC4J
it_it: Build e deploy di applicazioni seam-gen per OC4J
ja_jp: seam-gen 生成アプリケーションのビルドと OC4J へのデプロイ

source: These instructions are very similar to the ones in <xref linkend="oc4j-app-deploy"/> but with the correct references for the <literal>oc4j_example</literal> application.
it_it: Queste istruzioni sono simile a quelle di <xref linkend="oc4j-app-deploy"/> ma con i riferimenti corretti per l'applicazione <literal>oc4j_example</literal>.
ja_jp: これらの手順は <xref linkend="oc4j-app-deploy"/> の手順と非常に類似していますが、<literal>oc4j_example</literal> アプリケーションへ正しく置き換えて使用することが必要です。

source: Build your application by calling <literal>ant</literal> in the base directory of your project (ex. <literal>/home/jbalunas/workspace/oc4j_example</literal> ). The target of the build will be <literal>dist/oc4j_example.ear</literal> .
it_it: Costruire l'applicazione lanciando il comando <literal>ant</literal> nella directory base del progetto (es. <literal>/home/jbalunas/workspace/oc4j_example</literal>). Il target del build sarà <literal>dist/oc4j_example.ear</literal>.
ja_jp: プロジェクトのベースディレクトリ (例えば <literal>/home/jbalunas/workspace/oc4j_example</literal>) で <literal>ant</literal> を実行してアプリケーションをビルドしてください。ビルドされるターゲットファイルは <literal>dist/oc4j_example.ear</literal> です。

source: Copy the <literal>mysql-connector.jar</literal> file to the <literal>$ORACLE_HOME/j2ee/home/applib</literal> directory so that jdbc drivers are available.
it_it: Copiare il file <literal>mysql-connector.jar</literal> nella directory <literal>$ORACLE_HOME/j2ee/home/applib</literal> affinché siano disponibili i driver JDBC.
ja_jp: <literal>mysql-connector.jar</literal> ファイルを <literal>$ORACLE_HOME/j2ee/home/applib</literal> ディレクトリにコピーして、JDBC ドライバが利用できるようにしてください。

source: Start/stop OC4J following instructions in the <literal>Installation and operation of OC4J</literal> section above.
it_it: Avviare/Interrompere OC4J seguendo le istruzioni della sezione <literal>Installazione ed operazioni di OC4J</literal>.
ja_jp: 上記の <xref linkend="oc4j-install-operation"/> の手順に従って、OC4J を起動 / 終了してください。

source: Checkout the app at: <literal>http://localhost:8888/oc4j_example</literal>
it_it: Controllare l'applicazione in: <literal>http://localhost:8888/oc4j_example</literal>
ja_jp: <literal>http://localhost:8888/oc4j_example</literal> をブラウズしてアプリケーションを確認してください。

source: Extending example with reverse engineered CRUD and Drools
it_it: Estensione dell'esempio con CRUD (reverse engineer) e Drools
ja_jp: リバースエンジンニアリング生成した CRUD と Drools を使用したサンプルの拡張

source: In this section we extend the basic <literal>seam-gen</literal> application into a full blown CRUD application based on an existing database. Plus we will add <literal>Drools</literal> based security as well.
it_it: In questa sezione estenderemo l'applicazione base <literal>seam-gen</literal> in un'applicazione CRUD su un database esistente. Inoltre aggiungeremo la sicurezza basata su <literal>Drools</literal>.
ja_jp: ここでは、基本的な <literal>seam-gen</literal> アプリケーションを、現存のデータベースをもとにした本格的な CRUD アプリケーションに拡張します。さらに <literal>Drools</literal> ベースのセキュリティも追加します。

source: Have <literal>seam-gen</literal> generate your CRUD applications
it_it: Fare generare applicazioni CRUD a <literal>seam-gen</literal>
ja_jp: <literal>seam-gen</literal> による CRUD アプリケーションの生成

source: Type <literal>./seam generate-entities</literal> in the base directory of your seam distribution. This will create the entities, the Seam Application Framework classes and the relevant views for the CRUD application.
it_it: Scrivere <literal>./seam generate-entities</literal> nella directory base della distribuzione Seam. Verrano creati gli entity, le classi del Seam Application Framework e le viste rilevanti per l'applicazione CRUD.
ja_jp: Seam ディストリビューションのベースディレクトリで <literal>./seam generate-entities</literal> と入力してください。これにより、エンティティや Seam アプリケーションフレームワーククラス、CRUD アプリケーションの関連するビューが作成されます。

source: That's it...no really...that's it. Build and deploy as before and see for yourself.
it_it: Ecco fatto. Fare il build ed il deploy come prima ed osservare i risultati.
ja_jp: これで完成...本当に...これで完成です。 前のようにビルドしてデプロイして、自分で確かめてみてください。

source: Hook up drools authentication using your new CRUD application
it_it: Agganciare l'autenticazione Drools usando la nuova applicazione CRUD
ja_jp: 生成したCRUD アプリケーションへの Drools 認証の組み込み

source: As stated above this section assumes your database had a <literal>User</literal> table with <literal>username</literal> and <literal>password</literal> columns with at least one entry. If you don't have this you may need to modify the <literal>authenticate</literal> method below.
it_it: Come detto sopra questa sezione assume che il database abbia una tabella <literal>User</literal> con le colonne <literal>username</literal> e <literal>password</literal> con almeno una riga. Altrimenti occorre modificare il metodo <literal>authenticate</literal>.
ja_jp: 上記で述べたように、ここでは <literal>username</literal> と <literal>password</literal> のカラムを持つ <literal>User</literal> テーブルと、少なくとも一つのエントリを持つデータベースがあることを想定しています。もしデータベースがなければ、以下の <literal>authenticate</literal> メソッドを修正する必要があります。

source: Lets link our <literal>User</literal> entity into Seam Security by making our authenticator class a Stateless Session Bean (OC4J is a EJB3 container after all!):
it_it: Si colleghi l'entity <literal>User</literal> a Seam Security rendendo la classe authenticator un Stateless Session Bean (OC4J è dopotutto un EJB3 container!):
ja_jp: authenticator クラスをステートレスセッション Bean にすることによって、<literal>User</literal> エンティティを Seam セキュリティにリンクします (OC4J は要するに EJB3 コンテナです!)。

source: Add the <literal>@Stateless</literal> annotation to the <literal>Authenticator</literal> class.
it_it: Aggiungere l'annotazione <literal>@Stateless</literal> alla classe <literal>Authenticator</literal>.
ja_jp: <literal>@Stateless</literal> アノテーションを <literal>Authenticator</literal> クラスに付与します。

source: Rename the class to <literal>AuthenticatorAction</literal>
it_it: Rinominare la classe in <literal>AuthenticatorAction</literal>
ja_jp: クラス名を <literal>AuthenticatorAction</literal> に変更します。
