Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Persistence.po
Languages: it_it, ja_jp

source: To configure Hibernate managed transactions declare the following in your components.xml where <literal>#{hibernateSession}</literal> is the name of the project's <literal>persistence:managed-hibernate-session</literal> component. If your managed hibernate session is named <literal>session</literal>, you can opt to leave out the <literal>session</literal> attribute. (see <link linkend="persistence.seam-managed-persistence-contexts">Seam-managed persistence contexts</link> )
it_it: Per configurare le transazioni gestite da Hibernate si dichiari il seguente in components.xml dove <literal>#{hibernateSession}</literal> è il nome del componente del progetto <literal>persistence:managed-hibernate-session</literal>. Se la sessione Hibernate è chiamata <literal>session</literal>, si può optare di lasciare vuoto l'attributo <literal>session</literal>. (Si veda <link linkend="persistence.seam-managed-persistence-contexts">contesti di persistenza gestiti da Seam</link> )
ja_jp: Hibernate 管理トランザクションを設定するには 次を components.xml で宣言します。 <literal>#{hibernateSession}</literal> はプロジェクトの <literal>persistence:managed-hibernate-session</literal> コンポーネント名です。 管理 Hibernate セッション名が <literal>session</literal> なら <literal>session</literal> 属性を省略することができます。 (<link linkend="persistence.seam-managed-persistence-contexts">Seam 管理の永続コンテキスト</link> を参照)

source: To explicitly disable Seam managed transactions declare the following in your components.xml:
it_it: Per disabilitare esplicitamente le transazioni gestite da Seam si dichiari in components.xml:
ja_jp: Seam 管理トランザクションを明示的に無効にするには次を components.xml で宣言します。

source: For configuring Spring managed transactions see <link linkend="spring-transactions">using Spring PlatformTransactionManagement</link> .
it_it: Per configurare le transazioni gestite da Spring si veda <link linkend="spring-transactions">uso di Spring PlatformTransactionManagement</link> .
ja_jp: Spring 管理トランザクションについては <link linkend="spring-transactions">Spring の PlatformTransactionManagement を使用する</link> を参照してください。

source: Transaction synchronization
it_it: Sincronizzazione delle transazioni
ja_jp: トランザクションの同期化

source: Transaction synchronization provides callbacks for transaction related events such as <literal>beforeCompletion()</literal> and <literal>afterCompletion()</literal>. By default, Seam uses it's own transaction synchronization component which requires explicit use of the Seam transaction component when committing a transaction to ensure synchronization callbacks are correctly executed. If in a Java EE 5 environment the <literal>&lt;transaction:ejb-transaction/&gt;</literal> component should be be declared in <literal>components.xml</literal> to ensure that Seam synchronization callbacks are correctly called if the container commits a transaction outside of Seam's knowledge.
it_it: La sincronizzazione della transazioni fornisce callback per gli eventi relazionati alle transazioni come <literal>beforeCompletion()</literal> e <literal>afterCompletion()</literal>. Di default, Seam usa un proprio componente per la sincronizzazione delle transazioni, il quale richiede un uso esplicito del componente per le transazioni di Seam quando si esegue il commit di una transazione per assicurarsi che le callback vengano correttamente eseguite. Se si è in ambiente Java EE 5, il componente <literal>&lt;transaction:ejb-transaction/&gt;</literal> dovrebbe essere dichiarato in <literal>components.xml</literal> per assicurarsi che le callback per la sincronizzazione di Seam vengano correttamente chiamate se il container esegue il commit di una transazione non nota a Seam.
ja_jp: トランザクションの同期化は <literal>beforeCompletion()</literal> や <literal>afterCompletion()</literal> などトランザクション関連のイベントにコールバックを提供します。 デフォルトでは Seam はそれ自体のトランザクション同期化コンポーネントを使用します。 このコンポーネントは同期化のコールバックが必ず正しく実行されるようトランザクションをコミットするときに Seam トランザクションコンポーネントを明示的に使用することを必要とします。 Java EE 5 環境では <literal>&lt;transaction:ejb-transaction/&gt;</literal> コンポーネントを <literal>components.xml</literal> で宣言し、 コンテナが Seam の認識範囲外にトランザクションをコミットする場合には Seam 同期化のコールバックが正しく呼び出されるようにしてください。

source: Seam-managed persistence contexts
it_it: Contesti di persistenza gestiti da Seam
ja_jp: Seam 管理の永続コンテキスト

source: If you're using Seam outside of a Java EE 5 environment, you can't rely upon the container to manage the persistence context lifecycle for you. Even if you are in an EE 5 environment, you might have a complex application with many loosly coupled components that collaborate together in the scope of a single conversation, and in this case you might find that propagation of the persistence context between component is tricky and error-prone.
it_it: Se si usa Seam fuori dall'ambiente Java EE 5, non si può fare affidamento al container per gestire il ciclo di vita del contesto di persistenza. Anche in ambiente Java EE 5, si potrebbero avere applicazioni complesse con molti componenti disaccoppiati che collaborano assieme nello scope di una singola conversazione, ed in questo caso si potrebbe ritenere che la propagazione del contesto di persistenza tra componenti sia insidiosa ed incline a errori.
ja_jp: Seam を Java EE 5 環境の外で使用している場合、 コンテナによる永続コンテキストのライフサイクルの管理は期待できません。 EE 5 環境であっても、 単一の対話の範囲内で連携する多くの疎結合コンポーネントを持つ複雑なアプリケーションがあるかもしれず、 この場合にはコンポーネント間での永続コンテキストの伝播が簡単ではなくエラーが発生しやすい場合があります。

source: In either case, you'll need to use a <emphasis>managed persistence context</emphasis> (for JPA) or a <emphasis>managed session</emphasis> (for Hibernate) in your components. A Seam-managed persistence context is just a built-in Seam component that manages an instance of <literal>EntityManager</literal> or <literal>Session</literal> in the conversation context. You can inject it with <literal>@In</literal>.
it_it: In entrambi i casi occorre usare nei componenti un <emphasis>contesto di persistenza gestito</emphasis> (per JPA) od una <emphasis>sessione gestita</emphasis> (per Hibernate). Un contesto di persistenza gestito da Seam è soltanto un componente predefinito di Seam che gestisce un istanza di <literal>EntityManager</literal> o <literal>Session</literal> nel contesto di conversazione. Questo può essere iniettato con <literal>@In</literal>.
ja_jp: いずれの場合でも、 コンポーネントで <emphasis>管理永続コンテキスト</emphasis> (JPA 用) または <emphasis>管理セッション</emphasis> (Hibernate 用) のいずれかを使用する必要があります。 Seam 管理永続コンテキストは単に組み込みの Seam コンポーネントです。 対話コンテキストで <literal>EntityManager</literal> または <literal>Session</literal> のインスタンスを管理します。 <literal>@In</literal> でインジェクトすることができます。

source: Seam-managed persistence contexts are extremely efficient in a clustered environment. Seam is able to perform an optimization that EJB 3.0 specification does not allow containers to use for container-managed extended persistence contexts. Seam supports transparent failover of extended persisence contexts, without the need to replicate any persistence context state between nodes. (We hope to fix this oversight in the next revision of the EJB spec.)
it_it: I contesti di persistenza gestiti da Seam sono estremamente efficienti in un ambiente cluster. Seam è capace di eseguire un'ottimizzazione che la specifica EJB 3.0 non consente di usare ai container per contesti di persistenza estesi gestiti dal container. Seam supporta un failover trasparente dei contesti di persistenza estesi, senza il bisogno di replicare i contesti di persistenza tra i nodi. (Si spera che nella prossima revisione della specifica EJB questo problema venga corretto.)
ja_jp: Seam 管理の永続コンテキストはクラスタ化された環境で非常に効率的です。 EJB 3.0 の仕様ではコンテナがコンテナ管理拡張永続コンテキストに対して行うことが許可されていないような最適化を Seam は実行することができます。 ノード間の永続コンテキストの状態を複製することなく拡張永続コンテキストの透過的なフェールオーバーをサポートします。 (この見過ごされてしまった点については、 次回の EJB 仕様のリビジョンで修正したいと考えています。)

source: Using a Seam-managed persistence context with JPA
it_it: Utilizzo di un contesto di persistenza gestito da Seam con JPA
ja_jp: JPA で Seam 管理の永続コンテキストを使用する

source: Configuring a managed persistence context is easy. In <literal>components.xml</literal>, we can write:
it_it: E' facile configurare un contesto di persistenza gestito. Si scriva in <literal>components.xml</literal>:
ja_jp: 管理永続コンテキストの設定は簡単です。 <literal>components.xml</literal> 内に次のように記述します。

source: This configuration creates a conversation-scoped Seam component named <literal>bookingDatabase</literal> that manages the lifecycle of <literal>EntityManager</literal> instances for the persistence unit (<literal>EntityManagerFactory</literal> instance) with JNDI name <literal>java:/EntityManagerFactories/bookingData</literal>.
it_it: Questa configurazione crea un componente Seam con scope conversazione chiamato <literal>bookingDatabase</literal>, il quale gestisce il ciclo di vita delle istanze <literal>EntityManager</literal> per l'unità di persistenza (istanza <literal>EntityManagerFactory</literal>) con il nome JNDI <literal>java:/EntityManagerFactories/bookingData</literal>.
ja_jp: この設定により対話スコープの <literal>bookingDatabase</literal> という名前の Seam コンポーネントが作成され、 JNDI 名 <literal>java:/EntityManagerFactories/bookingData</literal> を持つ永続ユニット (<literal>EntityManagerFactory</literal> インスタンス) の <literal>EntityManager</literal> インスタンスの寿命を管理します。

source: Of course, you need to make sure that you have bound the <literal>EntityManagerFactory</literal> into JNDI. In JBoss, you can do this by adding the following property setting to <literal>persistence.xml</literal>.
it_it: Certamente occorre assicurarsi che <literal>EntityManagerFactory</literal> sia stato associato a JNDI. In JBoss si può fare ciò aggiungendo la seguente proprietà a <literal>persistence.xml</literal>.
ja_jp: 当然、 <literal>EntityManagerFactory</literal> が JNDI にバウンドされたことを確認する必要があります。 JBoss では、 次のプロパティ設定を <literal>persistence.xml</literal> に追加すると確認を行うことができます。

source: Now we can have our <literal>EntityManager</literal> injected using:
it_it: Ora si può iniettare <literal>EntityManager</literal> usando:
ja_jp: これで次のように <literal>EntityManager</literal> をインジェクトできます。

source: If you are using EJB3 and mark your class or method <literal>@TransactionAttribute(REQUIRES_NEW)</literal> then the transaction and persistence context shouldn't be propagated to method calls on this object. However as the Seam-managed persistence context is propagated to any component within the conversation, it will be propagated to methods marked <literal>REQUIRES_NEW</literal>. Therefore, if you mark a method <literal>REQUIRES_NEW</literal> then you should access the entity manager using @PersistenceContext.
it_it: Se si usa EJB3 e si marca una classe od un metodo con <literal>@TransactionAttribute(REQUIRES_NEW)</literal> allora la transazione ed il contesto di persistenza non dovrebbero essere propagati sulle chiamate del metodo sull'oggetto. Comunque il contesto di persistenza gestito da Seam viene propagato a qualsiasi componente dentro la conversazione, verrà propagato ai metodi marcati con <literal>REQUIRES_NEW</literal>.QUindi, se si marca un metodo con <literal>REQUIRES_NEW</literal>, allora bisognerebbe accedere all'entity manager usando @PersistenceContext.
ja_jp: EJB 3 を使用していてクラスまたはメソッドに <literal>@TransactionAttribute(REQUIRES_NEW)</literal> をマークするとトランザクションと永続コンテキストはこのオブジェクトでのメソッドコールには伝播されないはずです。 ただし、 Seam 管理の永続コンテキストは対話内でいずれのコンポーネントにも伝播されるため <literal>REQUIRES_NEW</literal> とマークされたメソッドにも伝播されます。 したがって、 メソッドに <literal>REQUIRES_NEW</literal> をマークする場合は @PersistenceContext を使ってエンティティマネージャにアクセスしてください。

source: Using a Seam-managed Hibernate session
it_it: Uso delle sessioni Hibernate gestite da Seam
ja_jp: Seam 管理の Hibernate セッションを使用する

source: Seam-managed Hibernate sessions are similar. In <literal>components.xml</literal>:
it_it: Le sessioni Hibernate gestite da Seam sono simili. In <literal>components.xml</literal>:
ja_jp: Seam 管理 Hibernate セッションも同様に<literal>components.xml</literal> で次のように記述することができます。

source: Where <literal>java:/bookingSessionFactory</literal> is the name of the session factory specified in <literal>hibernate.cfg.xml</literal>.
it_it: Dove <literal>java:/bookingSessionFactory</literal> è il nome della session factory specificata in <literal>hibernate.cfg.xml</literal>.
ja_jp: <literal>java:/bookingSessionFactory</literal> は <literal>hibernate.cfg.xml</literal> で指定されるセッションファクトリ名にします。

source: Note that Seam does not flush the session, so you should always enable <literal>hibernate.transaction.flush_before_completion</literal> to ensure that the session is automatically flushed before the JTA transaction commits.
it_it: Si noti che Seam non esegue il flush della sessione, quindi occorre sempre abilitare <literal>hibernate.transaction.flush_before_completion</literal> per assicurarsi che di eseguire il flush della sessione prima che venga fatto il commit della transazioni JTA.
ja_jp: Seam はセッションをフラッシュしないので、 <literal>hibernate.transaction.flush_before_completion</literal> を常に有効にしてセッションが JTA トランザクションのコミットより先に自動的にフラッシュされるようにしなければならないので注意してください。

source: We can now have a managed Hibernate <literal>Session</literal> injected into our JavaBean components using the following code:
it_it: Ora si può iniettare nei componenti JavaBean una <literal>Session</literal> di Hibernate gestita usando il seguente codice:
ja_jp: これで、 次のコードを使って JavaBean コンポーネントに管理 Hibernate <literal>Session</literal> をインジェクトできます。

source: Seam-managed persistence contexts and atomic conversations
it_it: Contesti di persistenza gestiti da Seam e conversazioni atomiche
ja_jp: Seam 管理の永続コンテキストとアトミックな対話

source: Persistence contexts scoped to the conversation allows you to program optimistic transactions that span multiple requests to the server without the need to use the <literal>merge()</literal> operation , without the need to re-load data at the beginning of each request, and without the need to wrestle with the <literal>LazyInitializationException</literal> or <literal>NonUniqueObjectException</literal>.
it_it: I contesti di persistenza con scope conversazione consentono di programmare transazioni ottimistiche che propagano richieste multiple al server senza il bisogno di usare l'operazione <literal>merge()</literal>, senza il bisogno di ricaricare i dati all'inizio di ogni richiesta, e senza il bisogno di scontrarsi con <literal>LazyInitializationException</literal> o <literal>NonUniqueObjectException</literal>.
ja_jp: <literal>merge()</literal> 演算を使用したり、 各要求の冒頭でデータを再ロードしたり、 <literal>LazyInitializationException</literal> や <literal>NonUniqueObjectException</literal> と格闘しなくとも、 対話にスコープされる永続コンテキストによりサーバーに対して複数の要求にまたがる楽観的なトランザクションをプログラムすることができるようになります。

source: As with any optimistic transaction management, transaction isolation and consistency can be achieved via use of optimistic locking. Fortunately, both Hibernate and EJB 3.0 make it very easy to use optimistic locking, by providing the <literal>@Version</literal> annotation.
it_it: Come ogni altra gestione ottimistica delle transazioni , l'isolamento e la consistenza delle transazioni può essere ottenuta tramite l'uso del lock ottimistico. Fortunatamente sia Hibernate che EJB 3.0 semplificano l'uso del lock ottimistico, fornendo l'annotazione <literal>@Version</literal>.
ja_jp: 楽観的トランザクション管理では楽観的ロックでトランザクションの隔離と一貫性を実現します。幸い、 Hibernate と EJB 3.0 いずれも <literal>@Version</literal> アノテーションを提供することで楽観的ロックの使用を容易にしています。

source: By default, the persistence context is flushed (synchronized with the database) at the end of each transaction. This is sometimes the desired behavior. But very often, we would prefer that all changes are held in memory and only written to the database when the conversation ends successfully. This allows for truly atomic conversations. As the result of a truly stupid and shortsighted decision by certain non-JBoss, non-Sun and non-Sybase members of the EJB 3.0 expert group, there is currently no simple, usable and portable way to implement atomic conversations using EJB 3.0 persistence. However, Hibernate provides this feature as a vendor extension to the <literal>FlushModeType</literal>s defined by the specification, and it is our expectation that other vendors will soon provide a similar extension.
it_it: DI default il contesto di persistenza viene "flushato" (sicronizzato con il database) alla fine di ogni transazione. Questo è a volte il comportamento desirato. Ma molto spesso si preferisce che tutti i cambiamenti siano mantenuti in memoria e scritti nel database solo quando la conversazione termina con successo. Questo consente conversazioni veramente atomiche. Come risultato di una decisione molto stupida e poco lungimirante da parte di alcuni (non-JBoss, non-Sun e non-Sybase) membri del gruppo esperti EJB 3.0, non c'è attualmente nessun modo semplice, utilizzabile e portabile per implementare conversazioni atomiche usando la persistenza EJB 3.0. Comunque Hibernate fornisce questa funzionalità come estensione vendor a <literal>FlushModeType</literal> definito dalla specifica, e ci si attende che altri vendor presto forniscano una simile estensione.
ja_jp: デフォルトでは、 永続コンテキストは各トランザクションの終わりでフラッシュされます (データベースと同期される)。 これが目的の動作である場合もありますが、 すべての変更はメモリに保持され対話が正常に終了したときにのみデータベースに書き込まれる動作を期待することの方が多いでしょう。 これにより真にアトミックな対話を可能にします。 EJB 3.0 エキスパートグループの中の JBoss、 Sun、 Sybase 以外の特定のメンバーによって長期的な見通しを考慮に入れず短絡的な決定がなされてしまったため、 EJB 3.0 永続を使用したアトミックな対話の実装を行うシンプルで使用に適したポータブルな方法が現在ありません。 ただし、 Hibernate では仕様により定義される <literal>FlushModeType</literal> に対するベンダー拡張としてこの機能を提供しています。 また、 他のベンダーもじきに同様の拡張を提供するだろうことを期待しています。

source: Seam lets you specify <literal>FlushModeType.MANUAL</literal> when beginning a conversation. Currently, this works only when Hibernate is the underlying persistence provider, but we plan to support other equivalent vendor extensions.
it_it: Seam consente di specificare <literal>FlushModeType.MANUAL</literal> all'inizio di un conversazione. Attualmente questo funziona solo quando Hibernate è il provider di persistenza sottostante, ma si è pianificato di supportare altre estensioni dei vendor.
ja_jp: Seam では対話の開始時に <literal>FlushModeType.MANUAL</literal> を指定することができます。 現在は Hibernate が永続を実現する構成要素である場合にのみ機能しますが、 他のベンダーによる同等の拡張もサポートする予定です。

source: Now, the <literal>claim</literal> object remains managed by the persistence context for the rest ot the conversation. We can make changes to the claim:
it_it: Ora l'oggetto <literal>claim</literal> viene gestito nel contesto di persistenza per il resto della conversazione. Si possono apportare modifiche a claim:
ja_jp: これで <literal>claim</literal> オブジェクトは対話の残りの間、 永続コンテキストによって管理され続けます。 この claim に変更を加えることができます。

source: But these changes will not be flushed to the database until we explicitly force the flush to occur:
it_it: Ma questi cambiamenti non verranno eseguiti nel database finché non si forza esplicitamente il flush:
ja_jp: ただし、 これらの変更は明示的にフラッシュが発生するよう強制するまではデータベースに対してフラッシュされません。

source: Of course, you could set the <literal>flushMode</literal> to <literal>MANUAL</literal> from pages.xml, for example in a navigation rule:
it_it: Certamente si può impostare <literal>flushMode</literal> a <literal>MANUAL</literal> da pages.xml, per esempio in una regola di navigazione:
ja_jp: 当然、 pages.xml から <literal>flushMode</literal> を <literal>MANUAL</literal> にセットすることができます。 たとえばナビゲーション規則では以下のようになります。

source: You can set any Seam Managed Persistence Context to use manual flush mode:
it_it: Si può impostare qualsiasi Contesto di Persistenza Gestito da Seam alla modalità flush manuale:
ja_jp: いずれの Seam 管理永続コンテキストに対しても手動によるフラッシュモードを使用するよう設定することができます。

source: Using the JPA "delegate"
it_it: Usare il JPA "delegate"
ja_jp: JPA 「デリゲート」を使用する

source: The <literal>EntityManager</literal> interface lets you access a vendor-specific API via the <literal>getDelegate()</literal> method. Naturally, the most interesting vendor is Hibernate, and the most powerful delegate interface is <literal>org.hibernate.Session</literal>. You'd be nuts to use anything else. Trust me, I'm not biased at all. If you must use a different JPA provider see <link linkend="alt-jpa-providers">Using Alternate JPA Providers</link>.
it_it: L'interfaccia <literal>EntityManager</literal> consente di accedere all'API specifica dei vendor tramite il metodo <literal>getDelegate()</literal>. Naturalmente il vendor più interessante è Hibernate, e l'interfaccia delegate più potente è <literal>org.hibernate.Session</literal>. Se si deve usare un diverso provider JPA si veda <link linkend="alt-jpa-providers">Uso di provider JPA alternativi</link>.
ja_jp: <literal>EntityManager</literal> インタフェースにより <literal>getDelegate()</literal> メソッドを通じてベンダー固有の API にアクセスすることができます。 必然的に、 Hibernate が最も関心の高いベンダーとなり、 <literal>org.hibernate.Session</literal> が最も強力となるデリゲートインタフェースになります。 これ以外を使用するのがばかばかしくなるほどです。 これは偏見抜きの意見です。 別の JPA プロバイダを使用しなければならない場合は <link linkend="alt-jpa-providers">代替の JPA プロバイダを使用する</link> をご覧ください。

source: But regardless of whether you're using Hibernate (genius!) or something else (masochist, or just not very bright), you'll almost certainly want to use the delegate in your Seam components from time to time. One approach would be the following:
it_it: Ma indipendentemente dal fatto che si stia usando Hibernate (se siete dei geni!) o altro (se siete dei masochisti, o semplicemente non siete troppo svegli), quasi sicuramente, di quando in quando, nei componenti Seam si vorrà usare il delegato. Un approccio potrebbe essere il seguente:
ja_jp: ただし、 Hibernate またはそれ以外のものいずれを使用するかに限らず、 いずれは Seam コンポーネントでデリゲートを使用したくなる場合がくるでしょう。 以下にその一例を示します。

source: But typecasts are unquestionably the ugliest syntax in the Java language, so most people avoid them whenever possible. Here's a different way to get at the delegate. First, add the following line to <literal>components.xml</literal>:
it_it: Tuttavia i cast fra tipi sono senza discussione la sintassi più repellente del linguaggio java, così che la maggior parte della gente li evita quando possibile. Ecco un modo diverso per ottenere il delegato. Innanzitutto si aggiunga la linea seguente in <literal>components.xml</literal>:
ja_jp: 型キャストは Java 言語の中でも間違いなく繁雑な構文になるため、 できる限り避けるのが一般的です。 デリゲートで取得する別の方法を次に示します。 まず、 以下の行を <literal>components.xml</literal> に追加します。

source: Now we can inject the session directly:
it_it: Ora si può iniettare la sessione direttamente:
ja_jp: これでセッションを直接インジェクトできるようになります。

source: Using EL in EJB-QL/HQL
it_it: Uso di EL in EJB-QL/HQL
ja_jp: EJB-QL/HQL で EL を使用する方法

source: Seam proxies the <literal>EntityManager</literal> or <literal>Session</literal> object whenever you use a Seam-managed persistence context or inject a container managed persistence context using <literal>@PersistenceContext</literal>. This lets you use EL expressions in your query strings, safely and efficiently. For example, this:
it_it: Seam fa da proxy all'oggetto <literal>EntityManager</literal> o all'oggetto <literal>Session</literal> ogni volta che si utilizza un contesto di persistenza gestito da Seam o si inietta un contesto di persistenza gestito dal container usando <literal>@PersistenceContext</literal>. Ciò permette di utilizzare le espressioni EL nelle stringhe delle query, in modo sicuro ed efficiente. Per esempio:
ja_jp: Seam 管理の永続コンテキストを使用する場合や <literal>@PersistenceContext</literal> を使ってコンテナ管理の永続コンテキストをインジェクトする場合、 Seam は <literal>EntityManager</literal> または <literal>Session</literal> オブジェクトをプロキシします。 これにより、 EL 式をクエリー文字列内で安全かつ効果的に使用することができるようになります。 たとえば、 次を見てください。

source: is equivalent to:
it_it: è equivalente a:
ja_jp: 上記の例は、 以下の例と同等になります。

source: Of course, you should never, ever write it like this:
it_it: Certamente non si dovrà mai e poi mai scrivere qualcosa del tipo:
ja_jp: 当然、 次のようには絶対に記述しないでください。

source: (It is inefficient and vulnerable to SQL injection attacks.)
it_it: (è inefficiente e vulnerabile ad attacchi di SQL injection.)
ja_jp: (効率が悪く、 SQL インジェクション攻撃に対して脆弱となります。)

source: Using Hibernate filters
it_it: Uso dei filtri Hibernate
ja_jp: Hibernate フィルタを使用する
