Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Persistence.po
Languages: it_it, ja_jp

source: The coolest, and most unique, feature of Hibernate is <emphasis>filters</emphasis>. Filters let you provide a restricted view of the data in the database. You can find out more about filters in the Hibernate documentation. But we thought we'd mention an easy way to incorporate filters into a Seam application, one that works especially well with the Seam Application Framework.
it_it: La funzionalità più bella e unica di Hibernate sono i <emphasis>filtri</emphasis>. I filtri permettono di fornire una vista ristretta dei dati esistenti nel database. E' possibile scoprire di più riguardo ai filtri nella documentazione di Hibernate. Abbiamo tuttavia pensato di menzionare un modo facile di incorporare i filtri in un'applicazione Seam, un modo che funziona particolarmente bene con il "Seam Application Framework".
ja_jp: Hibernate 固有の斬新な機能が <emphasis>フィルタ</emphasis> になります。 フィルタによりデータベース内のデータ表示に制限を与えることができるようになります。 フィルタについては Hibernate のドキュメントで詳細に説明されています。 ここでは、 フィルタを Seam アプリケーションに統合する簡単な方法を記載しておくのがよいだろうと思います。 特に Seam Application Framework でうまく動作する方法を説明します。

source: Seam-managed persistence contexts may have a list of filters defined, which will be enabled whenever an <literal>EntityManager</literal> or Hibernate <literal>Session</literal> is first created. (Of course, they may only be used when Hibernate is the underlying persistence provider.)
it_it: I contesti di persistenza gestiti da Seam possono avere una lista di filtri definiti, che verrà abilitata quando viene creato un <literal>EntityManager</literal> od una <literal>Session</literal> di Hibernate. (Certamente possono essere utilizzati solo quando Hibernare è il provider di persistenza sottostante.)
ja_jp: Seam 管理の永続コンテキストはフィルタの一覧を定義することができます。 これらは <literal>EntityManager</literal> や Hibernate <literal>Session</literal> がはじめて作成されたときに有効になります。 (当然、 Hibernate が永続を実現する構成要素である場合にのみ使用できます。)
