Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Persistence.po
Languages: it_it, ja_jp

source: Seam and Object/Relational Mapping
it_it: Seam e Object/Relational Mapping
ja_jp: Seam とオブジェクト／リレーショナルマッピング

source: Seam provides extensive support for the two most popular persistence architectures for Java: Hibernate3, and the Java Persistence API introduced with EJB 3.0. Seam's unique state-management architecture allows the most sophisticated ORM integration of any web application framework.
it_it: Seam fornisce un supporto esteso alle due maggiori e più popolari architetture per la persistenza in Java: Hibernate3 e Java Persistence API introdotta con EJB 3.0. L'architettura unica di Seam per la gestione dello stato consente l'integrazione dei più sofisticati ORM di ogni framework per applicazioni web.
ja_jp: Seam は EJB 3.0 で導入される Java Persistence API および Hibernate3 の二つの最も一般的な Java 用永続アーキテクチャに対して広範なサポートを提供します。 Seam 固有の状態管理アーキテクチャにより、 いかなるウェブアプリケーションフレームワークからも高度な ORM 統合を実現します。

source: Introduction
it_it: Introduzione
ja_jp: はじめに

source: Seam grew out of the frustration of the Hibernate team with the statelessness typical of the previous generation of Java application architectures. The state management architecture of Seam was originally designed to solve problems relating to persistence &#8212; in particular problems associated with <emphasis>optimistic transaction processing</emphasis>. Scalable online applications always use optimistic transactions. An atomic (database/JTA) level transaction should not span a user interaction unless the application is designed to support only a very small number of concurrent clients. But almost all interesting work involves first displaying data to a user, and then, slightly later, updating the same data. So Hibernate was designed to support the idea of a persistence context which spanned an optimistic transaction.
it_it: Seam è nato dalla frustrazione del team di Hibernate per l'assenza di contesto stateless tipica delle precedenti generazioni di architetture nelle applicazioni Java. L'architettura della gestione dello stato di Seam è stata originariamente progettata per risolvere problemi relativi alla persistenza &#8212; in particolare i problemi associati all'<emphasis>elaborazione ottimistica delle transazioni</emphasis>. Le applicazioni online scalabili usano sempre transazioni ottimistiche. Una transazione atomica di livello (database/JTA) non dovrebbe propagare l'interazione dell'utente amenoché l'applicazione sia progettata per supportare solo un piccolo numero di client concorrenti. Ma quasi tutto il lavoro interessante coinvolge in primo luogo la visualizzazione dei dati all'utente, e poi, immediatamente dopo, l'aggiornamento dei dati stessi. Quindi Hibernate è stato progettato per supportare l'idea del contesto di persistenza che propaga una transazione ottimistica.

source: Unfortunately, the so-called "stateless" architectures that preceded Seam and EJB 3.0 had no construct for representing an optimistic transaction. So, instead, these architectures provided persistence contexts scoped to the atomic transaction. Of course, this resulted in many problems for users, and is the cause of the number one user complaint about Hibernate: the dreaded <literal>LazyInitializationException</literal>. What we need is a construct for representing an optimistic transaction in the application tier.
it_it: Sfortunatamente le cosiddette architetture "stateless" che precedettero Seam e EJB 3.0 non avevano alcun costrutto per rappresentare una transazione ottimistica. Quindi, invece, queste architetture fornivano contesti di persistenza con scope a livello di transazione atomica. Sicuramente questo portava diversi problemi agli utenti ed è la causa numero uno per le lamentele riguardanti Hibernate: la temuta <literal>LazyInitializationException</literal>. Ciò di cui si ha bisogno è un costrutto per rappresentare una transazione ottimistica a livello applicazione.
ja_jp: 残念ながら、 Seam や EJB 3.0 より以前の「ステートレス」と呼ばれるアーキテクチャには楽観的なトランザクションを表現するための構成概念がありませんでした。 このため、 代わりにアトミックなトランザクションに対してスコープされる永続コンテキストを提供していました。 当然、 これはユーザーにとって多くの問題を引き起こし、 また Hibernate に関するユーザーからの最大の苦情、恐怖の <literal>LazyInitializationException</literal> の原因でもあります。 ここで必要なのはアプリケーション層で楽観的トランザクションを表現する構成概念なのです。

source: EJB 3.0 recognizes this problem, and introduces the idea of a stateful component (a stateful session bean) with an <emphasis>extended persistence context</emphasis> scoped to the lifetime of the component. This is a partial solution to the problem (and is a useful construct in and of itself) however there are two problems:
it_it: EJB 3.0 riconosce il problema e introduce l'idea di componente stateful (un bean di sessione stateful) con un <emphasis>contesto di persistenza esteso</emphasis> con scope legato al ciclo di vita del componente. Questa è una soluzione parziale al problema (ed è un utile costrutto), comunque ci sono due problemi:
ja_jp: EJB 3.0 はこの問題を認識し、 コンポーネントの寿命に対してスコープされる <emphasis>拡張永続コンテキスト</emphasis> を持ったステートフルなコンポーネント (ステートフルセッション Bean) というアイデアを導入します。 これは問題に関して完全なソリューションではありませんが (それ自体は便利な構成です) 、 二つの問題があります。

source: The lifecycle of the stateful session bean must be managed manually via code in the web tier (it turns out that this is a subtle problem and much more difficult in practice than it sounds).
it_it: Il ciclo di vita del bean di sessione stateful deve essere gestito manualmente via codice a livello web (risulta che questo è un problema sottile e molto più difficile in pratica di quanto sembri).
ja_jp: ステートフルセッション Bean の寿命はウェブ層でコード経由により手作業で管理されなければなりません (これは微妙な問題であり実際にはかなり困難であることがわかります)。

source: Propagation of the persistence context between stateful components in the same optimistic transaction is possible, but tricky.
it_it: La propagazione del contesto di persistenza tra componenti stateful nella stessa transazione ottimistica è possibile, ma pericolosa.
ja_jp: 同じ楽観的トランザクション内のステートフルコンポーネント間での永続コンテキストの伝播は可能ですが簡単ではありません。

source: Seam solves the first problem by providing conversations, and stateful session bean components scoped to the conversation. (Most conversations actually represent optimistic transactions in the data layer.) This is sufficient for many simple applications (such as the Seam booking demo) where persistence context propagation is not needed. For more complex applications, with many loosly-interacting components in each conversation, propagation of the persistence context across components becomes an important issue. So Seam extends the persistence context management model of EJB 3.0, to provide conversation-scoped extended persistence contexts.
it_it: Seam risolve il primo problema fornendo conversazioni, componenti bean di sessione stateful con scope di conversazione. (La maggior parte delle conversazioni in verità rappresentano transazioni ottimistiche a livello dei dati). Questo è sufficiente per molte semplici applicazioni (quali la demo prenotazione di Seam) dove non serve la propagazione del contesto di persistenza. Per applicazioni più complesse, con molti componenti interagenti in modo stretto in ciascuna conversazione, la propagazione del contesto di persistenza tra componenti diventa un problema importante. Quindi Seam estende il modello di gestione del contesto di persistenza di EJB 3.0 per fornire contesti di persistenza estesi e con scope di conversazione.
ja_jp: Seam は、 対話および対話に対してスコープされるステートフルセッション Bean コンポーネントを提供することにより 1 番目の問題を解決します。 (ほとんどの対話は実際にはデータ層で楽観的トランザクションを表示します。) 永続コンテキストの伝播を必要としないような多くのシンプルなアプリケーション (Seam ブッキングデモなど) にはこれで十分です。 各対話内で疎に作用しあっているコンポーネントを多く持っているようなもう少し複雑なアプリケーションの場合、 コンポーネント群全体への永続コンテキストの伝播は重要な問題となります。 このため、 Seam は EJB 3.0 の永続コンテキスト管理モデルを拡張して対話スコープの拡張永続コンテキストを提供しています。

source: Seam managed transactions
it_it: Transazioni gestite da Seam
ja_jp: Seam 管理トランザクション

source: EJB session beans feature declarative transaction management. The EJB container is able to start a transaction transparently when the bean is invoked, and end it when the invocation ends. If we write a session bean method that acts as a JSF action listener, we can do all the work associated with that action in one transaction, and be sure that it is committed or rolled back when we finish processing the action. This is a great feature, and all that is needed by some Seam applications.
it_it: I bean di sessione EJB includono la gestione dichiarativa delle transazioni. Il container EJB è capace di avviare una transazione in modo trasparente quando viene invocato il bean, e terminarla quando termina l'invocazione. Se si scrive un metodo di un bean di sessione che agisce come action listener JSF, si può fare tutto il lavoro associato all'azione in una transazione, ed essere sicuri che venga eseguito il commit od il rollback quando l'azione viene terminata. Questa è grande funzionalità ed è tutto ciò che serve ad alcune applicazioni Seam.
ja_jp: EJB セッション Bean は宣言型トランザクション管理を特長としています。 EJB コンテナは Bean が呼び出されると透過的にトランザクションを起動し、 呼出しが終了するとトランザクションも終了させることが可能です。 JSF アクションリスナーとして動作するセッション Bean メソッドを記述する場合、 そのアクションに関連するすべての作業を 1 つのトランザクションで行うことができ、 アクションの処理が完了したら必ずコミットまたはロールバックされるようにすることができます。 これは素晴らしい機能であり、 いくつかの Seam アプリケーションに必要とされるものはこれだけです。

source: However, there is a problem with this approach. A Seam application may not perform all data access for a request from a single method call to a session bean.
it_it: Comunque c'è un problema con tale approccio. Un'applicazione Seam potrebbe non eseguire l'accesso a tutti i dati per una richiesta da una chiamata di un singolo metodo a un bean di sessione.
ja_jp: ただし、 この方法には問題が 1 つあります。 Seam アプリケーションは一つの要求において、一つのセッション Bean への単一のメソッド呼び出しですべてのデータアクセスを終えるわけではない可能性があります。

source: The request might require processing by several loosely-coupled components, each of which is called independently from the web layer. It is common to see several or even many calls per request from the web layer to EJB components in Seam.
it_it: La richiesta può comportare di essere processata da diversi componenti poco accoppiati, ciascuno dei quali viene chiamato indipendentemente dal layer web. E' comune vedere parecchie chiamate per richiesta dal layer web ai componenti EJB in Seam.

source: Rendering of the view might require lazy fetching of associations.
it_it: La generazione della vista può richiedere il lazy fetching delle associazioni.
ja_jp: ビューのレンダリングには関連の遅延フェッチが必要な場合があります。

source: The more transactions per request, the more likely we are to encounter atomicity and isolation problems when our application is processing many concurrent requests. Certainly, all write operations should occur in the same transaction!
it_it: Più transazioni per richiesta ci sono, più è probabile che si incontrino problemi di atomicità e isolamento quando l'applicazione processa molte richieste concorrenti. Certamente tutte le operazioni di scrittura devono avvenire nella stessa transazione!
ja_jp: 1 要求ごとのトランザクション数が多くなると、 使用しているアプリケーションが多くの並列要求を処理している際にそれだけ多くのアトミック性と独立性の問題に遭遇する可能性が高くなります。 書き込み動作はすべて、 必ず、 同じトランザクション内で起こらなければならないからです。

source: Hibernate users developed the <emphasis>"open session in view"</emphasis> pattern to work around this problem. In the Hibernate community, "open session in view" was historically even more important because frameworks like Spring use transaction-scoped persistence contexts. So rendering the view would cause <literal>LazyInitializationException</literal>s when unfetched associations were accessed.
it_it: Gli utenti di Hibernate hanno sviluppato il pattern <emphasis>"open session in view"</emphasis> per aggirare questo problema. Nella comunità Hibernate, il pattern "open session in view" è stato storicamente anche più importante poiché framework come Spring usano contesti di persistenza con scope transazionale. In tal caso il rendering della vista causerebbe eccezioni di tipo <literal>LazyInitializationException</literal>, qualora si accedesse a delle relazioni non caricate in precedenza.
ja_jp: Hibernate ユーザーはこの問題を回避するため <emphasis>「open session in view」</emphasis> パターンを開発しました。 Spring のようなフレームワークはトランザクションスコープの永続コンテキストを使用しており、 ビューのレンダリングはフェッチされない関連がアクセスされると <literal>LazyInitializationException</literal> を引き起こすため、 Hibernate コミュニティでは「open session in view」は歴史的により重要でした。

source: This pattern is usually implemented as a single transaction which spans the entire request. There are several problems with this implementation, the most serious being that we can never be sure that a transaction is successful until we commit it &#8212; but by the time the "open session in view" transaction is committed, the view is fully rendered, and the rendered response may already have been flushed to the client. How can we notify the user that their transaction was unsuccessful?
it_it: Questo pattern di solito è implementato come una singola transazione che si estende per l'intera richiesta. Vi sono parecchi problemi connessi a questa implementaziome, il più serio dei quali sta nel fatto che non è possibile essere sicuri che una transazione sia andata a buon fine finché non se ne fa il commit &#8212; ma prima che la transazione gestita secondo tale pattern sia stata sottoposta a commit, la pagina sarà stata completamente disegnata, e la risposta relativa potrebbe essere già stata inviata al client. Come è possibile notificare l'utente che la sua transazione non ha avuto successo?

source: Seam solves both the transaction isolation problem and the association fetching problem, while working around the problems with "open session in view". The solution comes in two parts:
it_it: Seam risolve sia il problema dell'isolamento della transazione sia il problema del caricamento delle associazioni, evitando i quelli associati al pattern "open session in view". La soluzione è costituita da due parti:
ja_jp: Seam はトランザクション独立性の問題と関連フェッチの問題の両方を解決しながら、 「open session in view」に関する問題を回避します。 解決法は二つに分けられます。

source: use an extended persistence context that is scoped to the conversation, instead of to the transaction
it_it: occorre utilizzare un contesto di persistenza esteso con scope conversazionale, invece che transazionale
ja_jp: トランザクションに対してスコープされるのではなく、 対話に対してスコープされる拡張永続コンテキストを使用します

source: use two transactions per request; the first spans the beginning of the restore view phase (some transaction managers begin the transaction later at the beginning of the apply request vaues phase) until the end of the invoke application phase; the second spans the render response phase
it_it: occorre usare due transazione per richiesta; la prima si estende dall'inizio della fase di ripristino della vista, o "restore view phase", (qualche transaction manager inizia la transazione più tardi, all'inizio della fase di applicazione dei valori della richiesta, o "apply request values phase") alla fine della fase di chiamata all'applicazione, o "invoke application phase"; la seconda copre la fase di rendering della risposta, o "render response phase"
ja_jp: 一つの要求に対して二つのトランザクションを使用します。 1 番目はビュー復元フェーズの開始から (トランザクションマネージャの中にはこれより後の要求値適用フェーズの開始でトランザクションを開始するものがある) アプリケーション呼び出しフェーズの終わりまでまたがり、 2 番目は応答のレンダリングフェーズをまたぎます。

source: In the next section, we'll tell you how to set up a conversation-scope persistence context. But first we need to tell you how to enable Seam transaction management. Note that you can use conversation-scoped persistence contexts without Seam transaction management, and there are good reasons to use Seam transaction management even when you're not using Seam-managed persistence contexts. However, the two facilities were designed to work together, and work best when used together.
it_it: Nella prossima sezione, esamineremo come utilizzare un contesto di persistenza conversazionale. Ma prima occorre vedere come abilitare la gestione delle transazioni di Seam. Si noti che è possibile usare contesti di persistenza conversazionale senza usare la gestione delle transazioni di Seam, e ci sono buoni motivi per utilizzare la gestione delle transazioni di Seam anche se non si stanno utilizzando contesti di persistenza gestiti da Seam. Comunque, queste due funzionalità sono state progettate per operare assieme, e usate assieme danno il meglio.
ja_jp: 次のセクションでは、 対話スコープの永続コンテキストの設定方法について説明していきますが、 まず最初に Seam トランザクション管理を有効にする方法を説明しておく必要があります。 Seam トランザクション管理なしで対話スコープの永続コンテキストを使用することができ、 また Seam 管理永続コンテキストを使用していない場合でも Seam トランザクション管理を利用すると便利なことがあるので留意しておいてください。 ただし、 この二つの機能は連携して動作するよう設計されているため、 併用する方が最適です。

source: Seam transaction management is useful even if you're using EJB 3.0 container-managed persistence contexts. But it is especially useful if you use Seam outside a Java EE 5 environment, or in any other case where you would use a Seam-managed persistence context.
it_it: La gestione delle transazioni di Seam è utile anche se vengono usati contesti di persistenza gestiti da un container EJB 3.0. Ma in particolare essa è utile quando Seam è usato fuori dall'ambiente Java EE 5, o in ogni altro caso dove si usi un contesto di persistenza gestito da Seam.
ja_jp: Seam トランザクション管理は EJB 3.0 コンテナ管理の永続コンテキストを使用している場合でも役に立ちますが、 Java EE 5 環境の外側で Seam を使用する場合、 あるいはこれ以外の Seam 管理の永続コンテキストを使用するような環境で特に役立ちます。

source: Disabling Seam-managed transactions
it_it: Disabilitare le transazioni gestite da Seam
ja_jp: Seam 管理トランザクションを無効にする

source: Seam transaction management is enabled by default for all JSF requests. If you want to <emphasis>disable</emphasis> this feature, you can do it in <literal>components.xml</literal>:
it_it: La gestione delle tarnsazioni di Seam è abilitato di default per tutte le richieste JSF. Se si desidera <emphasis>disabilitare</emphasis> questa funzionalità, è possibile farlo in <literal>components.xml</literal>:
ja_jp: Seam トランザクション管理はデフォルトではすべての JSF 要求に有効になっています。 この機能を <emphasis>無効にしたい</emphasis> 場合は <literal>components.xml</literal> で行うことができます。

source: Configuring a Seam transaction manager
it_it: Configurazione di un gestore di transazioni Seam
ja_jp: Seamトランザクションマネージャを設定する

source: Seam provides a transaction management abstraction for beginning, committing, rolling back, and synchronizing with a transaction. By default Seam uses a JTA transaction component that integrates with Container Managed and programmatic EJB transactions. If you are working in a Java EE 5 environment, you should install the EJB synchronization component in <literal>components.xml</literal>:
it_it: Seam fornisce un'astrazione della gestione della transazione che permette di iniziarla, farne il commit e il rollback e di sincronizzarsi con essa. Di default Seam usa un componente transazionale JTA che si integra con transazioni EJB gestite dal programma o dal container. Se si sta lavorando in un ambiente Java EE 5, occorre installare il componente di sincronizzazione EJB in <literal>components.xml</literal>:
ja_jp: Seam はトランザクションでの開始、 コミット、 ロールバック、 同期などの動作にトランザクション管理の抽象化を提供します。 デフォルトでは Seam はコンテナ管理やプログラムでの EJB トランザクションを統合する JTA トランザクションコンポーネントを使用します。 Java EE 5 の環境で作業している場合は <literal>components.xml</literal> に EJB 同期化コンポーネントをインストールしてください。

source: However, if you are working in a non EE 5 container, Seam will try auto detect the transaction synchronization mechanism to use. However, if Seam is unable to detect the correct transaction synchronization to use, you may find you need configure one of the following:
it_it: Comunque, se si sta lavorando in un container non conforme a J2EE 5, Seam cercherà di rilevare automaticamente il meccanismo di sincronizzazione da usare. Comunque, qualora Seam non fosse in grado di rilevarlo, potrebbe essere necessario configurare una delle seguenti proprietà:
ja_jp: ただし、 EE 5 コンテナ以外で作業している場合は Seam が使用するトランザクション同期化メカニズムを自動検出しようとします。 Seam が正しいトランザクションの同期化を検出できない場合は次のいずれかを設定する必要があるかもしれません。

source: JPA RESOURCE_LOCAL transactions with the <literal>javax.persistence.EntityTransaction</literal> interface. <literal>EntityTransaction</literal> begins the transaction at the beginning of the apply request values phase.
it_it: Transazioni JPA di tipo RESOURCE_LOCAL con interfaccia <literal>javax.persistence.EntityTransaction</literal>. <literal>EntityTransaction</literal> inizia la transazione all'inizio della fase "apply request values".
ja_jp: JPA RESOURCE_LOCAL トランザクション。 <literal>javax.persistence.EntityTransaction</literal> インタフェースで使用され、 <literal>EntityTransaction</literal> は要求値適用フェーズの開始時にトランザクションを開始します。

source: Hibernate managed transactions with the <literal>org.hibernate.Transaction</literal> interface. <literal>HibernateTransaction</literal> begins the transaction at the beginning of the apply request values phase.
it_it: Transazioni gestite da Hibernate con l'interfaccia <literal>org.hibernate.Transaction</literal>. <literal>HibernateTransaction</literal> da inizio alla transazione all'inizio della fase "apply request values".
ja_jp: Hibernate 管理トランザクション。 <literal>org.hibernate.Transaction</literal> インタフェースで使用され、 <literal>HibernateTransaction</literal> は要求値適用フェーズの開始時にトランザクションを開始します。

source: Spring managed transactions with the <literal>org.springframework.transaction.PlatformTransactionManager</literal> interface. The Spring <literal>PlatformTransactionManagement</literal> manager may begin the transaction at the beginning of the apply request values phase if the <literal>userConversationContext</literal> attribute is set.
it_it: Transazioni gestite da Spring con l'interfaccia <literal>org.springframework.transaction.PlatformTransactionManager</literal>. Il gestore <literal>PlatformTransactionManagement</literal> di Spring può cominciare la transazione all'inizio della fase "apply request values" se è stato valorizzato l'attributo <literal>userConversationContext</literal>.
ja_jp: Spring 管理トランザクション。 <literal>org.springframework.transaction.PlatformTransactionManager</literal> インタフェースで使用され、 Spring の <literal>PlatformTransactionManagement</literal> マネージャは <literal>userConversationContext</literal> 属性を設定すると要求値適用フェーズの開始時にトランザクションを開始することができます。

source: Explicitly disable Seam managed transactions
it_it: Disabilitare esplicitamente le transazioni gestite da Seam
ja_jp: Seam 管理トランザクションを明示的に無効にする

source: Configure JPA RESOURCE_LOCAL transaction management by adding the following to your components.xml where <literal>#{em}</literal> is the name of the <literal>persistence:managed-persistence-context</literal> component. If your managed persistence context is named <literal>entityManager</literal>, you can opt to leave out the <literal>entity-manager</literal> attribute. (see <link linkend="persistence.seam-managed-persistence-contexts">Seam-managed persistence contexts</link> )
it_it: Si configuri la gestione delle transazioni RESOURCE_LOCAL JPA aggiungendo il seguente a components.xml dove <literal>#{em}</literal> è il nomedel componente <literal>persistence:managed-persistence-context</literal>. Se il contesto di persistenza gestito è chiamato <literal>entityManager</literal>, si può optare di lasciare vuoto l'attributo <literal>entity-manager</literal>. (Si veda <link linkend="persistence.seam-managed-persistence-contexts">contesti di persistenza gestiti da Seam</link> )
ja_jp: components.xml に次を追加して JPA RESOURCE_LOCAL トランザクション管理を設定します。 <literal>#{em}</literal> は <literal>persistence:managed-persistence-context</literal> コンポーネント名です。 管理永続コンテキスト名が <literal>entityManager</literal> なら <literal>entity-manager</literal> 属性を省略することができます。 (<link linkend="persistence.seam-managed-persistence-contexts">Seam 管理の永続コンテキスト</link> を参照)
