Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Rss.po
Languages: it_it

source: RSS support
it_it: Supporto RSS

source: It is now easy to integrate RSS feeds in Seam through the <ulink url="http://yarfraw.sourceforge.net/">YARFRAW</ulink> library. The RSS support is currently in the state of "tech preview" in the current release.
it_it: Con Seam è semplice gestire i feed RSS tramite la libreria <ulink url="http://yarfraw.sourceforge.net/">YARFRAW</ulink>. Il supporto RSS in questa versione è da considerarsi nello stato di anteprima.

source: Installation
it_it: Installazione

source: To enable RSS support, include the <literal>jboss-seam-rss.jar</literal> in your applications <literal>WEB-INF/lib</literal> directory. The RSS library also has some dependent libraries that should be placed in the same directory. See <xref linkend="dependencies.rss"/> for a list of libraries to include.
it_it: Per abilitare il supporto RSS includere <literal>jboss-seam-rss.jar</literal> nella cartella <literal>WEB-INF/lib</literal> dell'applicazione. La libreria RSS ha anche alcune dipendenze che devono essere posizionate nella stessa cartella. Vedi <xref linkend="dependencies.rss"/> per la lista delle librerie da includere.

source: The Seam RSS support requires the use of Facelets as the view technology.
it_it: Il supporto RSS in Seam richiede di utilizzare Facelets come tecnologia per la vista.

source: Generating feeds
it_it: Generare dei feed

source: The <literal>examples/rss</literal> project contains an example of RSS support in action. It demonstrates proper deployment packaging, and it shows the exposed functionality.
it_it: Il progetto <literal>examples/rss</literal> contiene un esempio del supporto RSS in azione. Mostra il modo appropriato per posizionare le librerie e illustra le funzionalità esposte.

source: A feed is a xhtml-page that consist of a feed and a list of nested entry items.
it_it: Un feed è una pagina xhtml che consiste in un feed e una lista di elementi annidati.

source: Feeds
it_it: I feed

source: Feeds are the top-level entities that describe the properties of the information source. It contains zero or more nested entries.
it_it: I feed sono delle entità di primo livello che descrivono le proprietà della sorgente di informazioni. Possono contenere uno o più elementi.

source: Attributes
it_it: Attributi

source: <literal>uid</literal> &#8212; An optional unique feed id. The value is a string.
it_it: <literal>uid</literal> &#8212; Un identificativo unico opzionale. Il valore è una stringa.

source: <literal>title</literal> &#8212; The title of the feed. The value is a string.
it_it: <literal>title</literal> &#8212; Il titolo del feed. Il valore è una stringa.

source: <literal>subtitle</literal> &#8212; The subtitle of the feed. The value is a string.
it_it: <literal>subtitle</literal> &#8212; Il sottotitolo del feed. Il valore è una stringa.

source: <literal>updated</literal> &#8212; When was the feed updated? The value is a date.
it_it: <literal>updated</literal> &#8212; Quando è stato aggiornato il feed? Il valore è una data.

source: <literal>link</literal> &#8212; The link to the source of the information. The value is a string.
it_it: <literal>link</literal> &#8212; Il link alla fonte dell'informazione. Il valore è una stringa.

source: <literal>feedFormat</literal> &#8212; The feed format. The value is a string and defaults to ATOM1. Valid values are RSS10, RSS20, ATOM03 and ATOM10.
it_it: <literal>feedFormat</literal> &#8212; Il formato del feed. Il valore è una stringa con default ATOM1. I valori ammessi sono RSS10, RSS20, ATOM03 e ATOM10.

source: Child elemenents
it_it: Elementi contenuti

source: Zero or more feed entries
it_it: Zero o più elementi

source: none
it_it: nessuna

source: Entries
it_it: Elementi

source: Entries are the "headlines" in the feed.
it_it: Gli elementi rappresentano i "titoli" del feed.

source: <literal>uid</literal> &#8212; An optional unique entry id. The value is a string.
it_it: <literal>uid</literal> &#8212; Un identificativo unico opzionale. Il valore è una stringa.

source: <literal>title</literal> &#8212; The title of the entry. The value is a string.
it_it: <literal>title</literal> &#8212; Il titolo dell'elemento. Il valore è una stringa.

source: <literal>link</literal> &#8212; A link to the item. The value is a string.
it_it: <literal>link</literal> &#8212; Un link all'articolo. Il valore è una stringa.

source: <literal>author</literal> &#8212; The author of the story. The value is a string.
it_it: <literal>author</literal> &#8212; L'autore dell'articolo. Il valore è una stringa.

source: <literal>summary</literal> &#8212; The body of the story. The value is a string.
it_it: <literal>summary</literal> &#8212; Il corpo dell'articolo. Il valore è una stringa.

source: <literal>textFormat</literal> &#8212; The format of the body and title of the story. The value is a string and valid values are "text" and "html". Defaults to "html".
it_it: <literal>textFormat</literal> &#8212; Il formato del corpo e del titolo dell'articolo. Il valore è una stringa e i valori ammessi sono "text" e "html". Il valore di default è "html".

source: <literal>published</literal> &#8212; When was the story first published? The value is a date.
it_it: <literal>published</literal> &#8212; Quando è stato pubblicato l'articolo? Il valore è una data.

source: <literal>updated</literal> &#8212; When was the story updated? The value is a date.
it_it: <literal>updated</literal> &#8212; Quando è stato aggiornato l'articolo? Il valore è una data.

source: Links and further documentation
it_it: Link e ulteriore documentazione

source: The core of the RSs functionality is based on the YARFRAW library which can be found on <ulink url="http://yarfraw.sourceforge.net/">http://yarfraw.sourceforge.net/</ulink> and most features and possible limitations are inherited from here.
it_it: Alla base del supporto RSS c'è la libreria YARFRAW che si può trovare all'indirizzo <ulink url="http://yarfraw.sourceforge.net/">http://yarfraw.sourceforge.net/</ulink> e da questa deriva la maggior parte delle caratteristiche e delle limitazioni.

source: For details on the ATOM 1.0 format, have a look at <ulink url="http://atompub.org/2005/07/11/draft-ietf-atompub-format-10.html"> the specs</ulink>
it_it: Per i dettagli sul formato ATOM 1.0, si veda sulle <ulink url="http://atompub.org/2005/07/11/draft-ietf-atompub-format-10.html">specifiche</ulink>

source: For details on the RSS 2.0 format, have a look at <ulink url="http://cyber.law.harvard.edu/rss/rss.html">the specs</ulink>
it_it: Per i dettagli sul formato RSS 2.0, si veda su <ulink url="http://cyber.law.harvard.edu/rss/rss.html">le specifiche</ulink>.
