Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: This message is produced when a user successfully logs in via the security API.
it_it: Questo messaggio viene prodotto quando un utente porta a buon fine un login tramite le API di sicurezza.
ja_jp: セキュリティAPIを通して、無事ログインできたときに生成されます。

source: This message is produced when the login process fails, either because the user provided an incorrect username or password, or because authentication failed in some other way.
it_it: Questo messaggio viene prodotto quando il processo di login fallisce, perché il nome utente e la password forniti dall'utente non sono corretti, oppure perché l'autenticazione è fallita per qualche altro motivo.
ja_jp: ユーザーネーム、パスワードの組み合わせ、或は何らかの認証のエラーにより、ユーザーがログインに失敗したときに生成されます。

source: This message is produced when a user attempts to perform an action or access a page that requires a security check, and the user is not currently authenticated.
it_it: Questo messaggio viene prodotto quando un utente tenta di eseguire un'azione o di accedere ad una pagina che richiede un controllo di sicurezza e l'utente non è al momento autenticato.
ja_jp: ユーザーが認証されずにセキュリティチェックが必要な操作、あるいはページへのアクセスを試みたときに生成されます。

source: This message is produced when a user that is already authenticated attempts to log in again.
it_it: Questo messaggio viene prodotto quando un utente che è già autenticato tenta di eseguire di nuovo il login.
ja_jp: このメッセージは既に認証されたユーザーが再度ログインを試みた時に生成されます。

source: Authorization
it_it: Autorizzazione
ja_jp: 認可

source: There are a number of authorization mechanisms provided by the Seam Security API for securing access to components, component methods, and pages. This section describes each of these. An important thing to note is that if you wish to use any of the advanced features (such as rule-based permissions) then your <literal>components.xml</literal> may need to be configured to support this - see the Configuration section above.
it_it: Ci sono diversi meccanismi di autorizzazione forniti dalle API di sicurezza di Seam per rendere sicuro l'accesso ai componenti, ai metodi dei componenti e alle pagine. Questo paragrafo descrive ognuno di essi. Un aspetto importante da notare è che qualora si voglia utilizzare una delle caratteristiche avanzate (come i permessi basati sulle regole) il <literal>components.xml</literal> potrebbe dover essere configurato per gestirle. Vedi il paragrafo Configurazione più sopra.
ja_jp: SeamのセキュリティAPIは、コンポーネント、コンポーネントのメソッド、それにページに対して多くの認可機能を提供します。 ここでは、それぞれの機能について説明します。 ここで説明するような高度なセキュリティ機能（ルールベースの認可のような）を使用する場合には<literal>components.xml</literal>に前述のような設定を記述しておかなければならない、ということに留意してください。

source: Core concepts
it_it: Concetti principali
ja_jp: 核となる概念

source: Seam Security is built around the premise of users being granted roles and/or permissions, allowing them to perform operations that may not otherwise be permissible for users without the necessary security privileges. Each of the authorization mechanisms provided by the Seam Security API are built upon this core concept of roles and permissions, with an extensible framework providing multiple ways to secure application resources.
it_it: La sicurezza di Seam è costruita intorno alla premessa per cui agli utenti vengono concessi ruoli e/o permessi, consentendo loro di eseguire operazioni che non sarebbero altrimenti permesse agli utenti senza i necessari privilegi di sicurezza. Ognuno dei meccanismi di autorizzazione forniti dalle API di sicurezza di Seam è costruito intorno a questo concetto principale di ruoli e permessi, con un framework espandibile che fornisce più modi per rendere sicure le risorse di un'applicazione.
ja_jp: Seamのセキュリティは必要なセキュリティ権限を持たないユーザーの操作を行わせないように、ロールとパーミッションによりユーザーの操作を制限する事を前提として設計されています。 SeamセキュリティAPIの提供する認可メカニズムは、ロールとパーミッションによるユーザー管理の概念に基づいて作られており、複数のアプリケーションリソース保護の方法を提供する拡張可能なフレームワークを提供しています。

source: What is a role?
it_it: Cosa è un ruolo?
ja_jp: ロールとは

source: A role is a <emphasis>group</emphasis>, or <emphasis>type</emphasis>, of user that may have been granted certain privileges for performing one or more specific actions within an application. They are simple constructs, consisting of just a name such as "admin", "user", "customer", etc. They can be granted either to users (or in some cases to other roles), and are used to create logical groups of users for the convenient assignment of specific application privileges.
it_it: Un ruolo è un <emphasis>gruppo</emphasis>, o un <emphasis>tipo</emphasis>, di utente al quale possono essere concessi certi privilegi per eseguire una o più azioni specifiche nell'ambito dell'applicazione. Essi sono dei semplici costrutti consistenti solo di un nome che "amministratore", "utente", "cliente", ecc. Possono sia essere concessi ad un utente (o in alcuni casi ad altri ruoli) che essere usati per creare gruppi logici di utenti per facilitare l'assegnazione di determinati privilegi dell'applicazione.
ja_jp: ロールとは、アプリケーションの特定の操作を実施する特権を付与されてるユーザーの<emphasis>グループ</emphasis>あるいは<emphasis>タイプ</emphasis>を言い、"admin"、 "user"、 "customer"等の名前により構成されています。 これらのロールはユーザーに対して（あるいは場合により他のロールに対し）付与され、特定のアプリケーションの操作に対する特権を持つユーザーの論理的なグループを作成する事を容易にしています。

source: What is a permission?
it_it: Cosa è un permesso?
ja_jp: パーミッションとは？

source: A permission is a privilege (sometimes once-off) for performing a single, specific action. It is entirely possible to build an application using nothing but permissions, however roles offer a higher level of convenience when granting privileges to groups of users. They are slightly more complex in structure than roles, essentially consisting of three "aspects"; a target, an action, and a recipient. The target of a permission is the object (or an arbitrary name or class) for which a particular action is allowed to be performed by a specific recipient (or user). For example, the user "Bob" may have permission to delete customer objects. In this case, the permission target may be "customer", the permission action would be "delete" and the recipient would be "Bob".
it_it: Un permesso è un privilegio (a volte una-tantum) per eseguire una singola, specifica azione. E' del tutto possibile costruire un'applicazione usando nient'altro che i privilegi, comunque i ruoli offrono un livello di facilitazione più alto quando si tratta di concedere dei privilegi a gruppi di utenti. Essi sono leggermente più complessi nella struttura rispetto ai ruoli ed essenzialmente consistono di tre "aspetti": un obiettivo , un'azione e un destinatario. L'obiettivo di un permesso è l'oggetto (o un nome arbitrario o una classe) per il quale è consentito di eseguire una determinata azione da parte di uno specifico destinatario (o utente). Ad esempio, l'utente "Roberto" può avere il permesso di cancellare gli oggetti cliente. In questo caso l'obiettivo del permesso può essere "clienti", l'azione del permesso sarà "cancella" e il recipiente sarà "Roberto".
ja_jp: パーミッションとは、一つの特定の操作を実行するための特権（時として1回限りの）を言います。 パーミッションのみを使ってアプリケーションを組むことも可能ですが、ユーザーのグループに対して特定の特権を付与する事により、セキュリティ管理をより容易にすることができます。 これらはロールよりも、構造上若干複雑で、 ”対象(target)”、”操作(action)” と”受益者(receipient)”の三つの要素から構成されます。 パーミッションの対象は特定の受益者（ユーザー）により特定の操作が行われるオブジェクト（あるいは、任意の名前、クラス）です。 例として、ユーザーBobは顧客オブジェクトを削除するパーミッションを持つ、場合を考えてみると、 パーミッションの対象は「顧客」、パーミッションの操作は「削除」、そして受益者はBobという事になります。

source: Within this documentation, permissions are generally represented in the form <literal>target:action</literal> (omitting the recipient, although in reality one is always required).
it_it: Nell'ambito di questa documentazione i permessi sono generalmente rappresentati nella forma <literal>obiettivo:azione</literal> (omettendo il destinatario, benché nella realtà sarà sempre richiesto).
ja_jp: このドキュメント中では権限は、実際には常に必要な受益者を省略して<literal>target:action</literal> という形式で表示されています。

source: Securing components
it_it: Rendere sicuri i componenti
ja_jp: コンポーネントの安全性を確保する

source: Let's start by examining the simplest form of authorization, component security, starting with the <literal>@Restrict</literal> annotation.
it_it: Iniziamo ad esaminare la forma più semplice di autorizzazione, la sicurezza dei componenti, inziando con l'annotazione <literal>@Restrict</literal>.
ja_jp: それでは、もっとも簡単な形式の認可、コンポーネントのセキュリティについて<literal>@Restrict</literal>アノテーションから見てゆきましょう。

source: @Restrict vs Typesafe security annotations
it_it: @Restrict e le annotazioni di sicurezza tipizzate
ja_jp: @Restrictアノテーション とタイプセーフなセキュリティアノテーション

source: While using the <literal>@Restrict</literal> annotation provides a powerful and flexible method for security component methods due to its ability to support EL expressions, it is recommended that the typesafe equivalent (described later) be used, at least for the compile-time safety it provides.
it_it: Benché l'uso dell'annotazione <literal>@Restrict</literal> fornisca un metodo flessibile e potente per rendere sicuri i componenti grazie alla sua possibilità di gestire le espressione EL, è consigliabile usare l'equivalente tipizzato (descritto più avanti), se non altro per la sicurezza a livello di compilazione che fornisce.
ja_jp: <literal>@Restrict</literal>アノテーションを使うとEL式をサポートしていることもあり、コンポーネントのメソッドに対して強力かつフレキシブルなセキュリティを付与する事ができますが、コンパイル時の安全性等から、タイプセーフな同様の方法（後述）が推奨されます。

source: The @Restrict annotation
it_it: L'annotazione @Restrict
ja_jp: @Restrictアノテーション

source: Seam components may be secured either at the method or the class level, using the <literal>@Restrict</literal> annotation. If both a method and it's declaring class are annotated with <literal>@Restrict</literal>, the method restriction will take precedence (and the class restriction will not apply). If a method invocation fails a security check, then an exception will be thrown as per the contract for <literal>Identity.checkRestriction()</literal> (see Inline Restrictions). A <literal>@Restrict</literal> on just the component class itself is equivalent to adding <literal>@Restrict</literal> to each of its methods.
it_it: I componenti Seam possono essere resi sicuri sia a livello di metodo che a livello di classe usando l'annotazione <literal>@Restrict</literal>. Se sia un metodo che la classe in cui è dichiarato sono annotati con <literal>@Restrict</literal>, la restrizione sul metodo ha la precedenza (e la restrizione sulla classe non si applica). Se nell'invocazione di un metodo fallisce il controllo di sicurezza, viene lanciata un'eccezione come definito nel contratto di <literal>Identity.checkRestriction()</literal> (vedi Restrizioni in linea). Una <literal>@Restrict</literal> solo sulla classe del componente stesso è equivalente ad aggiungere <literal>@Restrict</literal> a ciascuno dei suoi metodi.
ja_jp: <literal>@Restrict</literal>アノテーションにより、Seamのコンポーネントにはクラスあるいはメソッドレベルでのセキュリティを付与する事ができます。 もし、クラスとその中のメソッドの両方に<literal>@Restrict</literal>アノテーションがあった場合には、メソッドレベルの制限が優先され、クラスレベルの制限は結果として適用されません。 もし、メソッドの起動がセキュリティチェックで失敗した場合には、<literal>Identity.checkRestriction()</literal>単位で例外が発生します。 コンポーネントレベルでの<literal>@Restrict</literal>アノテーションは、そのコンポーネントのすべてのメソッドに<literal>@Restrict</literal>をアノテートしたのと同じことになります。

source: An empty <literal>@Restrict</literal> implies a permission check of <literal>componentName:methodName</literal>. Take for example the following component method:
it_it: Una <literal>@Restrict</literal> vuota implica un controllo di permesso per <literal>nomeComponente:nomeMetodo</literal>. Prendiamo ad esempio il seguente metodo di un componente:
ja_jp: 空の<literal>@Restrict</literal>は<literal>component:methodName</literal>を意味します。 下のようなコンポーネントの例を見てみましょう。

source: In this example, the implied permission required to call the <literal>delete()</literal> method is <literal>account:delete</literal>. The equivalent of this would be to write <literal>@Restrict("#{s:hasPermission('account','delete')}")</literal>. Now let's look at another example:
it_it: In questo esempio il permesso richiesto per chiamare il metodo <literal>delete()</literal> è <literal>account:delete</literal>. L'equivalente di ciò sarebbe stato scrivere <literal>@Restrict("#{s:hasPermission('account','delete')}")</literal>. Ora vediamo un altro esempio:
ja_jp: この例では、<literal>delete()</literal>を呼び出すためには<literal>account:delete</literal>という権限が必要な事を暗黙的に示しています。 同様の内容は<literal>@Restrict("#{s:hasPermission('account','delete')}")</literal>と記述する事もできます。他の例についても見てゆきましょう。

source: This time, the component class itself is annotated with <literal>@Restrict</literal>. This means that any methods without an overriding <literal>@Restrict</literal> annotation require an implicit permission check. In the case of this example, the <literal>insert()</literal> method requires a permission of <literal>account:insert</literal>, while the <literal>delete()</literal> method requires that the user is a member of the <literal>admin</literal> role.
it_it: Questa volta la classe stessa del componente è annotata con <literal>@Restrict</literal>. Ciò significa che tutti i metodi senza una annotazione <literal>@Restrict</literal> a sovrascrivere, richiedono un controllo implicito di permesso. Nel caso di questo esempio il metodo <literal>insert()</literal> richiede un permesso per <literal>account:insert</literal>, mentre il metodo <literal>delete()</literal> richiede che l'utente sia membro del ruolo <literal>admin</literal>.
ja_jp: ここでは、コンポーネントクラスに<literal>@Restrict</literal>とアノテーションが付記されています。これは、`Restrictがオーバーライドされない限り、パーミッションのチェックが暗示的に要求されることを示しています。この例の場合、<literal>insert()</literal>は<literal>account:insert</literal>のパーミッションを必要とし、<literal>delete()</literal>はユーザーが<literal>admin</literal>ロールに属していることが必要な事を示しています。

source: Before we go any further, let's address the <literal>#{s:hasRole()}</literal> expression seen in the above example. Both <literal>s:hasRole</literal> and <literal>s:hasPermission</literal> are EL functions, which delegate to the correspondingly named methods of the <literal>Identity</literal> class. These functions can be used within any EL expression throughout the entirety of the security API.
it_it: Prima di andare avanti, esaminiamo l'espressione <literal>#{s:hasRole()}</literal> vista nell'esempio precedente. Sia <literal>s:hasRole()</literal> che <literal>s:hasPermission</literal> sono funzioni EL, le quali delegano ai metodi con i nomi corrispondenti nella classe <literal>Identity</literal>. Queste funzioni possono essere usate all'interno di una espressione EL in tutte le API di sicurezza.
ja_jp: 先に進む前に、上の例で見た <literal>#{s:hasRole()}</literal> 式について見てみましょう。 <literal>s:hasRole</literal> も <literal>s:hasPermission</literal>もEL式であり、 <literal>Identity</literal>クラスの同様の名前のメソッドに対応します。 これらセキュリティAPIのすべてについてEL式の中で使う事ができます。

source: Being an EL expression, the value of the <literal>@Restrict</literal> annotation may reference any objects that exist within a Seam context. This is extremely useful when performing permission checks for a specific object instance. Look at this example:
it_it: Essendo un'espressione EL, il valore dell'annotazione <literal>@Restrict</literal> può fare riferimento a qualunque oggetto che sia presente in un contesto Seam. Ciò è estremamente utile quando si eseguono i controlli sui permessi per una specifica istanza di un oggetto. Ad esempio:
ja_jp: EL式とすることで、<literal>@Restrict</literal>アノテーションは、Seamコンテキスト中のどのようなオブジェクトの値でも参照することができるようになります。 これは、特定のオブジェクトのインスタンスをチェックしてパーミッションを決定する場合に非常に有効な方法です。下の例を見てみましょう。

source: <![CDATA[@Name("account") public class AccountAction { @In Account selectedAccount; @Restrict("#{s:hasPermission(selectedAccount,'modify')}") public void modify() { selectedAccount.modify(); } }]]>
it_it: <![CDATA[@Name("account") public class AccountAction { @In Account selectedAccount; @Restrict("#{s:hasPermission(selectedAccount,'modifica')}") public void modify() { selectedAccount.modify(); } }]]>

source: The interesting thing to note from this example is the reference to <literal>selectedAccount</literal> seen within the <literal>hasPermission()</literal> function call. The value of this variable will be looked up from within the Seam context, and passed to the <literal>hasPermission()</literal> method in <literal>Identity</literal>, which in this case can then determine if the user has the required permission for modifying the specified <literal>Account</literal> object.
it_it: La cosa interessante da notare in questo esempio è il riferimento a <literal>selectedAccount</literal> che si vede all'interno della chiamata alla funzione <literal>hasPermission</literal>. Il valore di questa variabile verrà ricercato all'interno del contesto Seam e passato al metodo <literal>hasPermission()</literal> di <literal>Identity</literal>, il quale in questo caso può determinare se l'utente ha il permesso richiesto per modificare l'oggetto <literal>Account</literal> specificato.
ja_jp: ここで興味深いのは、<literal>hasPermission()</literal>というファンクション中で<literal>selectedAccout</literal>を参照している事です。 この変数の値はSeamのコンテキスト中で検索され、<literal>Identity</literal>の<literal>hasPermission()</literal>に渡され、この例の場合、特定の<literal>Account</literal>のオブジェクトに対する変更許可を持っているかを決定しています。

source: Inline restrictions
it_it: Restrizioni in linea
ja_jp: インラインによる制約

source: Sometimes it might be desirable to perform a security check in code, without using the <literal>@Restrict</literal> annotation. In this situation, simply use <literal>Identity.checkRestriction()</literal> to evaluate a security expression, like this:
it_it: A volte può risultare desiderabile eseguire un controllo di sicurezza nel codice, senza usare l'annotazione <literal>@Restrict</literal>. In questa situazione basta usare semplicemente <literal>Identity.checkRestriction()</literal> per risolvere l'espressione di sicurezza, così:
ja_jp: 時として、<literal>@Restrict</literal>アノテーションを使わずに、コードでセキュリティチェックを行いたい場合があるかもしれません。この様な場合には、下のように<literal>Identity.checkRestriction()</literal>を使って、セキュリティ式を評価することができます。

source: If the expression specified doesn't evaluate to <literal>true</literal>, either
it_it: Se l'espressione specificata non risolve a <literal>true</literal>, allora
ja_jp: もし式が<literal>true</literal>と評価されなかった場合には、

source: if the user is not logged in, a <literal>NotLoggedInException</literal> exception is thrown or
it_it: se l'utente non ha eseguito l'accesso, l'eccezione <literal>NotLoggedInException</literal> viene lanciata, oppure
ja_jp: ユーザーがログインしていなかったのであれば、NotLoggedInExceptionが投げられ、

source: if the user is logged in, an <literal>AuthorizationException</literal> exception is thrown.
it_it: se l'utente ha eseguito l'accesso, viene lanciata un'eccezione <literal>AuthorizationException</literal>.
ja_jp: ユーザーがログインしていた場合には、AuthorizationExceptionが投げられます。

source: It is also possible to call the <literal>hasRole()</literal> and <literal>hasPermission()</literal> methods directly from Java code:
it_it: E' anche possibile chiamare i metodi <literal>hasRole()</literal> e <literal>hasPermission()</literal> direttamente dal codice Java:
ja_jp: また、下のようにJavaコードから直接<literal>hasRole()</literal>や<literal>hasPermission()</literal>メソッドを呼ぶこともできます。

source: <![CDATA[if (!Identity.instance().hasRole("admin")) throw new AuthorizationException("Must be admin to perform this action"); if (!Identity.instance().hasPermission("customer", "create")) throw new AuthorizationException("You may not create new customers");]]>
it_it: <![CDATA[if (!Identity.instance().hasRole("amministratore")) throw new AuthorizationException("Devi essere un amministratore per eseguire questa azione"); if (!Identity.instance().hasPermission("cliente", "crea")) throw new AuthorizationException("Non puoi creare nuovi clienti");]]>

source: Security in the user interface
it_it: La sicurezza nell'interfaccia utente
ja_jp: ユーザーインタフェースのセキュリティ

source: One indication of a well designed user interface is that the user is not presented with options for which they don't have the necessary privileges to use. Seam Security allows conditional rendering of either 1) sections of a page or 2) individual controls, based upon the privileges of the user, using the very same EL expressions that are used for component security.
it_it: Uno degli indici di interfaccia utente ben progettata è quando agli utenti non vengono presentate opzioni per le quali essi non hanno i permessi necessari. La sicurezza di Seam consente la visualizzazione condizionale sia di sezioni di una pagina che di singoli controlli, basata sui privilegi dell'utente, usando esattamente le stesse espressioni EL usate nella sicurezza dei componenti.
ja_jp: 適切なユーザーインタフェースのデザインの一つとして、ユーザーが使用する権限を有しないオプションの表示をしないようにすることがあります。 Seamのセキュリティはユーザーの権限に応じて、コンポーネントのセキュリティで使用したのと同様にEL式を使用する事により1）ページ単位 2）個々のコントロール単位 で描画を管理する事ができます。

source: Let's take a look at some examples of interface security. First of all, let's pretend that we have a login form that should only be rendered if the user is not already logged in. Using the <literal>identity.isLoggedIn()</literal> property, we can write this:
it_it: Diamo un'occhiata ad alcuni esempi della sicurezza nell'interfaccia. Prima di tutto prentendiamo di avere una form di accesso che debba essere visualizzata solo se l'utente non ha già fatto l'accesso. Usando la proprietà <literal>identity.isLoggedIn()</literal> possiamo scrivere questo:
ja_jp: インタフェースのセキュリティの例について見てゆきましょう。 まず最初に、ログインしていないユーザーの時だけ表示されるログインフォームについて考えてみましょう。 <literal>identity.isLoggedIn()</literal>属性を使えば下のように記述できます。

source: If the user isn't logged in, then the login form will be rendered - very straight forward so far. Now let's pretend there is a menu on the page that contains some actions which should only be accessible to users in the <literal>manager</literal> role. Here's one way that these could be written:
it_it: Se l'utente non ha eseguito l'accesso, allora la form di accesso verrà visualizzata. Fin qui tutto bene. Ora vogliamo che ci sia un menu sulla pagina che contenga alcune azioni speciali che devono essere accessibili solo agli utenti del ruolo <literal>dirigente</literal>. Ecco un modo in cui ciò potrebbe essere scritto:
ja_jp: もしユーザーがログインしていなければ、ログインフォームが表示されます（実に単純ですね）。 次に、<literal>manager</literal>ロールを持っている人達だけがアクセス可能なメニューが必要だと仮定しましょう。 このような場合の一つの方法として、下に例を示したあります。

source: <![CDATA[<h:outputLink action="#{reports.listManagerReports}" rendered="#{s:hasRole('manager')}"> Manager Reports </h:outputLink>]]>
it_it: <![CDATA[<h:outputLink action="#{reports.listManagerReports}" rendered="#{s:hasRole('dirigente')}"> Rapporti per i dirigenti </h:outputLink>]]>

source: This is also quite straight forward. If the user is not a member of the <literal>manager</literal> role, then the outputLink will not be rendered. The <literal>rendered</literal> attribute can generally be used on the control itself, or on a surrounding <literal>&lt;s:div&gt;</literal> or <literal>&lt;s:span&gt;</literal> control.
it_it: Anche fin qui tutto bene. Se l'utente non è un membro del ruolo <literal>dirigente</literal>, allora <literal>outputLink</literal> non verrà visualizzato. L'attributo <literal>rendered</literal> in generale può essere usato per il controllo stesso oppure in un controllo <literal>&lt;s:div&gt;</literal> o <literal>&lt;s:span&gt;</literal> che ne comprende altri.
ja_jp: これも、たいへんシンプルで、ユーザーが<literal>manager</literal>ロールを持っていなければ、outputLinkは描画されません。<literal>rendered</literal>属性は一般に制御そのものに使われたり、<literal>&lt;s:div&gt;</literal> や <literal>&lt;s:span&gt;</literal>の中で制御の目的に使われます。
