Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: Sometimes it might be necessary to extend the Identity component if your application has special security requirements. The following example (contrived, as credentials would normally be handled by the <literal>Credentials</literal> component instead) shows an extended Identity component with an additional <literal>companyCode</literal> field. The install precendence of <literal>APPLICATION</literal> ensures that this extended Identity gets installed in preference to the built-in Identity.
it_it: A volte può essere necessario estendere il componente Identity se l'applicazione ha particolari requisiti di sicurezza. Il seguente esempio (fatto di proposito, dato che le credenziali sarebbero normalmente gestite dal componente <literal>Credentials</literal>) mostra un componente Identity esteso con un campo <literal>companyCode</literal> aggiuntivo. La precendenza di installazione impostata a <literal>APPLICATION</literal> assicura che questo Identity esteso venga installato al posto dell'Identity originale.
ja_jp: アプリケーションが特別なセキュリティを要求する場合には、Identityコンポーネントを拡張する必要がある場合があります。以下の例（説明のためのもので、通常、クレデンシャルは<literal>Credentials</literal>コンポーネントにより処理されます）では<literal>companyCode</literal> フィールドを追加した拡張Identityコンポーネントを示しています。<literal>APPLICATION</literal>により、拡張Identityが内蔵Identityよりも優先されてインストールされることを保証しています。

source: Note that an <literal>Identity</literal> component must be marked <literal>@Startup</literal>, so that it is available immediately after the <literal>SESSION</literal> context begins. Failing to do this may render certain Seam functionality inoperable in your application.
it_it: Notare che un componente <literal>Identity</literal> deve essere marcato <literal>@Startup</literal>, in modo che sia disponibile immediatamente dopo l'inizio del contesto <literal>SESSION</literal>. La mancanza di questo dettaglio renderebbe non utilizzabili determinate funzionalità di Seam nell'applicazione.
ja_jp: <literal>SESSION</literal>コンテキストが開始されると同時に利用可能とするために、<literal>Identity</literal>コンポーネントは<literal>@Startup</literal>とアノテートされている必要があることに留意してください。 これが行われていないと、Seamのいくつかの機能が動作しないことがあります。

source: OpenID is a community standard for external web-based authentication. The basic idea is that any web application can supplement (or replace) its local handling of authentication by delegating responsibility to an external OpenID server of the user's chosing. This benefits the user, who no longer has to remember a name and password for every web application he uses, and the developer, who is relieved of some of the burden of maintaining a complex authentication system.
it_it: OpenID è un standard comune per l'autenticazione esterna sul web. L'idea fondamentale è che qualsiasi applicazione web possa integrare (o sostituire) la sua gestione locale dell'autenticazione delegandone la responsabilità ad un server OpenID esterno scelto dall'utente. Questo va a beneficio dell'utente che non deve più ricordare un nome e una password per ogni applicazione web che usa, e dello sviluppatore, che viene sollevato di un po' di problemi nel manutenere un complesso sistema di autenticazione.

source: When using OpenID, the user selects an OpenID provider, and the provider assigns the user an OpenID. The id will take the form of a URL, for example <literal>http://maximoburrito.myopenid.com</literal> however, it's acceptable to leave off the <literal>http://</literal> part of the identifier when logging into a site. The web application (known as a relying party in OpenID-speak) determines which OpenID server to contact and redirects the user to the remote site for authentication. Upon successful authentication the user is given the (cryptographically secure) token proving his identity and is redirected back to the original web application.The local web application can then be sure the user accessing the application controls the OpenID he presented.
it_it: Quando si usa OpenID, l'utente sceglie un fornitore OpenID, e il fornitore OpenID assegna all'utente un OpenID. Questo id prende la forma di un URL, ad esempio <literal>http://grandepizza.myopenid.com</literal>, comunque è accettabile trascurare la parte <literal>http://</literal> dell'identificativo quando si fa il login ad un sito. L'applicazione web (detta relying party in termini OpenID) determina quale server OpenID deve contattare e redirige l'utente a quel sito per l'autenticazione. Dopo essersi autenticato con esito positivo, all'utente viene fornito un codice (crittograficamente sicuro) che prova la sua identità e viene rediretto di nuovo all'applicazione web originale. L'applicazione web locale può essere quindi sicura che l'utente che sta accedendo è il proprietario dell'OpenID che aveva fornito.

source: It's important to realize at this point that authentication does not imply authorization. The web application still needs to make a determination of how to use that information. The web application could treat the user as instantly logged in and give full access to the system or it could try and map the presented OpenID to a local user account, prompting the user to register if he hasn't already. The choice of how to handle the OpenID is left as a design decision for the local application.
it_it: E' importante rendersi conto, a questo punto, che l'autenticazione non implica l'autorizzazione. L'applicazione web ha ancora bisogno di fare delle determinazioni su come usare quell'informazione. L'applicazione web potrebbe trattare l'utente come immediatamente autenticato e dargli/le pieno accesso al sistema, oppure potrebbe tentare di associare l'OpenID fornito ad un utente locale, chiedendo all'utente di registrarsi se non l'ha già fatto. La scelta su come gestire l'OpenID è lasciata ad una decisione progettuale dell'applicazione locale.

source: Configuring OpenID
it_it: Configurare OpenID

source: Seam uses the openid4java package and requires four additional JARs to make use of the Seam integration. These are: <literal>htmlparser.jar</literal>, <literal>openid4java.jar</literal>, <literal>openxri-client.jar</literal> and <literal>openxri-syntax.jar</literal>.
it_it: Seam usa il pacchetto openid4java e richiede quattro JAR aggiuntivi per usare l'integrazione Seam. Essi sono: <literal>htmlparser.jar</literal>, <literal>openid4java.jar</literal>, <literal>openxri-client.jar</literal> e <literal>openxri-syntax.jar</literal>.

source: OpenID processing requires the use of the <literal>OpenIdPhaseListener</literal>, which should be added to your <literal>faces-config.xml</literal> file. The phase listener processes the callback from the OpenID provider, allowing re-entry into the local application.
it_it: L'elaborazione di OpenID richiede l'uso di <literal>OpenIdPhaseListener</literal>, che deve essere aggiunto al file <literal>faces-config.xml</literal>. Il phase listener elabora le chiamate dal fornitore OpenID, consentendo di rientrare nell'applicazione locale.

source: With this configuration, OpenID support is available to your application. The OpenID support component, <literal>org.jboss.seam.security.openid.openid</literal>, is installed automatically if the openid4java classes are on the classpath.
it_it: Con questa configurazione il supporto OpenID è disponibile nell'applicazione. Il componente per il supporto OpenID, <literal>org.jboss.seam.security.openid.openid</literal>, viene installato automaticamente se le classi openid4java sono nel classpath.

source: Presenting an OpenIdDLogin form
it_it: Persentare una form di login OpenID

source: To initiate an OpenID login, you can present a simply form to the user asking for the user's OpenID. The <literal>#{openid.id}</literal> value accepts the user's OpenID and the <literal>#{openid.login}</literal> action initiates an authentication request.
it_it: Per iniziare un login con OpenID occorre presentare una semplice form che chieda all'utente il suo OpenID. Il valore <literal>#{openid.id}</literal> accetta l'OpenID dell'utente e l'azione <literal>#{openid.login]</literal> inizia la richiesta di autenticazione.

source: When the user submits the login form, he will be redirected to his OpenID provider. The user will eventually return to your application through the Seam pseudo-view <literal>/openid.xhtml</literal>, which is provided by the <literal>OpenIdPhaseListener</literal>. Your application can handle the OpenID response by means of a <literal>pages.xml</literal> navigation from that view, just as if the user had never left your application.
it_it: Quando l'utente invia la form di login, viene rediretto al suo fornitore OpenID. L'utente torna infine all'applicazione tramite la pseudo pagina Seam <literal>/openid.xhtml</literal>, che è fornita dal <literal>OpenIdPhaseListener</literal>. L'applicazione può gestire la risposta OpenID per mezzo della navigazione indicata in <literal>pages.xml</literal> per quella pagina, proprio come se l'utente non avesse mai lasciato l'applicazione.

source: Logging in immediately
it_it: Eseguire il login immediatamente

source: The simplest strategy is to simply login the user immediately. The following navigation rule shows how to handle this using the <literal>#{openid.loginImmediately()}</literal> action.
it_it: La strategia più semplice è di eseguire immediatamente il login dell'utente. La seguente regola di navigazione mostra come gestire questa modalità usando l'azione <literal>#{openid.loginImmediately()}</literal>.

source: &lt;page view-id=&quot;/openid.xhtml&quot;&gt; &lt;navigation evaluate=&quot;#{openid.loginImmediately()}&quot;&gt; &lt;rule if-outcome=&quot;true&quot;&gt; &lt;redirect view-id=&quot;/main.xhtml&quot;&gt; &lt;message&gt;OpenID login successful...&lt;/message&gt; &lt;/redirect&gt; &lt;/rule&gt; &lt;rule if-outcome=&quot;false&quot;&gt; &lt;redirect view-id=&quot;/main.xhtml&quot;&gt; &lt;message&gt;OpenID login rejected...&lt;/message&gt; &lt;/redirect&gt; &lt;/rule&gt; &lt;/navigation&gt; &lt;/page&gt;
it_it: &lt;page view-id=&quot;/openid.xhtml&quot;&gt; &lt;navigation evaluate=&quot;#{openid.loginImmediately()}&quot;&gt; &lt;rule if-outcome=&quot;true&quot;&gt; &lt;redirect view-id=&quot;/main.xhtml&quot;&gt; &lt;message&gt;OpenID login completato con esito positivo...&lt;/message&gt; &lt;/redirect&gt; &lt;/rule&gt; &lt;rule if-outcome=&quot;false&quot;&gt; &lt;redirect view-id=&quot;/main.xhtml&quot;&gt; &lt;message&gt;OpenID login rifiutato...&lt;/message&gt; &lt;/redirect&gt; &lt;/rule&gt; &lt;/navigation&gt; &lt;/page&gt;

source: Thie <literal>loginImmediately()</literal> action checks to see if the OpenID is valid. If it is valid, it adds an OpenIDPrincipal to the identity component, marks the user as logged in (i.e. <literal>#{identity.loggedIn}</literal> will be true) and returns true. If the OpenID was not validated, the method returns false, and the user re-enters the application un-authenticated. If the user's OpenID is valid, it will be accessible using the expression <literal>#{openid.validatedId}</literal> and <literal>#{openid.valid}</literal> will be true.
it_it: L'azione <literal>loginImmediately()</literal> controlla per vedere se l'OpenID è valido. Se è valido, aggiunge un OpenIDPrincipal al componente identity, marca l'utente come loggedin (cioè <literal>#{identity.loggedIn}</literal> sarà true) e restituisce true. Se l'OpenID non è stato validato, il metodo restituisce false, e l'utente rientra nell'applicazione non autenticato. se l'OpenID dell'utente è valido, esso sarà accessibile usando l'espressione <literal>#{openid.validatedId}</literal> e <literal>#{openid.valid}</literal> sarà true.

source: Deferring login
it_it: Rimandare il login

source: You may not want the user to be immediately logged in to your application. In that case, your navigation should check the <literal>#{openid.valid}</literal> property and redirect the user to a local registration or processing page. Actions you might take would be asking for more information and creating a local user account or presenting a captcha to avoid programmatic registrations. When you are done processing, if you want to log the user in, you can call the <literal>loginImmediately</literal> method, either through EL as shown previously or by directly interaction with the <literal>org.jboss.seam.security.openid.OpenId</literal> component. Of course, nothing prevents you from writing custom code to interact with the Seam identity component on your own for even more customized behaviour.
it_it: Si può desiderare di non autenticare immediatamente l'utente nell'applicazione. In questo caso la navigazione dovrò controllare la proprietà <literal>#{openid.valid}</literal> e redirigere l'utente ad una pagina per la registrazione o l'elaborazione dell'utente. Le azioni che si possono prendere sono di chiedere maggiori informazioni e creare un utente locale, oppure presentare un CAPTCHA per evitare registrazioni da programmi automatici. Quando questa elaborazione è terminata, se si vuole autenticare l'utente è possibile chiamare il metodo <literal>loginImmediately</literal>, sia tramite EL come mostrato in precedenza, sia interagendo direttamento con il componente <literal>org.jboss.seam.security.openid.OpenId</literal>. Ovviamente niente impedisce di scrivere da soli del codice personalizzato per interagire con il componente Seam Identity per avere un comportamento più personalizzato.

source: Logging out
it_it: Log out

source: Logging out (forgetting an OpenID association) is done by calling <literal>#{openid.logout}</literal>. If you are not using Seam security, you can call this method directly. If you are using Seam security, you should continue to use <literal>#{identity.logout}</literal> and install an event handler to capture the logout event, calling the OpenID logout method.
it_it: Il log out (dimenticando l'associazione OpenID) viene fatto chiamando <literal>#{openid.logout}</literal>. Se non si sta usando la sicurezza Seam è possibile chiamare questo metodo direttamente. Se si sta usando la sicurezza Seam occorre continuare ad usare <literal>#{identity.logout}</literal> e installare un gestore di eventi per catturare l'evento logout, chiamando il metodo logout di OpenID.

source: It's important that you do not leave this out or the user will not be able to login again in the same session.
it_it: E' importante non trascurare questo punto altrimenti l'utente non sarà più in grado di eseguire nuovamente il login nella stessa sessione.

source: boolean
ja_jp: ブール型

source: create
ja_jp: 作成

source: delete
ja_jp: 削除

source: update
ja_jp: 更新

source: read
ja_jp: 読み込み

source: PermissionResolver
ja_jp: パーミッションリゾルバー

source: ResolverChain
ja_jp: リゾルバーチェーン

source: RuleBasedPermissionResolver
ja_jp: ルールベースのパーミッションリゾルバー

source: PersistentPermissionResolver
ja_jp: 永続的パーミッションリゾルバー

source: JpaPermissionStore
ja_jp: JpaPermissionStoreについて

source: FIELD,METHOD
ja_jp: フィールド、メソッド

source: <![CDATA[ @Entity public class AccountPermission implements Serializable { private Integer permissionId; private String recipient; private String target; private String action; private String discriminator; @Id @GeneratedValue public Integer getPermissionId() { return permissionId; } public void setPermissionId(Integer permissionId) { this.permissionId = permissionId; } @PermissionUser @PermissionRole public String getRecipient() { return recipient; } public void setRecipient(String recipient) { this.recipient = recipient; } @PermissionTarget public String getTarget() { return target; } public void setTarget(String target) { this.target = target; } @PermissionAction public String getAction() { return action; } public void setAction(String action) { this.action = action; } @PermissionDiscriminator public String getDiscriminator() { return discriminator; } public void setDiscriminator(String discriminator) { this.discriminator = discriminator; } } ]]>
ja_jp: @Entity @Name("message") @Scope(EVENT) public class Message implements Serializable { private Long id; private String title; private String text; private boolean read; private Date datetime; @Id @GeneratedValue public Long getId() { return id; } public void setId(Long id) { this.id = id; } @NotNull @Length(max=100) public String getTitle() { return title; } public void setTitle(String title) { this.title = title; } @NotNull @Lob public String getText() { return text; } public void setText(String text) { this.text = text; } @NotNull public boolean isRead() { return read; } public void setRead(boolean read) { this.read = read; } @NotNull @Basic @Temporal(TemporalType.TIMESTAMP) public Date getDatetime() { return datetime; } public void setDatetime(Date datetime) { this.datetime = datetime; } }

source: TYPE
ja_jp: タイプ

source: ClassIdentifierStrategy
ja_jp: クラス識別子ストラテジー

source: EntityIdentifierStrategy
ja_jp: エンティティ識別子ストラテジー

source: PermissionManager
ja_jp: パーミッションマネージャ

source: CAPTCHA
ja_jp: キャプチャ

source: Run As
ja_jp: 自分とは別の権限での実行
