Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: So what is the working memory? Also known as a "stateful session" in Drools terminology, the working memory is a session-scoped object that contains the contextual information that is required by the rules engine to make a decision about a permission check. Each time the <literal>hasPermission()</literal> method is called, a temporary <literal>PermissionCheck</literal> object, or <emphasis>Fact</emphasis>, is inserted into the working memory. This <literal>PermissionCheck</literal> corresponds exactly to the permission that is being checked, so for example if you call <literal>hasPermission("account", "create")</literal> then a <literal>PermissionCheck</literal> object with a <literal>target</literal> equal to "account" and <literal>action</literal> equal to "create" will be inserted into the working memory for the duration of the permission check.
it_it: Dunque cos'è la working memory? Nota anche come "stateful session" nella terminologia Drools, la working memory è un oggetto collegato alla sessione che contiene le informazioni contestuali che sono richieste dal motore di regole per prendere una decisione sul controllo di permesso. Ogni volta che il metodo <literal>hasPermission()</literal> viene chiamato, viene creato un oggetto, o <emphasis>Fatto</emphasis>, temporaneo <literal>PermissionCheck</literal>, e viene inserito nella working memory. Questo <literal>PermissionCheck</literal> corrisponde esattamente al permesso che si sta controllando, così, ad esempio, se viene chiamato <literal>hasPermission("account", "create")</literal> allora verrà inserito nella working memory un oggetto <literal>PermissionCheck</literal> con <literal>target</literal> uguale a "account" e <literal>action</literal> uguale a "create", per la durata del controllo di permesso.
ja_jp: ワーキングメモリって何？ Droolｓの技術用語で、ルールエンジンがパーミッションチェックをするために必要なコンテキスト情報を保持しているセッションスコープのオブジェクトの事を「ワーキングメモリ」と呼びます。 <literal>hasPermission()</literal>メソッドが呼ばれる都度、仮の<literal>PermissionCheck</literal>オブジェクト、あるいは<emphasis>ファクト(Fact)</emphasis>がワーキングメモリに挿入されます。 この<literal>PermissionCheck</literal>は今からチェックされるパーミッションに対応しており、例えば<literal>hasPermission("account", "create")</literal>を呼び出すと、<literal>target</literal>属性が "account"で<literal>action</literal>属性が"create"である<literal>PermissionCheck</literal>オブジェクトがワーキングメモリに挿入され、パーミッションチェックが終了するまで存在します。

source: Besides the <literal>PermissionCheck</literal> facts, there is also a <literal>org.jboss.seam.security.Role</literal> fact for each of the roles that the authenticated user is a member of. These <literal>Role</literal> facts are synchronized with the user's authenticated roles at the beginning of every permission check. As a consequence, any <literal>Role</literal> object that is inserted into the working memory during the course of a permission check will be removed before the next permission check occurs, if the authenticated user is not actually a member of that role. Besides the <literal>PermissionCheck</literal> and <literal>Role</literal> facts, the working memory also contains the <literal>java.security.Principal</literal> object that was created as a result of the authentication process.
it_it: Accanto al fatto <literal>PermissionCheck</literal> c'è anche un fatto <literal>org.jboss.seam.security.Role</literal> per ogni ruolo di cui l'utente autenticato è membro. Questi fatti <literal>Role</literal> sono sincronizzati con i ruoli dell'utente autenticato all'inizio di ogni controllo di permesso. Di conseguenza qualsiasi oggetto <literal>Role</literal> che venisse inserito nella working memory nel corso del controllo di permesso sarebbe rimosso prima che il controllo di permesso successivo avvenga, a meno che l'utente autenticato non sia effettivamente membro di quel ruolo. Insieme ai fatti <literal>PermissionCheck</literal> e <literal>Role</literal> la working memory contiene anche l'oggetto <literal>java.security.Principal</literal> che era stato creato come risultato del processo di autenticazione.
ja_jp: <literal>PermissionCheck</literal>ファクトの他に、認証されたユーザーが所属するロールの<literal>org.jboss.seam.security.Role</literal>ファクトがあります。 これらの <literal>Role</literal>ファクトはパーミッションチェックの開始の都度ユーザーの認証されたロールと同期されます。 従って、パーミッションチェックに使用されたワーキングメモリ中の<literal>Role</literal>オブジェクトは、もし認証されたユーザーがそのロールに所属していなければ、次回のパーミッションチェックの前に削除されます。 ワーキングメモリには<literal>PermissionCheck</literal>と <literal>Role</literal>ファクトの他に認証の過程で作成された<literal>java.security.Principal</literal>オブジェクトが保持されています。

source: It is also possible to insert additional long-lived facts into the working memory by calling <literal>RuleBasedPermissionResolver.instance().getSecurityContext().insert()</literal>, passing the object as a parameter. The exception to this is <literal>Role</literal> objects, which as already discussed are synchronized at the start of each permission check.
it_it: E' anche possibile inserire ulteriori fatti nella working memory chiamando <literal>RuleBasedPermissionResolver.instance().getSecurityContext().insert()</literal>, passando l'oggetto come parametro. Fanno eccezione a questo gli oggetti <literal>Role</literal> che, come già detto, sono sincronizzati all'inizio di ciascun controllo di permesso.
ja_jp: これ以外にパラメータとしてオブジェクトを渡し<literal>RuleBasedPermissionResolver.instance().getSecurityContext().insert()</literal>を呼び出すことにより、追加でワーキングメモリ中に長期に生存するファクトを挿入する事ができます。 例外として、先に説明したように<literal>Role</literal>オブジェクトはパーミッションチェックの都度同期されるために、はワーキングメモリ中に長期に生存するファクトとする事はできません。

source: Getting back to our simple example, we can also notice that the first line of our LHS is prefixed with <literal>c:</literal>. This is a variable binding, and is used to refer back to the object that is matched by the condition (in this case, the <literal>PermissionCheck</literal>). Moving on to the second line of our LHS, we see this:
it_it: Tornando al nostro esempio, possiamo anche notare che la prima linea della nostra parte sinistra ha il prefisso <literal>c:</literal>. Questa è una dichiarazione di variabile ed è usata per fare riferimento all'oggetto rilevato dalla condizione (in questo caso il <literal>PermissionCheck</literal>). Passando alla seconda linea della nostra parte sinistra vediamo questo:
ja_jp: 先の例に戻り、LHSが<literal>c:</literal>で始まっていることに気がつくと思います。 これは、変数結合を表しており、条件のマッチングに利用されるオブジェクトへの参照を意味しています（この例の場合は<literal>PermissionCheck</literal>）。 LHSの2行目には下の記述があります。

source: This condition simply states that there must be a <literal>Role</literal> object with a <literal>name</literal> of "admin" within the working memory. As already mentioned, user roles are inserted into the working memory at the beginning of each permission check. So, putting both conditions together, this rule is essentially saying "I will fire if you are checking for the <literal>customer:delete</literal> permission and the user is a member of the <literal>admin</literal> role".
it_it: Questa condizione dichiara semplicemente che ci deve essere un oggetto <literal>Role</literal> con un <literal>name</literal> uguale ad "admin" nella working memory. Come già menzionato, i ruoli dell'utente sono inseriti nella working memory all'inizio di ogni controllo di permesso. Così, mettendo insieme entrambe le condizioni, questa regola in pratica dice "mi attiverò quando ci sarà un controllo per il permesso <literal>customer:delete</literal> e l'utente è un membro del ruolo <literal>admin</literal>".
ja_jp: この条件はワーキングメモリ中に"admin"という<literal>name</literal>の<literal>Role</literal>オブジェクトが存在しなければならない事を示しています。 先述したように、ユーザーのロールはパーミッションチェックの開始の都度ワーキングメモリに挿入されますので、この条件は結果として「<literal>admin</literal>ロールに所属するユーザーで<literal>customer:delete</literal>の許可を求めているのであれば、これを認めます」という事を示しています。

source: So what is the consequence of the rule firing? Let's take a look at the RHS of the rule:
it_it: Quindi qual è la conseguenza dell'attivazione della regola? Diamo un'occhiata alla parte destra della regola:
ja_jp: ルールが適用されると、何が起こるのでしょうか？ 次にルールのRHS側を見てみましょう。

source: The RHS consists of Java code, and in this case is invoking the <literal>grant()</literal> method of the <literal>c</literal> object, which as already mentioned is a variable binding for the <literal>PermissionCheck</literal> object. Besides the <literal>name</literal> and <literal>action</literal> properties of the <literal>PermissionCheck</literal> object, there is also a <literal>granted</literal> property which is initially set to <literal>false</literal>. Calling <literal>grant()</literal> on a <literal>PermissionCheck</literal> sets the <literal>granted</literal> property to <literal>true</literal>, which means that the permission check was successful, allowing the user to carry out whatever action the permission check was intended for.
it_it: La parte destra è costituita da codice Java e, in questo caso, esso invoca il metodo <literal>grant()</literal> dell'oggetto <literal>c</literal> il quale, come già detto, è una variabile che rappresenta l'oggetto <literal>PermissionCheck</literal>. Insieme alle proprietà <literal>name</literal> e <literal>action</literal>, nell'oggetto <literal>PermissionCheck</literal> c'è anche una proprietà <literal>granted</literal> che inizialmente è impostata a <literal>false</literal>. Chiamando <literal>grant()</literal> su un <literal>PermissionCheck</literal> la proprietà <literal>granted</literal> viene impostata a <literal>true</literal>, il che significa che il controllo di permesso è andato a buon fine, consentendo all'utente di portare avanti qualsiasi azione per cui il controlo di permesso era stato inteso.
ja_jp: RHSはJavaコードから成っており、この例の場合は<literal>c</literal>というオブジェクト (既に述べたように、<literal>PermissionCheck</literal>オブジェクトへの変数結合) の<literal>grant()</literal>メソッドが起動されます。<literal>PermissionCheck</literal>オブジェクトの<literal>name</literal>と<literal>action</literal>プロパティ以外に<literal>false</literal>に初期設定された<literal>granted</literal>プロパティが存在します。<literal>PermissionCheck</literal>の<literal>grant()</literal>を呼ぶことにより、<literal>granted</literal>プロパティは<literal>true</literal>にセットされ、パーミッションのチェックが成功し、ユーザーはパーミッションで決められたアクションについて実行することができるようになります。

source: Non-String permission targets
it_it: Permessi con obiettivi non stringa
ja_jp: 非文字列のパーミッションターゲット

source: So far we have only seen permission checks for String-literal permission targets. It is of course also possible to write security rules for permission targets of more complex types. For example, let's say that you wish to write a security rule to allow your users to create blog comments. The following rule demonstrates how this may be expressed, by requiring the target of the permission check to be an instance of <literal>MemberBlog</literal>, and also requiring that the currently authenticated user is a member of the <literal>user</literal> role:
it_it: Finora abbiamo visto solo controlli di permesso per obiettivi di tipo stringa. E' naturalmente possibile scrivere regole di sicurezza anche per obiettivi del permesso di tipo più complesso. Ad esempio, supponiamo che si voglia scrivere una regola di sicurezza che consenta agli utenti di creare un commento in un blog. La seguente regola mostra come questo possa essere espresso, richiedendo che l'obiettivo del controllo di permesso sia un'istanza di <literal>MemberBlog</literal> e anche che l'utente correntemente autenticato sia un membro del ruolo <literal>user</literal>:
ja_jp: ここまで文字列型のパーミッションターゲットのチェックについて見てきました。 しかし、もっと複雑なパーミッションターゲットのセキュリティルールを記述することも可能です。 例えば、ユーザーがブログにコメントを作成する事を可能にするセキュリティルールを記述する場合を考えてみましょう。 これは以下のように、パーミッションチェックの対象が<literal>MemberBlog</literal>インスタンスで、現在の認証されたユーザーが<literal>user</literal>ロールのメンバーであることが必要である、と表現されます。

source: Wildcard permission checks
it_it: Controlli di permesso
ja_jp: ワイルドカードによるパーミッションチェック

source: It is possible to implement a wildcard permission check (which allows all actions for a given permission target), by omitting the <literal>action</literal> constraint for the <literal>PermissionCheck</literal> in your rule, like this:
it_it: E' possibile realizzare dei controlli di permesso (che consentono l'accesso a tutte le funzioni per un determinato obiettivo) basati su wildcard omettendo il vincolo <literal>action</literal> per il <literal>PermissionCheck</literal> nella regola, in questo modo:
ja_jp: ワイルドカードを使ってパーミッションチェックを設定することも可能で、これはあるパーミッションに対してすべての操作を許可します。下のようにルールの<literal>PermissionCheck</literal>の<literal>action</literal>制約を省略することにより、実装できます。

source: This rule allows users with the <literal>admin</literal> role to perform <emphasis>any</emphasis> action for any <literal>customer</literal> permission check.
it_it: Questa regola consente agli utenti con il ruolo <literal>admin</literal> di eseguire <emphasis>qualsiasi</emphasis> azione per qualsiasi controllo di permesso su <literal>customer</literal>.
ja_jp: 上記のルールでは、<literal>admin</literal>ロールを持つユーザーは、どの<literal>customer</literal>に対しても、<emphasis>任意の</emphasis>操作が可能なパーミッションチェックになっています。

source: Another built-in permission resolver provided by Seam, <literal>PersistentPermissionResolver</literal> allows permissions to be loaded from persistent storage, such as a relational database. This permission resolver provides ACL style instance-based security, allowing for specific object permissions to be assigned to individual users and roles. It also allows for persistent, arbitrarily-named permission targets (not necessarily object/class based) to be assigned in the same way.
it_it: Un altro risolutore di permessi incluso in Seam, il <literal>PersistentPermissionResolver</literal> consente di caricare i permessi da un dispositivo di memorizzazione persistente, come una database relazionale. Questo risolutore di permessi fornisce una sicurezza orientata alle istanze in stile ACL (Access Control List), permettendo di assegnare specifici permessi sull'oggetto a utenti e ruoli. Allo stesso modo permette inoltre di assegnare in modo persistente permessi con un nome arbitrario (non necessariamente basato sull'oggetto o la classe).
ja_jp: Seamに内蔵されているパーミッションリゾルバーにはこれ以外に<literal>PersistentPermissionResolver</literal>があり、これはリレーショナルデータベースのような永続的保存場所からパーミッションを読み込むことが可能で、ACLスタイルのインスタンスベースのセキュリティを提供しており、個別のユーザーとロールに対して特定のパーミッションを指定する事ができます。 また、任意の名前のパーミッションターゲットを指定して保存する事が可能です。

source: Before it can be used, <literal>PersistentPermissionResolver</literal> must be configured with a valid <literal>PermissionStore</literal> in <literal>components.xml</literal>. If not configured, it will attempt to use the default permission store, <literal>JpaIdentityStore</literal> (see section further down for details). To use a permission store other than the default, configure the <literal>permission-store</literal> property as follows:
it_it: Prima di essere usato il <literal>PersistentPermissionResolver</literal> deve essere configurato con un <literal>PermissionStore</literal> valido in <literal>components.xml</literal>. Se non è configurato, proverà ad usare il permission store di default, <literal>JpaIdentityStore</literal> (vedi il paragrafo successivo per i dettagli). Per usare un permission store diverso da quello di default, occorre configurare la proprietà <literal>permission-store</literal> in questo modo:
ja_jp: 使用するためには<literal>components.xml</literal>に、有効な<literal>PersistentPermissionResolver</literal>を設定した<literal>PermissionStore</literal>を記述する必要があります。 設定していない場合、デフォルトのパーミッションストア<literal>JpaIdentityStore</literal>の使用を試みます。 デフォルト以外のパーミッションストアを使用する場合には<literal>permission-store</literal>属性を下のように記述します。

source: Permission Stores
it_it: I Permission Store
ja_jp: パーミッションストアについて

source: A permission store is required for <literal>PersistentPermissionResolver</literal> to connect to the backend storage where permissions are persisted. Seam provides one <literal>PermissionStore</literal> implementation out of the box, <literal>JpaPermissionStore</literal>, which is used to store permissions inside a relational database. It is possible to write your own permission store by implementing the <literal>PermissionStore</literal> interface, which defines the following methods:
it_it: Il <literal>PersistentPermissionManager</literal> richiede un permission store per connettersi al dispositivo di memorizzazione dove sono registrati i permessi. Seam fornisce una implementazione di <literal>PermissionStore</literal> già fatta, <literal>JpaPermissionStore</literal>, che viene usata per memorizzare i permessi in un database relazionale. E' possibile scrivere il proprio permission store implementando l'interfaccia <literal>PermissionStore</literal>, che definisce i seguenti metodi:
ja_jp: <literal>PersistentPermissionResolver</literal>は、パーミッションを保存しているバックエンドの保存場所との接続のためにパーミッションストアを必要とします。 Seamは標準で一つの<literal>PermissionStore</literal>実装<literal>JpaPermissionStore</literal>を提供しており、リレーショナルデータベースにパーミッションを保存します。 下記のメソッドを定義している<literal>PermissionStore</literal>インタフェースを実装することにより、独自のパーミッションストアを作成する事も可能です。

source: PermissionStore interface
it_it: Interfaccia PermissionStore
ja_jp: パーミッションストアのインタフェース

source: This method should return a <literal>List</literal> of <literal>Permission</literal> objects representing all the permissions granted for the specified target object.
it_it: Questo metodo deve restituire una <literal>List</literal> di oggetti <literal>Permission</literal> che rappresenti tutti i permessi concessi per l'oggetto indicato come obiettivo.
ja_jp: このメソッドは対象のオブジェクトに付与されているすべての権限を表す<literal>Permission</literal>オブジェクトの<literal>List</literal>を返します。

source: This method should return a <literal>List</literal> of <literal>Permission</literal> objects representing all the permissions with the specified action, granted for the specified target object.
it_it: Questo metodo deve restituire una <literal>List</literal> di oggetti <literal>Permission</literal> che rappresenti tutti i permessi sull'azione specificata, concessi per l'oggetto indicato come obiettivo.
ja_jp: このメソッドは対象のオブジェクトに付与されている特定のアクションに対するすべての権限を表す<literal>Permission</literal>オブジェクトの<literal>List</literal>を返します。

source: This method should return a <literal>List</literal> of <literal>Permission</literal> objects representing all the permissions with the specified action, granted for the specified set of target objects.
it_it: Questo metodo deve restituire una <literal>List</literal> di oggetti <literal>Permission</literal> che rappresenti tutti i permessi sull'azione specificata concessi per l'insieme di oggetti indicati come obiettivi.
ja_jp: このメソッドは対象の一連のオブジェクトに付与されている特定のアクションに対するすべての権限を表す<literal>Permission</literal>オブジェクトの<literal>List</literal>を返します

source: This method should persist the specified <literal>Permission</literal> object to the backend storage, returning true if successful.
it_it: Questo metodo deve rendere persistente l'oggetto <literal>Permission</literal> specificato nel dispositivo di memorizzazione, restituendo vero se l'operazione si conclude senza errori.
ja_jp: このメソッドは特定の<literal>Permission</literal>オブジェクトをバックエンドのストレージに保持し、成功すればtrueを返します。

source: This method should persist all of the <literal>Permission</literal> objects contained in the specified <literal>List</literal>, returning true if successful.
it_it: Questo metodo deve rendere persisistenti tutti gli oggetti <literal>Permission</literal> contenuti nella <literal>List</literal> specificata, restituendo vero se l'operazione si conclude senza errori.
ja_jp: このメソッドは指定された <literal>List</literal>にある、すべての<literal>Permission</literal>オブジェクトをバックエンドのストレージに保持し、成功すればtrueを返します。

source: This method should remove the specified <literal>Permission</literal> object from persistent storage.
it_it: Questo metodo deve rimuove l'oggetto <literal>Permission</literal> specificato dal dispositivo di memorizzazione.
ja_jp: このメソッドは指定された<literal>Permission</literal>オブジェクトをストレージから削除します。

source: This method should remove all of the <literal>Permission</literal> objects in the specified list from persistent storage.
it_it: Questo metodo deve rimuovere dal dispositivo di memorizzazione tutti gli oggetti <literal>Permission</literal> specificati nella lista.
ja_jp: このメソッドは指定されたリストにあるすべての<literal>Permission</literal>オブジェクトをストレージから削除します。

source: This method should return a list of all the available actions (as Strings) for the class of the specified target object. It is used in conjunction with permission management to build the user interface for granting specific class permissions (see section further down).
it_it: Questo metodo deve restituire una lista di tutte le azioni disponibili (sotto forma di String) per la classe dell'oggetto specificato. Viene usato dalla gestione dei permessi per costruire l'interfaccia utente con cui si concedono i permessi sulle varie classi (vedi il paragrafo più avanti).
ja_jp: このメソッドは指定された対象オブジェクトクラスに対して可能なアクション（文字列型）のリストを返します。 特定のクラスのパーミッションを付与するためのユーザーインタフェースを作成するためにパーミッション管理と共に使用されます。

source: This is the default <literal>PermissionStore</literal> implementation (and the only one provided by Seam), which uses a relational database to store permissions. Before it can be used it must be configured with either one or two entity classes for storing user and role permissions. These entity classes must be annotated with a special set of security annotations to configure which properties of the entity correspond to various aspects of the permissions being stored.
it_it: E' l'implementazione di default di <literal>PermissionStore</literal> (e l'unica fornita da Seam), che usa un database relazionale per memorizzare i permessi. Prima di poter essere usata deve essere configurata con una o due classi per la memorizzazione dei permessi su utenti e ruoli. Queste classi entità devono essere annotate con uno speciale insieme di annotazioni relative alla sicurezza per configurare quali proprietà dell'entità corrispondono alle diverse caratteristiche dei permessi che devono essere memorizzati.
ja_jp: これはデフォルトの（また、Seamが提供する唯一の）<literal>PermissionStore</literal>の実装で、パーミッションの保存にリレーショナルデータベースを使用しています。 使用するためにはユーザーとロールのパーミッションの保存に係る一つないし二つのエンティティクラスの設定が必要になります。 これらのエンティティクラスは保存されているレコードとエンティティの属性がパーミッションのどれに対応するのかを設定するための特別なセキュリティに関するアノテーションでアノテートされている必要があります。

source: If you wish to use the same entity (i.e. a single database table) to store both user and role permissions, then only the <literal>user-permission-class</literal> property is required to be configured. If you wish to use separate tables for storing user and role permissions, then in addition to the <literal>user-permission-class</literal> property you must also configure the <literal>role-permission-class</literal> property.
it_it: Se si vuole usare la stessa entità (cioè una sola tabella sul database) per memorizzare sia i permessi degli utenti che quelli dei ruoli, allora è necessario configurare solo la proprietà <literal>user-permission-class</literal>. Se si vogliono usare due tabelle distinte per memorizzare i permessi degli utenti e quelli dei ruoli, allora in aggiunta alla proprietà <literal>user-permission-class</literal> si dovrà configurare anche la proprietà <literal>role-permission-class</literal>.
ja_jp: もしユーザーパーミッションとロールパーミッションに同一のエンティティ（一つのDBテーブル）を使うのであれば、<literal>user-permission-class</literal>属性を設定します。 ユーザーパーミッションとロールパーミッションを別々のテーブルに保持するのであれば、<literal>user-permission-class</literal>属性に加えて<literal>role-permission-class</literal>属性を設定する必要があります。

source: For example, to configure a single entity class to store both user and role permissions:
it_it: Ad esempio, per configurare una sola classe entità per memorizzare sia i permessi degli utenti che quelli dei ruoli:
ja_jp: 例えば、ユーザーとロールのパーミッションを一つのエンティティクラスに保存するよう設定する場合は次のようになります。

source: To configure separate entity classes for storing user and role permissions:
it_it: Per configurare classi entità separate per la memorizzazione dei permessi di utenti e ruoli:
ja_jp: ユーザーパーミッションとロールパーミッションを別のエンティティクラスに保存する場合の設定は次のようになります。

source: Permission annotations
it_it: Annotazioni relative ai permessi
ja_jp: パーミッション アノテーション
