Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: As mentioned, the entity classes that contain the user and role permissions must be configured with a special set of annotations, contained within the <literal>org.jboss.seam.annotations.security.permission</literal> package. The following table lists each of these annotations along with a description of how they are used:
it_it: Come già detto, le classi entità che contengono i permessi degli utenti e dei ruoli devono essere configurate con uno speciale insieme di annotazioni contenute nel package <literal>org.jboss.seam.annotations.security.permission</literal>. La seguente tabella elenca queste annotazioni insieme ad una descrizione su come sono usate:
ja_jp: 先述のように、ユーザーとロールのパーミッションを保持するエンティティクラスは<literal>org.jboss.seam.annotations.security.permission</literal>パッケージにある特別なアノテーションを設定されている必要があります。 下の表にこれらのアノテーションと、その使用方法の説明を示します。

source: Entity Permission annotations
it_it: Annotazioni per le entità dei permessi
ja_jp: エンティティ パーミッション アノテーション

source: Target
it_it: Obiettivo
ja_jp: ターゲット

source: This annotation identifies the property of the entity that will contain the permission target. The property should be of type <literal>java.lang.String</literal>.
it_it: Questa annotazione identifica la proprietà dell'entità che contiene l'obiettivo del permesso. La proprietà deve essere di tipo <literal>java.lang.Sting</literal>.
ja_jp: このアノテーションはパーミッションの対象を含んでいるエンティティの属性を示します。 この属性は<literal>java.lang.String</literal>でなければなりません。

source: This annotation identifies the property of the entity that will contain the permission action. The property should be of type <literal>java.lang.String</literal>.
it_it: Questa annotazione identifica la proprietà dell'entità che contiene l'azione. La proprietà deve essere di tipo <literal>java.lang.String</literal>.
ja_jp: このアノテーションはパーミッションアクションを含んでいるエンティティの属性を示します。 この属性は<literal>java.lang.String</literal>でなければなりません。

source: This annotation identifies the property of the entity that will contain the recipient user for the permission. It should be of type <literal>java.lang.String</literal> and contain the user's username.
it_it: Questa annotazione identifica la proprietà dell'entità che contiene l'utente a cui viene concesso il permesso. Deve essere di tipo <literal>java.lang.String</literal> e contenere la username dell'utente.
ja_jp: このアノテーションはパーミッションの受益ユーザーを含んでいるエンティティの属性を示します。 この属性は<literal>java.lang.String</literal>で、かつユーザーのusernameを含んでいなければなりません。

source: This annotation identifies the property of the entity that will contain the recipient role for the permission. It should be of type <literal>java.lang.String</literal> and contain the role name.
it_it: Questa annotazione identifica la proprietà dell'entità che contiene il ruolo a cui viene concesso il premesso. Deve essere di tipo <literal>java.lang.String</literal> e contenere i nome del ruolo.
ja_jp: このアノテーションはパーミッションの受益ロールを含んでいるエンティティの属性を示します。 この属性は<literal>java.lang.String</literal>で、かつロール名を含んでいなければなりません。

source: This annotation should be used when the same entity/table is used to store both user and role permissions. It identifies the property of the entity that is used to discriminate between user and role permissions. By default, if the column value contains the string literal <literal>user</literal>, then the record will be treated as a user permission. If it contains the string literal <literal>role</literal>, then it will be treated as a role permission. It is also possible to override these defaults by specifying the <literal>userValue</literal> and <literal>roleValue</literal> properties within the annotation. For example, to use <literal>u</literal> and <literal>r</literal> instead of <literal>user</literal> and <literal>role</literal>, the annotation would be written like this:
it_it: Questa annotazione deve essere usata quando la stessa entità/tabella viene usata per memorizzare sia i permessi degli utenti che quelli dei ruoli. Essa identifica la proprietà dell'entità che è usata per discriminare tra i permessi degli utenti e quelli dei ruoli. Per default, se il valore della colonna contiene la stringa <literal>user</literal>, allora il record sarà trattato come un permesso utente. Se contiene la stringa <literal>role</literal>, allora sarà trattato come un permesso del ruolo. E' anche possibile sovrascrivere questi valori specificando le proprietà <literal>userValue</literal> e <literal>roleValue</literal> all'interno delle annotazioni. Ad esempio, per usere <literal>u</literal> e <literal>r</literal> invece di <literal>user</literal> e <literal>role</literal>, le annotazioni dovranno essere scritte in questo modo:
ja_jp: このアノテーションはユーザーとロールパーミッションを同じエンティティ（テーブル）に保存する場合に使用します。 エンティティのユーザーとロールパーミッション属性の識別のために使用します。 デフォルトで、<literal>user</literal>ストリングリテラルを含むカラムをユーザーパーミッションのカラムと見なし、<literal>role</literal>ストリングリテラルを含むカラムをロールパーミッションのカラムと見なします。 アノテーション中で<literal>userValue</literal>と<literal>roleValue</literal>属性を指定する事により、これらのデフォルト値は上書きする事ができます。 例えば、<literal>user</literal>の代わりに<literal>u</literal>を、<literal>role</literal>の代わりに<literal>r</literal>を使うとすると、アノテーションは下のようになります。

source: Example Entity
it_it: Esempio di entità
ja_jp: エンティティの例

source: Here is an example of an entity class that is used to store both user and role permissions. The following class can be found inside the SeamSpace example:
it_it: Ecco un esempio di una classe entità che viene usata per memorizzare sia i permessi degli utenti che quelli dei ruoli. La seguente classe si trova nell'applicazione di esempio SeamSpace:
ja_jp: この例ではユーザーとロールパーミッションが一つのエンティティクラスに保持されています。 下に示したクラスはサンプルのSeamSpaceからのものです。

source: As can be seen in the above example, the <literal>getDiscriminator()</literal> method has been annotated with the <literal>@PermissionDiscriminator</literal> annotation, to allow <literal>JpaPermissionStore</literal> to determine which records represent user permissions and which represent role permissions. In addition, it can also be seen that the <literal>getRecipient()</literal> method is annotated with both <literal>@PermissionUser</literal> and <literal>@PermissionRole</literal> annotations. This is perfectly valid, and simply means that the <literal>recipient</literal> property of the entity will either contain the name of the user or the name of the role, depending on the value of the <literal>discriminator</literal> property.
it_it: Come si vede dall'esempio precedente, il metodo <literal>getDiscriminator()</literal> è stato annotato con l'annotazione <literal>@PermissionDiscriminator</literal> per consentire a <literal>JpaPermissionStore</literal> di determinare quali record rappresentano i permessi degli utenti e quali rappresentano i permessi dei ruoli. Inoltre si può vedere che il metodo <literal>getRecipient()</literal> è annotato sia con l'annotazione <literal>@PermissionUser</literal> che con <literal>@PermissionRole</literal>. Ciò è perfettamente valido e significa semplicemente che la proprietà <literal>recipient</literal> dell'entità conterrà sia il nome dell'utente che quello del ruolo, in funzione del valore della proprietà <literal>discriminator</literal>.
ja_jp: 上の例に見るように、<literal>getDiscriminator()</literal>メソッドが <literal>@PermissionDiscriminator</literal>でアノテートされ、どのレコードがユーザーのパーミッションを示し、どのレコードがロールパーミッションを示しているかを<literal>JpaPermissionStore</literal>に示しています。 さらに、<literal>getRecipient()</literal>メソッドが<literal>@PermissionUser</literal>と<literal>@PermissionRole</literal>でアノテートされています。 これは、間違いではなく <literal>discriminator</literal>属性の値により、エンティティの<literal>recipient</literal>属性の内容をユーザーの名前、あるいはロールの名前として処理する事を示しています。

source: Class-specific Permission Configuration
it_it: Configurazioni dei permessi specifiche per le classi
ja_jp: クラスに特定されたパーミッションの設定

source: A further set of class-specific annotations can be used to configure a specific set of allowable permissions for a target class. These permissions can be found in the <literal>org.jboss.seam.annotation.security.permission</literal> package:
it_it: Un ulteriore insieme di annotazioni specifiche per le classi può essere usato per specificare i permessi consentiti per una determinata classe obiettivo. Questi permessi si possono trovare nel package <literal>org.jboss.seam.annotation.security.permission</literal>:
ja_jp: これ以外のクラス特有のアノテーションを使用して対象クラスに対して特定のパーミッションを設定する事ができます。 これらのパーミッションは<literal>org.jboss.seam.annotation.security.permission</literal>パッケージにあります。

source: Class Permission Annotations
it_it: Annotazioni per i permessi sulle classi
ja_jp: クラス パーミッション アノテーション

source: A container annotation, this annotation may contain an array of <literal>@Permission</literal> annotations.
it_it: E' una annotazione contenitore, che può contenere un elenco di annotazioni <literal>@Permission</literal>.
ja_jp: コンテナのアノテーション、 このアノテーションは<literal>@Permission</literal>の配列を含んでいます。

source: This annotation defines a single allowable permission action for the target class. Its <literal>action</literal> property must be specified, and an optional <literal>mask</literal> property may also be specified if permission actions are to be persisted as bitmasked values (see next section).
it_it: Questa annotazione definisce una singola azione regolata da un permesso per la classe obiettivo. La sua proprietà <literal>action</literal> deve essere specificata e una proprietà opzionale <literal>mask</literal> può essere specificata se le azioni regolate da un permesso devono essere memorizzate come valori di una maschera di bit (vedi il paragrafo seguente).
ja_jp: このアノテーションでは対象クラスに対して一つのパーミッションアクションを認めています。 <literal>action</literal>属性が指定されていなければなりません。 また、ビットマスク値によるパーミッションアクションを指定する場合には <literal>mask</literal>が指定されていなければなりません。

source: Here's an example of the above annotations in action. The following class can also be found in the SeamSpace example:
it_it: Ecco un esempio di queste annotazioni al lavoro. La seguente classe si trova anch'essa nell'applicazione di esempio SeamSpace:
ja_jp: この例では、上のアノテーションを使っています。 下のクラスはサンプルのSeamSpaceにもあります。

source: This example demonstrates how two allowable permission actions, <literal>view</literal> and <literal>comment</literal> can be declared for the entity class <literal>MemberImage</literal>.
it_it: Questo esempio dimostra come due possibili azioni regolate da permesso, <literal>view</literal> e <literal>comment</literal> possono essere dichiarate per la classe entità <literal>MemberImage</literal>.
ja_jp: この例では<literal>view</literal>と<literal>comment</literal>の二つのパーミッションアクションを<literal>MemberImage</literal>エンティティクラスに対して宣言する方法を示しています。

source: Permission masks
it_it: Maschere di bit per i permessi
ja_jp: パーミッション マスク

source: By default, multiple permissions for the same target object and recipient will be persisted as a single database record, with the <literal>action</literal> property/column containing a comma-separated list of the granted actions. To reduce the amount of physical storage required to persist a large number of permissions, it is possible to use a bitmasked integer value (instead of a comma-separated list) to store the list of permission actions.
it_it: Per default più permessi per lo stesso obbiettivo e destinatario vengono memorizzati un singolo record sul database, con la proprietà/colonna <literal>action</literal> contenente un elenco delle azioni concesse separate da una virgola. Per ridurre la quantità di spazio fisico richiesto per memorizzare un numero elevato di permessi è possibile usare un valore intero come maschera di bit (al posto di un elenco di valori separati da virgole) per memorizzare l'elenco delle azioni consentite.
ja_jp: デフォルトでは、一つの対象オブジェクトと受益者に対する複数のパーミッションは、一つのデータベースレコードとして<literal>action</literal>属性（DBではカラム）に複数のアクションをコンマで区切って記述され、保持されます。 大量のパーミッション情報を、物理的な保存領域を抑えてデータベースに保存するために、パーミッションアクションにコンマ区切りの文字列リストの代わりに、整数のビットマスク値を使用する事ができます。

source: For example, if recipient "Bob" is granted both the <literal>view</literal> and <literal>comment</literal> permissions for a particular <literal>MemberImage</literal> (an entity bean) instance, then by default the <literal>action</literal> property of the permission entity will contain "<literal>view,comment</literal>", representing the two granted permission actions. Alternatively, if using bitmasked values for the permission actions, as defined like so:
it_it: Ad esempio, se al destinatario "Pippo" è concesso sia il permesso <literal>view</literal> che il permesso <literal>comment</literal> per una particolare istanza di <literal>MemberImage</literal> (un entity bean), allora per default la proprietà dell'entità permesso conterrà "<literal>view,comment</literal>", che rappresenta la concessione di due azioni. In alternativa, usando i valori di una maschera di bit per le azioni, si può definire in questo modo:
ja_jp: 例えば、受益者 "Bob"が特定の<literal>MemberImage</literal>（エンティティBean）インスタンスに対して <literal>view</literal>と<literal>comment</literal>のパーミッションが付与されていた場合、パーミッションエンティティの<literal>action</literal>属性は、二つのパーミッションアクションを付与されていることを示し"<literal>view,comment</literal>"を含んでいます。 代わりに、ビットマスクをパーミッションアクションに使用すると下のようになります。

source: The <literal>action</literal> property will instead simply contain "3" (with both the 1 bit and 2 bit switched on). Obviously for a large number of allowable actions for any particular target class, the storage required for the permission records is greatly reduced by using bitmasked actions.
it_it: La proprietà <literal>action</literal> conterrà semplicemente "3" (con sia il bit 1 che il bit 2 alzati). Ovviamente per un numero elevato di azioni da consentire per una particolare classe obiettivo, lo spazio richiesto per memorizzare i record dei permessi si riduce grandemente usando le azioni con la maschera di bit.
ja_jp: <literal>action</literal>属性は、この場合単に"3"（bit 1 と 2 がonの状態）となります。 特定の対象クラスに対する大量のアクション許可を記述する場合には、アクションにビットマスクを使用する事により、明らかにパーミッションレコードの保存に必要な容量を圧縮する事ができます。

source: Obviously, it is very important that the <literal>mask</literal> values specified are powers of 2.
it_it: E' molto importante che i valori assegnati a <literal>mask</literal> siano specificati come potenze di 2.
ja_jp: <literal>mask</literal>の値が2のｎ乗になっている事は明らかに重要です。

source: Identifier Policy
it_it: Risoluzione dell'identificatore
ja_jp: 識別子ポリシー

source: When storing or looking up permissions, <literal>JpaPermissionStore</literal> must be able to uniquely identify specific object instances to effectively operate on its permissions. To achieve this, an <emphasis>identifier strategy</emphasis> may be assigned to each target class for the generation of unique identifier values. Each identifier strategy implementation knows how to generate unique identifiers for a particular type of class, and it is a simple matter to create new identifier strategies.
it_it: Quando <literal>JpaPermissionStore</literal> memorizza o cerca un permesso deve essere in grado di identificare univocamente le istanze degli oggetti sui cui permessi deve operare. Per ottenere questo occorre assegnare una <emphasis>stragegia di risoluzione dell'identificatore</emphasis> per ciascuna classe obiettivo, in modo da generare i valori identificativi univoci. Ciascuna implementazione della strategia di risoluzione sa come genere gli identificativi univoci per un particolare tipo di classe ed è solo questione di creare nuove strategia di risoluzione.
ja_jp: <literal>JpaPermissionStore</literal>は、パーミッションを保存したり、参照したりするときに対象のインスタンスのパーミッションについて効果的に操作を行うために、対象インスタンスを一意に特定できる必要があります。 これを実現するために、ユニークなIDを生成するよう個々の対象となるクラスに対して<emphasis>identifier strategy</emphasis>がアサインされます。 それぞれのID戦略実装により、クラスのタイプに応じてユニークなIDの生成が行われます。

source: The <literal>IdentifierStrategy</literal> interface is very simple, declaring only two methods:
it_it: L'interfaccia <literal>IdentifierStrategy</literal> è molto semplice e dichiara solo due metodi:
ja_jp: <literal>IdentifierStrategy</literal>インタフェースはたいへんに単純で、二つのメソッドを宣言しているだけです。

source: The first method, <literal>canIdentify()</literal> simply returns <literal>true</literal> if the identifier strategy is capable of generating a unique identifier for the specified target class. The second method, <literal>getIdentifier()</literal> returns the unique identifier value for the specified target object.
it_it: Il primo metodo, <literal>canIdentify()</literal> restituisce semplicemente <literal>true</literal> se la strategia di risoluzione è in grado di generare un identificativo univoco per la classe obiettivo specificata. Il secondo metodo, <literal>getIdentifier()</literal> restituisce il valore dell'identificativo univoco per l'oggetto obiettivo specificato.
ja_jp: 最初のメソッド<literal>canIdentify()</literal>は、識別子ストラテジーが指定されたターゲットクラスに対してユニークな識別子を生成可能な場合に<literal>true</literal>を返します。 第2のメソッド<literal>getIdentifier()</literal>は指定されたターゲットオブジェクトに対してユニークな識別子の値を返します。

source: Seam provides two <literal>IdentifierStrategy</literal> implementations, <literal>ClassIdentifierStrategy</literal> and <literal>EntityIdentifierStrategy</literal> (see next sections for details).
it_it: Seam fornisce due implementazioni di <literal>IdentifierStrategy</literal>, <literal>ClassIdentifierStrategy</literal> e <literal>EntityIdentifierStrategy</literal> (vedi i prossimi paragrafi per i dettagli).
ja_jp: Seamは二つの<literal>IdentifierStrategy</literal>実装、<literal>ClassIdentifierStrategy</literal>と<literal>EntityIdentifierStrategy</literal>を提供しています（詳細は次のセクション）。

source: To explicitly configure a specific identifier strategy to use for a particular class, it should be annotated with <literal>org.jboss.seam.annotations.security.permission.Identifier</literal>, and the value should be set to a concrete implementation of the <literal>IdentifierStrategy</literal> interface. An optional <literal>name</literal> property can also be specified, the effect of which is dependent upon the actual <literal>IdentifierStrategy</literal> implementation used.
it_it: Per configurare esplicitamente la strategia di risoluzione da usare per una particolare classe, essa deve essere annotata con <literal>org.jboss.seam.annotations.security.permission.Identifier</literal>, e il valore deve essere impostato a una implementazione dell'interfaccia <literal>IdentifierStrategy</literal>. Una proprietà facoltativa <literal>name</literal> può essere specificata, e il suo effetto dipende dall'implementazione di <literal>IdentifierStrategy</literal> usata.
ja_jp: 特定のクラスに対して、特別のID戦略を使用するよう明示的に設定するには、<literal>org.jboss.seam.annotations.security.permission.Identifier</literal>アノテーションがされ、<literal>IdentifierStrategy</literal> インタフェースの実装に値が設定されている必要があります。 オプションとして<literal>name</literal>属性を指定する事も可能ですが、この指定が及ぼす効果は <literal>IdentifierStrategy</literal>の実際の実装に依存します。

source: This identifier strategy is used to generate unique identifiers for classes, and will use the value of the <literal>name</literal> (if specified) in the <literal>@Identifier</literal> annotation. If there is no <literal>name</literal> property provided, then it will attempt to use the component name of the class (if the class is a Seam component), or as a last resort it will create an identifier based on the name of the class (excluding the package name). For example, the identifier for the following class will be "<literal>customer</literal>":
it_it: Questa strategia di risoluzione degli identificatori è usata per generare gli identificatori univoci per le classi e userà il valore della proprietà <literal>name</literal> (se indicato) nell'annotazione <literal>@Identifier</literal>. Se la proprietà <literal>name</literal> non è indicata, allora tenterà di usare il nome del componente della classe (se la classe è un componente Seam), oppure, come ultima risorsa creerà un identificatore basato sul nome della classe (escludendo il nome del package). Ad esempio, l'identificatore per la seguente classe sarà "<literal>customr</literal>":
ja_jp: ID戦略はクラスに対してユニークなIDを生成するために使用し、指定してあれば<literal>@Identifier</literal>アノテーション中の <literal>name</literal>の値が使用されます。 もし、<literal>name</literal>属性が指定されていない場合には、Seamのコンポーネントであれば対象のクラスのコンポーネント名を使用するか、さもなくばパッケージ名を除くクラスの名前を使用します。 下の例にあるクラスのIDは"<literal>customer</literal>"となります。

source: The identifier for the following class will be "<literal>customerAction</literal>":
it_it: L'identificatore per la seguente classe sarà "<literal>customerAction</literal>":
ja_jp: 以下のクラスの識別子は"<literal>customerAction</literal>"となります:

source: Finally, the identifier for the following class will be "<literal>Customer</literal>":
it_it: Infine, l'identificatore per la seguente classe sarà "<literal>Customer</literal>":
ja_jp: 最終的に、以下のクラスの識別子は "<literal>Customer</literal>"となります:

source: This identifier strategy is used to generate unique identifiers for entity beans. It does so by concatenating the entity name (or otherwise configured name) with a string representation of the primary key value of the entity. The rules for generating the name section of the identifier are similar to <literal>ClassIdentifierStrategy</literal>. The primary key value (i.e. the <emphasis>id</emphasis> of the entity) is obtained using the <literal>PersistenceProvider</literal> component, which is able to correctly determine the value regardless of which persistence implementation is used within the Seam application. For entities not annotated with <literal>@Entity</literal>, it is necessary to explicitly configure the identifier strategy on the entity class itself, for example:
it_it: Questa strategia di risoluzione è usata per generare valori di identificatori univoci per gli entity bean. Quello che fa è concatenare il nome dell'entità (o un nome configurato in altro modo) con una stringa che rappresenta la chiave primaria dell'entità. Le regole per generare la parte nome dell'identificatore sono simili a <literal>ClassIdentifierStrategy</literal>. La chiave primaria (cioè l'<emphasis>id</emphasis> dell'entità) viene ottenuto usando il componente <literal>PersistenceProvider</literal>, che è in grado di determinarne il valore a prescindere dall'implementazione della persistenza utilizzata dall'applicazione Seam. Per le entità non annotate con <literal>@Entity</literal> è necessario configurare esplicitamente la strategia di risoluzione dell'identificatore nella classe entità stessa, ad esempio:
ja_jp: このID戦略はエンティティBean毎にユニークなIDを割り当てる方法で、エンティティのプライマリキーを示す文字列とエンティティの名前をつなぎ合わせて、IDを生成しています。 IDの名前セクションの生成ルールは<literal>ClassIdentifierStrategy</literal>と同様です。 プライマリキー値 (即ち、エンティティの<emphasis>id</emphasis> ) は <literal>PersistenceProvider</literal>コンポーネントを使って取得する事ができ、アプリケーションでどの永続性実装を使用しているかに依存せずに値を決める事ができます。 <literal>@Entity</literal>でアノテートされていないエンティティについては, エンティティクラス自身に下のように明示的にID戦略を設定する事が必要です。

source: For an example of the type of identifier values generated, assume we have the following entity class:
it_it: Per avere un esempio del tipo di valori di identificatore generati, supponiamo di avere la seguente classe entità:
ja_jp: 生成される識別子の例として、下のようなエンティティクラスを考えてみましょう。

source: For a <literal>Customer</literal> instance with an <literal>id</literal> value of <literal>1</literal>, the value of the identifier would be "<literal>Customer:1</literal>". If the entity class is annotated with an explicit identifier name, like so:
it_it: Per una istanza di <literal>Customer</literal> con un valore di <literal>id</literal> pari a <literal>1</literal>, il valore dell'identificatore sarà "<literal>Customer:1</literal>". Se l'entità è annotata con un nome esplicito di identificatore, come questo:
ja_jp: <literal>id</literal>が<literal>1</literal>の<literal>Customer</literal>のインスタンスに対する識別子は"<literal>Customer:1</literal>"となります。 もし、エンティティクラスに明示的な識別子名のアノテーションがあれば、
