Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: Seam Security provides an extensible framework for resolving application permissions. The following class diagram shows an overview of the main components of the permission framework:
it_it: La sicurezza di Seam fornisce un framework espandibile per risolvere i permessi dell'applicazione. Il seguente diagramma di classi mostra una panoramica dei componenti principali del framework dei permessi:
ja_jp: Seamセキュリティはアプリケーションに対するパーミッションの決定に対して拡張可能なフレームワークを提供します。 下のクラスダイアグラム図にはSeamの提供するパーミッションフレームワークの主要コンポーネントについて示しています。

source: The relevant classes are explained in more detail in the following sections.
it_it: Le classi rilevanti sono spiegate in maggiore dettaglio nel seguente paragrafo.
ja_jp: 関連するクラスについての詳細を以下のセクションに示します

source: This is actually an interface, which provides methods for resolving individual object permissions. Seam provides the following built-in <literal>PermissionResolver</literal> implementations, which are described in more detail later in the chapter:
it_it: Questa è in realtà un'interfaccia che fornisce i metodi per risolvere i singoli permessi sugli oggetti. Seam fornisce le seguenti implementazioni già fatte di <literal>PermissionResolver</literal>, che sono descritte in maggiore dettaglio più avanti in questo capitolo:
ja_jp: 実際には、これは個々のオブジェクトのアクセス権を決定するメソッドを提供するインタフェースです。 Seamは以下の<literal>PermissionResolver</literal>を内蔵しています。 それぞれの詳細はこの章の後半で説明します。

source: <literal>RuleBasedPermissionResolver</literal> - This permission resolver uses Drools to resolve rule-based permission checks.
it_it: <literal>RuleBasedPermissionResolver</literal> - Questo risolutore di permessi usa Drools per risolvere i controlli di permesso basati sulle regole.
ja_jp: <literal>RuleBasedPermissionResolver</literal> - このパーミッションリゾルバーはDroolsを使ってルールベースのパーミッションチェックを行います

source: <literal>PersistentPermissionResolver</literal> - This permission resolver stores object permissions in a persistent store, such as a relational database.
it_it: <literal>PersistentPermissionResolver</literal> - Questo risolutore di permessi memorizza gli oggetti permesso in un dispositivo persistente, come un database relazionale.
ja_jp: <literal>PersistentPermissionResolver</literal> - このパーミッションリゾルバーはデータベース等にパーミッションオブジェクトを保持します。

source: Writing your own PermissionResolver
it_it: Scrivere il proprio PermissionResolver
ja_jp: 独自のパーミッションリゾルバーの記述

source: It is very simple to implement your own permission resolver. The <literal>PermissionResolver</literal> interface defines only two methods that must be implemented, as shown by the following table. By deploying your own <literal>PermissionResolver</literal> implementation in your Seam project, it will be automatically scanned during deployment and registered with the default <literal>ResolverChain</literal>.
it_it: E' molto semplice implementare il proprio risolutore di permessi. L'interfaccia <literal>PermissionResolver</literal> definisce solo due metodi che devono essere implementati, come mostra la seguente tabella. Includendo la propria implementazione di <literal>PermissionResolver</literal> nel proprio progetto Seam, essa sarà automaticamente rilevata durante l'esecuzione e registrata nel <literal>ResolverChain</literal> predefinito.
ja_jp: 独自のパーミッションリゾルバを作成するためには、下の表にある<literal>PermissionResolver</literal>インタフェースに定義されている二つのメソッドを実装します。 独自の<literal>PermissionResolver</literal>実装をSeamプロジェクトにデプロイする事により、プロジェクトがデプロイされる時（立ち上がり時）に自動的にスキャンされ<literal>ResolverChain</literal>に組み込まれます。

source: PermissionResolver interface
it_it: L'interfaccia PermissionResolver
ja_jp: パーミッションリゾルバーインタフェース

source: Return type
it_it: Tipo restituito
ja_jp: 戻り値の型

source: This method must resolve whether the currently authenticated user (obtained via a call to <literal>Identity.getPrincipal()</literal>) has the permission specified by the <literal>target</literal> and <literal>action</literal> parameters. It should return <literal>true</literal> if the user has the permission, or <literal>false</literal> if they don't.
it_it: Questo metodo deve stabilire se l'utente attualmente autenticato (ottenuto tramite una chiamata a <literal>Identity.getPrincipal()</literal>) ha il permesso specificato dai parametri <literal>target</literal> e <literal>action</literal>. Deve restituire <literal>true</literal> se l'utente ha il permesso, oppure <literal>false</literal> se non ce l'ha.
ja_jp: このメソッドは<literal>Identity.getPrincipal()</literal>を呼ぶ事により得られる現在の認証されたユーザーが、パラメータで渡された<literal>target</literal>と<literal>action</literal>に対してパーミッションを有するか否かを解決し、パーミッションを有すればtrueを、無ければfalseを返します。

source: This method should remove any objects from the specified set, that would return <literal>true</literal> if passed to the <literal>hasPermission()</literal> method with the same <literal>action</literal> parameter value.
it_it: Questo metodo deve rimuovere dall'insieme specificato tutti gli oggetti per i quali si otterrebbe <literal>true</literal> se venissero passati al metodo <literal>hasPermission()</literal> con lo stesso valore del parametro <literal>action</literal>.

source: As they are cached in the user's session, any custom <literal>PermissionResolver</literal> implementations must adhere to a couple of restrictions. Firstly, they may not contain any state that is finer-grained than session scope (and the scope of the component itself should either be application or session). Secondly, they must not use dependency injection as they may be accessed from multiple threads simultaneously. In fact, for performance reasons it is recommended that they are annotated with <literal>@BypassInterceptors</literal> to bypass Seam's interceptor stack altogether.
it_it: Essendo conservati nella sessione dell'utente, ogni implementazione di <literal>PermissionResolver</literal> deve aderire ad un paio di restrizioni. In primo luogo, non possono contenere alcuna informazione di stato che abbia una visibilità inferiore a session (e la visibilità del componente stesso deve essere o application oppure session). In secondo luogo, non devono usare la dependency injection poiché ci potrebbero essere accessi da più thread contemporaneamente. Infatti, per ragioni di prestazioni, è raccomandabile annotare con <literal>@BypassInterceptors</literal> per evitare del tutto l'insieme degli intercettori Seam.

source: A <literal>ResolverChain</literal> contains an ordered list of <literal>PermissionResolver</literal>s, for the purpose of resolving object permissions for a particular object class or permission target.
it_it: Un <literal>ResolverChain</literal> contiene un elenco ordinato di <literal>PermissionResolver</literal>, con lo scopo di risolvere i permessi sugli oggetti di una determinata classe oppure i permessi obiettivo.
ja_jp: <literal>ResolverChain</literal>は<literal>PermissionResolver</literal>sを順番に並べたリストを持っており、このリストに従い、特定のオブジェクトクラス、あるいはパーミッション対象についてのパーミッションを解決します。

source: The default <literal>ResolverChain</literal> consists of all permission resolvers discovered during application deployment. The <literal>org.jboss.seam.security.defaultResolverChainCreated</literal> event is raised (and the <literal>ResolverChain</literal> instance passed as an event parameter) when the default <literal>ResolverChain</literal> is created. This allows additional resolvers that for some reason were not discovered during deployment to be added, or for resolvers that are in the chain to be re-ordered or removed.
it_it: La <literal>ResolverChain</literal> di default consiste di tutti i risolutori di permessi rilevati durante l'avvio dell'applicazione. L'evento <literal>org.jboss.seam.security.defaultResolverChainCreated</literal> viene lanciato (e l'istanza di <literal>ResolverChain</literal> viene passata come parametro dell'evento) quando il <literal>ResolverChain</literal> di default viene creato. Questo consente di aggiungere ulteriori risolutori che per qualche ragione non erano stati rilevati durante l'avvio, oppure di riordinare o rimuovere i risolutori che sono nell'elenco.

source: The following sequence diagram shows the interaction between the components of the permission framework during a permission check (explanation follows). A permission check can originate from a number of possible sources, for example - the security interceptor, the <literal>s:hasPermission</literal> EL function, or via an API call to <literal>Identity.checkPermission</literal>:
it_it: Il seguente diagramma di sequenza mostra l'interazione tra i componenti del framework dei permessi durante la verifica di un permesso (segue la spiegazione). Una verifica di permesso può essere originata da una serie di possibili fonti, ad esempio gli intercettori di sicurezza, la funzione EL <literal>s:hasPermission</literal>, oppure tramite una chiamata alla API <literal>Identity.checkPermission</literal>:
ja_jp: 下のシークエンス図にパーミッションチェック時のパーミッションフレームワーク内のコンポーネント相互の作用を示します。 パーミッションチェックは、例えば、セキュリティインタセプタ、EL式<literal>s:hasPermission</literal>、あるいはAPI<literal>Identity.checkPermission</literal>を呼び出す等、複数の方法により呼び出されます。

source: 1. A permission check is initiated somewhere (either in code or via an EL expression) resulting in a call to <literal>Identity.hasPermission()</literal>.
it_it: 1. Una verifica di permesso viene iniziata da qualche parte (dal codice o tramite un'espressione EL) provocando una chiamata a <literal>Identity.hasPermission()</literal>.
ja_jp: 1 パーミッションチェックはコードあるいはEL式評価により<literal>Identity.hasPermission()</literal>が呼び出されることにより実行されます。

source: 1.1. <literal>Identity</literal> invokes <literal>PermissionMapper.resolvePermission()</literal>, passing in the permission to be resolved.
it_it: 1.1. <literal>Identity</literal> chiama <literal>PermissionMapper.resolvePermission()</literal>, passando il permesso che deve essere risolto.
ja_jp: 1.1. <literal>Identity</literal>は解決対象のパーミッションを<literal>PermissionMapper.resolvePermission()</literal>を渡して呼び出します。

source: 1.1.1. <literal>PermissionMapper</literal> maintains a <literal>Map</literal> of <literal>ResolverChain</literal> instances, keyed by class. It uses this map to locate the correct <literal>ResolverChain</literal> for the permission's target object. Once it has the correct <literal>ResolverChain</literal>, it retrieves the list of <literal>PermissionResolver</literal>s it contains via a call to <literal>ResolverChain.getResolvers()</literal>.
it_it: 1.1.1. <literal>PermissionMapper</literal> conserva una <literal>Map</literal> di istanze di <literal>ResolverChain</literal>, indicizzate per classe. Usa questa mappa per identificare la giusta <literal>ResolverChain</literal> per l'oggetto obiettivo del permesso. Una volta che ha la giusta <literal>ResolverChain</literal>, recupera l'elenco dei <literal>PermissionResolver</literal> che contiene tramite una chiamata a <literal>ResolverChain.getResolvers()</literal>.
ja_jp: 1.1.1. <literal>PermissionMapper</literal>はクラスによりキー付けされた<literal>ResolverChain</literal>インスタンスの<literal>Map</literal>を維持しており、パーミッションの対象オブジェクトに対応して適切な<literal>ResolverChain</literal>を選択するように管理しています。 適切な<literal>ResolverChain</literal>を見つければ、<literal>ResolverChain.getResolvers()</literal>を呼び出し、管理している<literal>PermissionResolver</literal>sを読み込みます。

source: 1.1.2. For each <literal>PermissionResolver</literal> in the <literal>ResolverChain</literal>, the <literal>PermissionMapper</literal> invokes its <literal>hasPermission()</literal> method, passing in the permission instance to be checked. If any of the <literal>PermissionResolver</literal>s return <literal>true</literal>, then the permission check has succeeded and the <literal>PermissionMapper</literal> also returns <literal>true</literal> to <literal>Identity</literal>. If none of the <literal>PermissionResolver</literal>s return true, then the permission check has failed.
it_it: 1.1.2. Per ciascun <literal>PermissionResolver</literal> nel <literal>ResolverChain</literal>, il <literal>PermissionMapper</literal> chiama il suo metodo <literal>hasPermission()</literal>, passando l'istanza del permesso da verificare. Se qualcuno dei <literal>PermissionResolver</literal> restituisce <literal>true</literal>, allora la verifica del permesso ha avuto successo e il <literal>PermissionMapper</literal> restituisce anch'esso <literal>true</literal> a <literal>Identity</literal>. Se nessuno dei <literal>PermissionResolver</literal> restituisce <literal>true</literal>, allora la verifica del permesso è fallita.
ja_jp: 1.1.2. <literal>ResolverChain</literal>中の個々の<literal>PermissionResolver</literal>について<literal>PermissionMapper</literal>はパーミッションチェックの対象をパラメータとして渡して<literal>hasPermission()</literal>メソッドを呼び出します。 いずれかの<literal>PermissionResolver</literal>s が<literal>true</literal>を返せば、パーミッションチェックが成功したと見なし<literal>PermissionMapper</literal>が<literal>Identity</literal>に対して<literal>true</literal>を返します。 いずれの<literal>PermissionResolver</literal>sも<literal>true</literal>を返さなければ、 パーミッションチェックは失敗したことになります。

source: One of the built-in permission resolvers provided by Seam, <literal>RuleBasedPermissionResolver</literal> allows permissions to be evaluated based on a set of Drools (JBoss Rules) security rules. A couple of the advantages of using a rule engine are 1) a centralized location for the business logic that is used to evaluate user permissions, and 2) speed - Drools uses very efficient algorithms for evaluating large numbers of complex rules involving multiple conditions.
it_it: Uno dei risolutori di permesso già fatti forniti da Seam, <literal>RuleBasedPermissionResolver</literal>, consente di valutare i permessi in base ad un insieme di regole di sicurezza Drools (JBoss Rules). Un paio di vantaggi nell'uso di un motore di regole sono: 1) una posizione centralizzata della logica di gestione che è usata per valutare i permessi degli utenti; 2) la velocità, Drools usa algoritmi molto efficienti per valutare grandi quantità di regole complesse comprendenti condizioni multiple.
ja_jp: Seamに内蔵されているパーミッションリゾルバーの一つ<literal>RuleBasedPermissionResolver</literal>は、Drools(JBoss Rules)によるセキュリティルールに基づいたパーミッションの評価を受け付けます。 ルールエンジンを使う事の利点は； 1）ユーザーパーミッションの評価に使用されるビジネスロジックを一か所にまとめることができる 2）スピードーDroolは効率の良いアルゴリズムを使用し、多くの条件の元に多くの複雑なルールを評価することが可能になっています。

source: Requirements
it_it: Requisiti
ja_jp: 要求条件

source: If using the rule-based permission features provided by Seam Security, the following jar files are required by Drools to be distributed with your project:
it_it: Se si usa la funzione dei permessi basati sulle regole fornita dalla sicurezza di Seam, Drools richiede che i seguenti file jar siano distribuiti insieme al progetto:
ja_jp: Seamセキュリティの提供するルールベースのアクセス権を使用する場合には、Droolに必要な下記のjarファイルをディストリビューション含める必要があります。

source: Configuration
it_it: Configurazione
ja_jp: 設定

source: The configuration for <literal>RuleBasedPermissionResolver</literal> requires that a Drools rule base is first configured in <literal>components.xml</literal>. By default, it expects that the rule base is named <literal>securityRules</literal>, as per the following example:
it_it: La configurazione per <literal>RuleBasedPermissionResolver</literal> richiede che una base di regole venga prima configurata in <literal>components.xml</literal>. Per difetto si aspetta che questa base di regole sia chiamata <literal>securityRules</literal>, come nel seguente esempio:
ja_jp: <literal>RuleBasedPermissionResolver</literal>を設定するためには、<literal>components.xml</literal>にDroolのルールベースが設定されている必要があります。 このルールベースは下の例のように、デフォルトで<literal>securityRules</literal>と命名されていることを仮定しています。

source: The default rule base name can be overridden by specifying the <literal>security-rules</literal> property for <literal>RuleBasedPermissionResolver</literal>:
it_it: Il nome predefinito della base di regole può essere modificato specificando la proprietà <literal>security-rules</literal> per <literal>RuleBasedPermissionResolver</literal>:
ja_jp: デフォルトのルールベースの名前は<literal>RuleBasedPermissionResolver</literal>の<literal>security-rules</literal>属性で上書きする事ができます。

source: Once the <literal>RuleBase</literal> component is configured, it's time to write the security rules.
it_it: Una volta che il componente <literal>RuleBase</literal> è configurato, è il momento di scrivere le regole di sicurezza.
ja_jp: <literal>RuleBase</literal>コンポーネントを設定したら、次にセキュリティルールの記述をします。

source: Writing Security Rules
it_it: Scrivere le regole di sicurezza
ja_jp: セキュリティルールの記述

source: The first step to writing security rules is to create a new rule file in the <literal>/META-INF</literal> directory of your application's jar file. Usually this file would be named something like <literal>security.drl</literal>, however you can name it whatever you like as long as it is configured correspondingly in <literal>components.xml</literal>.
it_it: Il primo passo per scrivere delle regole di sicurezza è di creare un nuovo file di regole nella cartella <literal>/META-INF</literal> del file jar dell'applicazione. Di solito questo file dovrebbe essere chiamato qualcosa come <literal>security.drl</literal>, comunque lo si può chiamare nel modo che si preferisce purché sia configurato in maniera corrispondente in <literal>components.xml</literal>.
ja_jp: セキュリティルールを作成するためには、まずアプリケーションのjarファイルの<literal>/META-INF</literal>ディレクトリ下に新規のルールファイルを作ります。 通常このファイルは<literal>security.drl</literal>のように命名されますが、<literal>components.xml</literal>に別途指定しておけば、どのようにでも命名する事ができます。

source: So what should the security rules file contain? At this stage it might be a good idea to at least skim through the Drools documentation, however to get started here's an extremely simple example:
it_it: Dunque, che cosa deve contenere il file delle regole di sicurezza? A questo punto potrebbe essere una buona idea almeno sbirciare nella documentazione Drools, comunque per partire ecco un esempio estremamente semplice:
ja_jp: セキュリティルールの内容は？ この段階ではDroolsのドキュメントから適当に拝借してくるのが良いかもしれませんが、ここでは非常に単純な例から始めてみる事にしましょう

source: Let's break this down step by step. The first thing we see is the package declaration. A package in Drools is essentially a collection of rules. The package name can be anything you want - it doesn't relate to anything else outside the scope of the rule base.
it_it: Dividiamolo passo per passo. La prima cosa che vediamo è la dichiarazione del package. Un package in Drools è essenzialmente una collezione di regole. Il nome del package può essere qualsiasi, non è in relazione con niente che sia al di fuori della visibilità della base di regole.
ja_jp: では、一つづつ見てゆきましょう。 最初はパッケージ宣言です。 Droolのパッケージはルールの集まりで、ルールベースの範囲外とは何ら関わりが無いので、パッケージの名前は任意で構いません。

source: The next thing we can notice is a couple of import statements for the <literal>PermissionCheck</literal> and <literal>Role</literal> classes. These imports inform the rules engine that we'll be referencing these classes within our rules.
it_it: La cosa successiva che possiano notare è un paio di dichiarazioni <literal>import</literal> per le classi <literal>PermissionCheck</literal> e <literal>Role</literal>. Questi <literal>import</literal> informano il motore di regole che all'interno delle nostre regole faremo riferimento a queste classi.
ja_jp: つぎに、<literal>PermissionCheck</literal>クラスと<literal>Role</literal>クラスに関するいくつかのインポート文があります。 これらのインポート文は、これから使うルールでこれらのクラスを参照する事をルールエンジンに対して伝えています。

source: Finally we have the code for the rule. Each rule within a package should be given a unique name (usually describing the purpose of the rule). In this case our rule is called <literal>CanUserDeleteCustomers</literal> and will be used to check whether a user is allowed to delete a customer record.
it_it: Infine abbiamo il codice della regola. Ogni regola all'interno di un package deve avere un nome univoco (di solito descrive lo scopo della regola). In questo caso la nostra regola si chiama <literal>CanUserDeleteCustomers</literal> e verrà usata per verificare se ad un utente è consentito di cancellare un record relativo ad un cliente.
ja_jp: そして、ルールの記述コード。それぞれのルールは、ルールごとにユニークな名前が与えられている必要があります (通常は、ルールの目的をルールの名前にします。) この例の場合、<literal>CanUserDeleteCustomers</literal>がルールの名前で、読んで字の如く、顧客レコードの削除をできるかできないかのチェックに使用します。

source: Looking at the body of the rule definition we can notice two distinct sections. Rules have what is known as a left hand side (LHS) and a right hand side (RHS). The LHS consists of the conditional part of the rule, i.e. a list of conditions which must be satisfied for the rule to fire. The LHS is represented by the <literal>when</literal> section. The RHS is the consequence, or action section of the rule that will only be fired if all of the conditions in the LHS are met. The RHS is represented by the <literal>then</literal> section. The end of the rule is denoted by the <literal>end</literal> line.
it_it: Guardando il corpo della definizione della regola si possono notare due distinte sezioni. Le regole hanno quello che è noto come lato sinistro (LHS, left hand side) e un lato destro (RHS, right hand side). Il lato sinistro consiste nella parte condizionale della regola, cioè l'elenco delle condizioni che devono essere soddisfatte per la regola si applichi. Il lato sinistro è rappresentato dalla sezione <literal>when</literal>. Il lato destro è la conseguenza, o la parte di azione della regola che si applica solo se tutte le condizioni del lato sinistro sono verificate. Il lato destro è rappresentato dalla sezione <literal>then</literal>. La fine della regola è stabilita dalla linea <literal>end</literal>.
ja_jp: ルールの記述が二つの部分から成っている事がわかります。ルールは左部分 (LHS) と右部分 (RHS) として知られている部分から成り立っています。LHSはルールの条件部分 (即ち、ルールが実行されるために満たさなければならない条件のリスト) を規定しています。 LHSは<literal>when</literal>で表されるセクションにあり、また、RHSはLHSが満たされた場合に実行されるアクション、あるいは結果を記述しています。 RHSは<literal>then</literal>以降の部分に記述します。 また、ルールの最後は<literal>end</literal>で終了します。

source: If we look at the LHS of the rule, we see two conditions listed there. Let's examine the first condition:
it_it: Se guardiamo la parte sinistra della regola vediamo che ci sono due condizioni. Esaminiamo la prima condizione:
ja_jp: ルールについてLHSを見ると、二つの条件がある事が分かります。 まず、最初の条件を見てみましょう。

source: In plain english, this condition is stating that there must exist a <literal>PermissionCheck</literal> object with a <literal>target</literal> property equal to "customer", and an <literal>action</literal> property equal to "delete" within the working memory.
it_it: Letta in inglese questa condizione dice che all'interno della working memory deve esistere un oggetto <literal>PermissionCheck</literal> con una proprietà <literal>target</literal> uguale a "customer" e una proprietà <literal>action</literal> uguale a "delete".
ja_jp: この条件は、簡単な英語で「ワーキングメモリ中に、<literal>target</literal>属性として"customer"を持ち、<literal>target</literal>属性として"delete"を持つ<literal>PermissionCheck</literal>オブジェクトが存在しなければならない」と示しています。
