Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: Security
it_it: Sicurezza
ja_jp: セキュリティ

source: Overview
it_it: Panoramica
ja_jp: 概要

source: The Seam Security API provides a multitude of security-related features for your Seam-based application, covering such areas as:
it_it: Le API della sicurezza di Seam forniscono una serie di caratteristiche relative alla sicurezza di un'applicazione basata su Seam, coprendo le seguenti aree:
ja_jp: SeamのセキュリティAPIはSeamベースのアプリケーションに種々のセキュリティ関連機能を提供します。 これらの機能には、以下のようなものがあります。

source: Authentication - an extensible, JAAS-based authentication layer that allows users to authenticate against any security provider.
it_it: Autenticazione - uno strato estensibile, basato su JAAS che consente all'utente di autenticarsi con qualsiasi fornitore di servizi di sicurezza.
ja_jp: 認証ー種々のセキュリティプロバイダによるユーザー認証を可能にする、拡張可能なJAASベースの認証層を提供します

source: Identity Management - an API for managing a Seam application's users and roles at runtime.
it_it: Gestione delle identità - una API per gestire a run time gli utenti e i ruoli di una applicazione Seam.
ja_jp: ID管理ーSeamアプリケーション動作時にユーザーとロールを管理するAPIを提供します

source: Authorization - an extremely comprehensive authorization framework, supporting user roles, persistent and rule-based permissions, and a pluggable permission resolver for easily implementing customised security logic.
it_it: Autorizzazione - un framework di autorizzazione estremamente comprensibile, che gestisce i ruoli degli utenti, i permessi persistenti oppure basati sulle regole e un risolutore di permessi modulare che consente di implementare facilmente una logica personalizzata per la gestione della sicurezza.
ja_jp: 認可ーユーザーロール、永続的なルールをベースにしたパーミッションや、カスタマイズ可能でセキュリティロジックを簡単に実装できるプラグイン可能な許可リゾルバーをサポートする、非常に包括的な、認可フレームワーク

source: Permission Management - a set of built-in Seam components to allow easy management of an application's security policy.
it_it: Gestione dei permessi - un insieme di componenti Seam predefiniti che consente una gestione facile delle politiche di sicurezza dell'applicazione.
ja_jp: パーミッション管理ーアプリケーションのセキュリティポリシーを容易に管理する事を可能にする一連のSeam組み込みコンポーネント

source: CAPTCHA support - to assist in the prevention of automated software/scripts abusing your Seam-based site.
it_it: Gestione dei CAPTCHA - per assistere nella prevenzione dagli attacchi automatici tramite software o script verso un sito basato su Seam.
ja_jp: CAPCHAのサポートーSeamで作られたサイトを自動検索プログラムスクリプトによる予期しない動作から保護するための支援をします

source: And much more
it_it: E molto altro
ja_jp: 等々

source: This chapter will cover each of these features in detail.
it_it: Queste capitolo si occuperà in dettaglio di ciascuna di queste caratteristiche.
ja_jp: この章ではこれらの機能の詳細について説明します

source: Disabling Security
it_it: Disabilitare la sicurezza
ja_jp: セキュリティの無効化

source: In some situations it may be necessary to disable Seam Security, for instances during unit tests or because you are using a different approach to security, such as native JAAS. Simply call the static method <literal>Identity.setSecurityEnabled(false)</literal> to disable the security infrastructure. Of course, it's not very convenient to have to call a static method when you want to configure the application, so as an alternative you can control this setting in components.xml:
it_it: In determinate situazioni può essere necessario disabilitare la gestione della sicurezza in Seam, ad esempio durante i test oppure perché si sta usando un diverso approccio alla sicurezza, come l'uso diretto di JAAS. Per disabilitare l'infrastruttura della sicurezza chiamare semplicemente il metodo statico <literal>Identity.setSecurityEnabled(false)</literal>. Ovviamente non è molto pratico dover chiamare un metodo statico quando si vuole configurare un'applicazione, perciò in alternativa è possibile controllare questa impostazione in components.xml:

source: Entity Security
it_it: Sicurezza delle entità
ja_jp: エンティティのセキュリティ

source: Hibernate Security Interceptor
it_it: Intercettore della sicurezza in Hibernate
ja_jp: Hibernateセキュリティインタセプタ

source: Seam Security Interceptor
it_it: Intercettore della sicurezza in Seam
ja_jp: Seamセキュリティインタセプタ

source: Page restrictions
it_it: Restrizioni sulle pagine
ja_jp: ページ単位の制約

source: Servlet API security integration
it_it: Integrazione con la sicurezza delle API Servlet

source: Assuming you are planning to take advantage of what Seam Security has to offer, the rest of this chapter documents the plethora of options you have for giving your user an identity in the eyes of the security model (authentication) and locking down the application by establishing constraints (authorization). Let's begin with the task of authentication since that's the foundation of any security model.
it_it: Assumendo che si stia pianificando di sfruttare i vantaggi che la sicurezza Seam ha da offrire, il resto di questo capitolo documenta l'insieme delle opzioni disponibili per dare agli utenti un'identità dal punto di vista del modello di sicurezza (autenticazione) e un accesso limitato all'applicazione secondo dei vincoli stabiliti (autorizzazione). Iniziamo con la questione dell'autenticazione poiché è il fondamento di ogni modello di sicurezza.

source: Authentication
it_it: Autenticazione
ja_jp: 認証

source: The authentication features provided by Seam Security are built upon JAAS (Java Authentication and Authorization Service), and as such provide a robust and highly configurable API for handling user authentication. However, for less complex authentication requirements Seam offers a much more simplified method of authentication that hides the complexity of JAAS.
it_it: Le caratteristiche relative all'autenticazione nella gestione della sicurezza di Seam sono costruite su JAAS (Java Authentication and Authorization Service, servizio di autenticazione e autorizzazione Java) e, come tali, forniscono una API robusta e altamente configurabile per gestire l'autenticazione degli utenti. Comunque, per requisiti di autenticazione meno complessi, Seam offre un metodo di autenticazione molto semplificato che nasconde la complessità di JAAS.
ja_jp: Seam セキュリティの提供する認証機構は JAAS (Java Authentication and Authorization Service) の上に構築されており、 ユーザー認証のための堅牢で設定の自由度の高い API を提供しています。 しかしながら、 Seamで は JAAS の複雑さを隠蔽したより単純化された認証機構も提供しています。

source: Configuring an Authenticator component
it_it: Configurare un componente Authenticator
ja_jp: 認証コンポーネントの設定

source: If you use Seam's Identity Management features (discussed later in this chapter) then it is not necessary to create an authenticator component (and you can skip this section).
it_it: Nel caso si utilizzino le funzioni di gestione delle identità di Seam (discusse più avanti in questo capitolo) non è necessario creare un componente Authenticator (e si può saltare questo paragrafo).
ja_jp: この章で解説するSeamのID管理機能を使用するのであれば、authenticator（認証）コンポーネントを作成する必要はありませんのでこの章を飛ばしても結構です。

source: The simplified authentication method provided by Seam uses a built-in JAAS login module, <literal>SeamLoginModule</literal>, which delegates authentication to one of your own Seam components. This login module is already configured inside Seam as part of a default application policy and as such does not require any additional configuration files. It allows you to write an authentication method using the entity classes that are provided by your own application, or alternatively to authenticate with some other third party provider. Configuring this simplified form of authentication requires the <literal>identity</literal> component to be configured in <literal>components.xml</literal>:
it_it: Il metodo di autenticazione semplificato fornito da Seam usa un modulo di login JAAS già fatto, <literal>SeamLoginModule</literal>, il quale delega l'autenticazione ad uno dei componenti dell'applicazione. Questo modulo di login è già configurato all'interno di Seam come parte dei criteri di gestione di default e in quanto tale non richiede alcun file di configurazione aggiuntivo. Esso consente di scrivere un metodo di autenticazione usando le classi entità che sono fornite dall'applicazione o, in alternativa, di esegure l'autenticazione con qualche altro fornitore di terze parti. Per configurare questa forma semplificata di autentifica è richiesto di di configurare il componente <literal>Identity</literal> in <literal>components.xml</literal>:
ja_jp: 単純な認証機構ではSeamアプリケーションのコンポーネントに認証を委ねる<literal>SeamLoginModule</literal>（これは、Seamに内蔵されているJAASのログインモジュールです）を使います。 このログインモジュールはSeamのデフォルトのアプリケーションポリシーとして予め設定されていますので、新たに設定に追加する事なく使用することができます。 また、作成したアプリケーションのエンティティクラスを利用して、認証メソッドを記述したり、 サード―パーティのプロバイダを使った認証をする事ができます。 この「単純な認証機構」を利用するためには<literal>components.xml</literal>に下記のように<literal>identity</literal>コンポーネントを設定する必要があります。

source: The EL expression <literal>#{authenticator.authenticate}</literal> is a method binding that indicates the <literal>authenticate</literal> method of the <literal>authenticator</literal> component will be used to authenticate the user.
it_it: L'espressione EL <literal>#{authenticator.authenticate}</literal> è la definizione di un metodo tramite la quale si indica che il metodo <literal>authenticate</literal> del componente <literal>authenticator</literal> verrà usato per autenticare l'utente.
ja_jp: EL式 <literal>#{authenticator.authenticate}</literal> は<literal>authenticator</literal>コンポーネントの<literal>authenticate</literal>メソッドを使って、ユーザーの認証を行うことを示すメソッドバインディングです。

source: Writing an authentication method
it_it: Scrivere un metodo di autenticazione
ja_jp: 認証メソッドの記述

source: The <literal>authenticate-method</literal> property specified for <literal>identity</literal> in <literal>components.xml</literal> specifies which method will be used by <literal>SeamLoginModule</literal> to authenticate users. This method takes no parameters, and is expected to return a boolean, which indicates whether authentication is successful or not. The user's username and password can be obtained from <literal>Credentials.getUsername()</literal> and <literal>Credentials.getPassword()</literal>, respectively (you can get a reference to the <literal>credentials</literal> component via <literal>Identity.instance().getCredentials()</literal>). Any roles that the user is a member of should be assigned using <literal>Identity.addRole()</literal>. Here's a complete example of an authentication method inside a POJO component:
it_it: La proprietà <literal>authenticate-method</literal> specificata per <literal>identity</literal> in <literal>components.xml</literal> specifica quale metodo sarà usato dal <literal>SeamLoginModule</literal> per autenticare l'utente. Questo metodo non ha parametri ed è previsto che restituisca un boolean, il quale indica se l'autenticazione ha avuto successo o no. Il nome utente e la password possono essere ottenuti da <literal>Credentials.getUsername()</literal> e <literal>Credentials.getPassword()</literal> rispettivamente (è possibile avere un riferimento al componente <literal>credentials</literal> tramite <literal>Identity.instance().getCredentials()</literal>). Tutti i ruoli di cui l'utente è membro devono essere assegnati usando <literal>Identity.addRole()</literal>. Ecco un esempio completo di un metodo di autenticazione all'interno di un componente POJO:
ja_jp: <literal>components.xml</literal> 中の<literal>identity</literal>の<literal>authenticate-method</literal>プロパティで<literal>SeamLoginModule</literal>にユーザーの認証に使うメソッドを指定します。 このメソッドはパラメータを取らず、認証が成功したか否かのboolean型を返します。 ユーザーのusernameとpasswordは<literal>Credentials.getUsername()</literal> と <literal>Credentials.getPassword()</literal>からそれぞれ取得します（また、<literal>Identity.instance().getCredentials()</literal>から<literal>credentials</literal>コンポーネントを参照する事もできます）。 ユーザーがメンバーとして参加するロールは<literal>Identity.addRole()</literal>により指定される必要があります。 以下にPOJOコンポーネント中の認証メソッドの完全な例を示します。

source: In the above example, both <literal>User</literal> and <literal>UserRole</literal> are application-specific entity beans. The <literal>roles</literal> parameter is populated with the roles that the user is a member of, which should be added to the <literal>Set</literal> as literal string values, e.g. "admin", "user". In this case, if the user record is not found and a <literal>NoResultException</literal> thrown, the authentication method returns <literal>false</literal> to indicate the authentication failed.
it_it: Nell'esempio precedente sia <literal>User</literal> che <literal>UserRole</literal> sono entity bean specifici dell'applicazione. Il parametro <literal>roles</literal> è popolato con i ruoli di cui l'utente è membro, che devono essere aggiunti alla <literal>Set</literal> come valori stringa, ad esempio "amministratore", "utente". In questo caso, se il record dell'utente non viene trovato e una <literal>NoResultException</literal> viene lanciata, il metodo di autenticazione restituisce <literal>false</literal> per indicare che l'autenticazione è fallita.
ja_jp: 上記の例では、<literal>User</literal>と<literal>UserRole</literal>はアプリケーション独自のエンティティBeanとなっています。 パラメータ <literal>roles</literal> は "admin", "user" の様に文字列として、<literal>Set</literal>に追加されてゆく必要があります。 この例の場合、userが見付からずに<literal>NoResultException</literal>が投げられた場合には、認証メソッドは<literal>false</literal>を返して、認証が失敗したことを示します。

source: When writing an authenticator method, it is important that it is kept minimal and free from any side-effects. This is because there is no guarantee as to how many times the authenticator method will be called by the security API, and as such it may be invoked multiple times during a single request. Because of this, any special code that should execute upon a successful or failed authentication should be written by implementing an event observer. See the section on Security Events further down in this chapter for more information about which events are raised by Seam Security.
it_it: Nella scrittura di metodo di autenticazione è importante ridurlo al minimo e libero da ogni effetto collaterale. Il motivo è che non c'è garanzia sul numero di volte che il metodo di autenticazione può essere chiamato dalle API della sicurezza, di conseguenza esso potrebbe essere invocato più volte durante una singola richiesta. Perciò qualsiasi codice che si vuole eseguire in seguito ad una autenticazione fallita o completata con successo dovrebbe essere scritto implementando un observer. Vedi il paragrafo sugli Eventi di Sicurezza più avanti in questo capitolo per maggiori informazioni su quali eventi sono emessi dalla gestione della sicurezza Seam.
ja_jp: 認証メソッドを記述する場合、副次的な影響を受けない、あるいは影響が最小になるようにすることが重要です。 これは、セキュリティAPIにより何回認証メソッドが呼び出されるのか保証が無く、一回の要求で複数回実行されることもあるからです。 このため、認証が成功あるいは失敗した時に実行されるコードはイベントオブザーバを利用して記述されるべきです。 Seamのセキュリティにより発生するイベントについての詳細はこの章の後半に記載されています。

source: The <literal>Identity.addRole()</literal> method behaves differently depending on whether the current session is authenticated or not. If the session is not authenticated, then <literal>addRole()</literal> should <emphasis>only</emphasis> be called during the authentication process. When called here, the role name is placed into a temporary list of pre-authenticated roles. Once authentication is successful, the pre-authenticated roles then become "real" roles, and calling <literal>Identity.hasRole()</literal> for those roles will then return true. The following sequence diagram represents the list of pre-authenticated roles as a first class object to show more clearly how it fits in to the authentication process.
it_it: Il metodo <literal>Identity.addRole()</literal> si comporta in modo diverso a seconda che la sessione corrente sia autenticata o meno. Se la sessione non è autenticata, allora <literal>addRole()</literal> dovrebbe essere chiamato <emphasis>solo</emphasis> durante il processo di autenticazione. Quando viene chiamato in questo contesto, il nome del ruolo è messo in una lista temporanea di ruoli pre autenticati. Una volta che l'autenticazione è completata i ruoli pre autenticati diventano ruoli "reali" e chiamando <literal>Identity.hasRole()</literal> per questi ruoli si otterrà <literal>true</literal>. Il seguente diagramma di sequenza rappresenta la lista dei ruoli pre autenticati come oggetto in primo piano per mostrare più chiaramente come si inserisce nel processo di autenticazione.
ja_jp: <literal>Identity.addRole()</literal>メソッドは現在のユーザーが認証されているか否かで動作が異なります。 認証されていないセッションの場合には、<literal>addRole()</literal>は認証過程でのみ呼び出され、指定されたロールは、認証されていないロールの仮のリストに登録され、認証が成功すると、仮のロールから実際のロールに移行し、このロールで<literal>Identity.hasRole()</literal>が実行され、trueが返されます。 以下のシークエンス図に、仮の認証ロールリストの認証プロセスにおける役割について示します。

source: If the current session is already authenticated, then calling <literal>Identity.addRole()</literal> will have the expected effect of immediately granting the specified role to the current user.
it_it: Se la sessione corrente è già autenticata, allora la chiamata <literal>Identity.addRole()</literal> avrà l'effetto atteso di concedere immediatamente il ruolo specificato all'utente corrente.
ja_jp: カレントセッションがすでに認証されている場合に<literal>Identity.addRole()</literal> を呼ぶと指定されたロールが即座に現在のユーザーに付与されます。

source: Writing an event observer for security-related events
it_it: Scrivere un observer per gli eventi relativi alla sicurezza
ja_jp: セキュリティ関連のイベントのためのオブザーバの記述

source: Say for example, that upon a successful login that some user statistics must be updated. This would be done by writing an event observer for the <literal>org.jboss.seam.security.loginSuccessful</literal> event, like this:
it_it: Supponiamo, ad esempio, che in seguito ad un accesso concluso con successo debbano essere aggiornate certe statistiche relative all'utente. Questo può essere fatto scrivendo un observer per l'evento <literal>org.jboss.seam.security.loginSuccessful</literal>, come questo:
ja_jp: 例として、ログインに成功する度にユーザーの統計データを更新する場合を考えてみましょう。 これは、<literal>org.jboss.seam.security.loginSuccessful</literal>イベントのオブザーバを記述する事により、以下のように実現できます。

source: This observer method can be placed anywhere, even in the Authenticator component itself. You can find more information about security-related events later in this chapter.
it_it: Questo metodo observer può essere messo ovunque, anche nello stesso componente Authenticator. E' possibile trovare maggiori informazioni sugli eventi relativi alla sicurezza più avanti in questo capitolo.
ja_jp: このオブザーバメソッドは、Authenticatorコンポーネントを含め、どこにおいても構いません。 セキュリティ関連のイベントについてこの章でさらに見てゆきます。

source: Writing a login form
it_it: Scrivere una form di accesso
ja_jp: ログインフォームの記述

source: The <literal>credentials</literal> component provides both <literal>username</literal> and <literal>password</literal> properties, catering for the most common authentication scenario. These properties can be bound directly to the username and password fields on a login form. Once these properties are set, calling <literal>identity.login()</literal> will authenticate the user using the provided credentials. Here's an example of a simple login form:
it_it: Il componente <literal>credentials</literal> fornisce sia la proprietà <literal>username</literal> che la <literal>password</literal>, soddisfacendo lo scenario di autenticazione più comune. Queste proprietà possono essere collegate direttamente ai campi username e password di una form di accesso. Una volta che queste proprietà sono impostate, chiamando <literal>identity.login()</literal> si otterrà l'autenticazione dell'utente usando le credenziali fornite. Ecco un esempio di una semplice form di accesso:
ja_jp: <literal>credentials</literal> コンポーネントは<literal>username</literal>および<literal>password</literal>属性を保持しており、一般的な認証処理に対応できるようになっています。 これらの属性はログインフォームのusernameとpasswordフィールドに直接バインドする事が可能です。 これらの属性が設定されてしまえば、後は<literal>identity.login()</literal>を呼び出すことにより、保持されているusernameとpasswordによるユーザーの認証が行われます。簡単なログインフォームの例を示します。

source: <![CDATA[<div> <h:outputLabel for="name" value="Username"/> <h:inputText id="name" value="#{credentials.username}"/> </div> <div> <h:outputLabel for="password" value="Password"/> <h:inputSecret id="password" value="#{credentials.password}"/> </div> <div> <h:commandButton value="Login" action="#{identity.login}"/> </div>]]>
it_it: <![CDATA[<div> <h:outputLabel for="name" value="Nome utente"/> <h:inputText id="name" value="#{credentials.username}"/> </div> <div> <h:outputLabel for="password" value="Password"/> <h:inputSecret id="password" value="#{credentials.password}"/> </div> <div> <h:commandButton value="Accedi" action="#{identity.login}"/> </div>]]>

source: Similarly, logging out the user is done by calling <literal>#{identity.logout}</literal>. Calling this action will clear the security state of the currently authenticated user, and invalidate the user's session.
it_it: Allo stesso modo, l'uscita dell'utente viene fatta chiamando <literal>#{identity.logout}</literal>. La chiamata di questa azione cancellerà lo stato della sicurezza dell'utente correntemente autenticato e invaliderà la sessione dell'utente.
ja_jp: （loginと）同様にログアウトも、<literal>#{identity.logout}</literal>を呼び出すことにより実行されます。ログアウトを実行することにより、現在認証されているユーザーのセキュリティの状態をクリアし、セッションは無効化されます。

source: Configuration Summary
it_it: Riepilogo della configurazione
ja_jp: 設定のまとめ

source: So to sum up, there are the three easy steps to configure authentication:
it_it: Riepilogando, ci sono tre semplici passi per configurare l'autenticazione:
ja_jp: まとめとして、認証システムを設定するためには、以下の三つのステップが必要となります。

source: Configure an authentication method in <literal>components.xml</literal>.
it_it: Configurare un metodo di autenticazione in <literal>components.xml</literal>.
ja_jp: 認証メソッドを<literal>components.xml</literal>に設定する。

source: Write an authentication method.
it_it: Scrivere un metodo di autenticazione.
ja_jp: 認証メソッドを記述する。

source: Write a login form so that the user can authenticate.
it_it: Scrivere una form di accesso così che l'utente possa autenticarsi.
ja_jp: ユーザーを認証するためのログインフォームを記述する。

source: Remember Me
it_it: Ricordami su questo computer
ja_jp: Remember Me （覚えておいて！）

source: Seam Security supports the same kind of "Remember Me" functionality that is commonly encountered in many online web-based applications. It is actually supported in two different "flavours", or modes - the first mode allows the username to be stored in the user's browser as a cookie, and leaves the entering of the password up to the browser (many modern browsers are capable of remembering passwords).
it_it: La sicurezza di Seam gestisce lo stesso tipo di funzionalità "Ricordami su questo computer" che si incontra comunemente in molte applicazioni basate sull'interfaccia web. In effetti essa è gestita in due diverse "varietà" o modalità. La prima modalità consente al nome utente di essere memorizzato nel browser dell'utente come un cookie e lascia che sia il browser ad inserire la password (molti browser moderni sono in grado di ricordare le password).
ja_jp: Seamのセキュリティ機能ではオンラインのWEBアプリケーションで一般的に提供されている"Remember me"(覚えておいてね）機能をサポートしています。 この機能は、二つの異なったモードをサポートしており、一つはusernameをユーザーのブラウザにクッキーとして保存し、ブラウザからpasswordの入力を促すものです（この場合でも、最近のほとんどのブラウザは、passwordを記憶しています）。

source: The second mode supports the storing of a unique token in a cookie, and allows a user to authenticate automatically upon returning to the site, without having to provide a password.
it_it: La seconda modalità gestisce la memorizzazione di un identificativo unico in un cookie e consente all'utente di autenticarsi automaticamente non appena ritorna sul sito, senza dover fornire una password.
ja_jp: 第2のモードはユニークなトークンをクッキーとして記憶しておいて、そのサイトに入ると、passwordの入力をする事なく自動的にユーザーの認証をする機能をサポートするものです。
