Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: Configuring LdapIdentityStore
it_it: Configurare LdapIdentityStore
ja_jp: LdapIdentiyStoreの設定

source: The following table describes the available properties that can be configured in <literal>components.xml</literal> for <literal>LdapIdentityStore</literal>.
it_it: La seguente tabella descrive le proprietà disponibili che possono essere configurate in <literal>components.xml</literal> per <literal>LdapIdentityStore</literal>.
ja_jp: 以下の表に<literal>components.xml</literal> で設定できる<literal>LdapIdentityStore</literal>の属性について示します。

source: LdapIdentityStore Configuration Properties
it_it: Proprietà di configurazione di LdapIdentityStore
ja_jp: LdapIdentityStore設定可能属性

source: Property
it_it: Proprietà
ja_jp: プロパティ

source: Default Value
it_it: Valore di default
ja_jp: デフォルト値

source: The address of the LDAP server.
it_it: L'indirizzo del server LDAP
ja_jp: LDAPサーバのアドレス

source: The port number that the LDAP server is listening on.
it_it: Il numero di porta su cui il server LDAP è in ascolto.
ja_jp: LDAPサーバが使用しているポートの番号

source: The Distinguished Name (DN) of the context containing user records.
it_it: Il Distinguished Name (DN) del contesto contenente le informazioni sugli utenti.
ja_jp: ユーザーレコードを含むコンテキストの識別名（DN)

source: This value is prefixed to the front of the username to locate the user's record.
it_it: Questo valore è usato come prefisso anteponendolo al nome utente durante la ricerca delle informazioni sull'utente.
ja_jp: この値がユーザーレコードの位置指定するためにusernameの前に前置されます。

source: This value is appended to the end of the username to locate the user's record.
it_it: Questo valore è aggiunto alla fine del nome utente per ricercare le informazioni sull'utente.
ja_jp: この値がユーザーレコードの位置指定するためにusernameの後ろに追加されます。

source: The DN of the context containing role records.
it_it: Il DN del contesto contenente le informazioni sui ruoli.
ja_jp: ロールレコードを含むコンテキストの識別子（DN)

source: This value is prefixed to the front of the role name to form the DN for locating the role record.
it_it: Questo valore è usato come prefisso anteponendolo al nome del ruolo per formare il DN nella ricerca delle informazioni sul ruolo.
ja_jp: この値がロール名の前に前置され、ロールレコードを位置指定するための識別子として使用されます。

source: This value is appended to the role name to form the DN for locating the role record.
it_it: Questo valore è aggiunto al nome del ruolo per formare il DN nella ricerca delle informazioni sul ruolo.
ja_jp: この値がロール名の後ろに追加され、ロールレコードを位置指定するための識別子として使用されます。

source: This is the context used to bind to the LDAP server.
it_it: Questo è il contesto usato per collegare il server LDAP.
ja_jp: LDAPサーバとバインドするために使用するコンテキスト

source: These are the credentials (the password) used to bind to the LDAP server.
it_it: Queste sono le credenziali (la password) usate per collegare il server LDAP.
ja_jp: LDAPサーバとバインドするときに使用されるクレデンシャル（パスワード）

source: This is the name of the attribute of the user record that contains the list of roles that the user is a member of.
it_it: Questo è il nome dell'attributo sulle informazioni dell'utente che contiene la lista dei ruoli di cui l'utente è membro.
ja_jp: ユーザーがメンバーであるロールのリストを含んでいるユーザーレコード中の属性の名前

source: This boolean property indicates whether the role attribute of the user record is itself a distinguished name.
it_it: Questa proprietà boolean indica se l'attributo del ruolo nelle informazioni dell'utente è esso stesso un Distinguished Name.
ja_jp: このブール値はユーザーレコード中のロール属性が識別名か否かを示しています。

source: Indicates which attribute of the user record contains the username.
it_it: Indica quale attributo delle informazioni sull'utente contiene il nome utente.
ja_jp: ユーザーレコードのどの属性がusernameに該当するのかを示しています。

source: Indicates which attribute of the user record contains the user's password.
it_it: Indica quale attributo nelle informazioni sull'utente contiene la password dell'utente.
ja_jp: ユーザーレコードのどの属性がpasswordに該当するのかを示しています。

source: Indicates which attribute of the user record contains the user's first name.
it_it: Indica quale attributo nelle informazioni sull'utente contiene il nome proprio dell'utente.
ja_jp: ユーザーレコードのどの属性がfirst nameに該当するのかを示しています。

source: Indicates which attribute of the user record contains the user's last name.
it_it: Indica quale attributo nelle informazioni sull'utente contiene il cognome dell'utente.
ja_jp: ユーザーレコードのどの属性がlast nameに該当するのかを示しています。

source: Indicates which attribute of the user record contains the user's full (common) name.
it_it: Indica quale attributo nelle informazioni sull'utente contiene il nome per esteso dell'utente.
ja_jp: ユーザーレコードのどの属性がユーザーのフルネームに該当するのかを示しています。

source: Indicates which attribute of the user record determines whether the user is enabled.
it_it: Indica quale attributo nelle informazioni sull'utente determina se l'utente è abilitato.
ja_jp: ユーザーレコードのどの属性がユーザーが不活化されていないかを示しています。

source: Indicates which attribute of the role record contains the name of the role.
it_it: Indica quale attributo nell'informazioni sul ruolo contiene il nome del ruolo.
ja_jp: ロールレコードのどの属性がロール名に該当するのかを示しています。

source: Indicates which attribute determines the class of an object in the directory.
it_it: Indica quale attributo determina la classe di un oggetto nella directory.
ja_jp: ディレクトリ中でオブジェクトのクラスを決定している属性を示しています。

source: An array of the object classes that new role records should be created as.
it_it: Un elenco di classi di oggetto con cui devono essere create le informazioni su un nuovo ruolo.
ja_jp: 新規のロールレコードの作成のためのオブジェクトクラスの配列

source: An array of the object classes that new user records should be created as.
it_it: Un elenco di classi di oggetto con cui devono essere create le informazioni su un nuovo utente.
ja_jp: 新規のユーザーレコード作成のためのオブジェクトクラスの配列

source: LdapIdentityStore Configuration Example
it_it: Esempio di configurazione di LdapIdentityStore
ja_jp: LdapIdentityStore設定例

source: The following configuration example shows how <literal>LdapIdentityStore</literal> may be configured for an LDAP directory running on fictional host <literal>directory.mycompany.com</literal>. The users are stored within this directory under the context <literal>ou=Person,dc=mycompany,dc=com</literal>, and are identified using the <literal>uid</literal> attribute (which corresponds to their username). Roles are stored in their own context, <literal>ou=Roles,dc=mycompany,dc=com</literal> and referenced from the user's entry via the <literal>roles</literal> attribute. Role entries are identified by their common name (the <literal>cn</literal> attribute) , which corresponds to the role name. In this example, users may be disabled by setting the value of their <literal>enabled</literal> attribute to false.
it_it: La seguente configurazione di esempio mostra come <literal>LdapIdentityStore</literal> può essere configurato per una directory LDAP sul sistema immaginario <literal>directory.mycompany.com</literal>. Gli utenti sono memorizzati all'interno di questa directory sotto il contesto <literal>ou=Person,dc=mycompany,dc=com</literal> e sono identificati usando l'attributo <literal>uid</literal> (che corrisponde al loro nome utente). I ruoli sono memorizzati nel loro contesto, <literal>ou=Roles,dc=mycompany,dc=com</literal> e referenziati dalla voce dell'utente tramite l'attributo <literal>roles</literal>. Le voci dei ruoli sono identificate tramite il loro common name (l'attributo <literal>cn</literal>), che corrisponde al nome del ruolo. In questo esempio gli utenti possono essere disabilitati impostando il valoro del loro attributo <literal>enabled</literal> a false.
ja_jp: 下の設定例では、擬似ホスト <literal>directory.mycompany.com</literal>上で動作しているLDAPディレクトリに対応する<literal>LdapIdentityStore</literal> の設定を示しています。 ユーザーは、このディレクトリ配下に<literal>ou=Person,dc=mycompany,dc=com</literal>というコンテキストで保持され、usernameに対応する<literal>uid</literal>属性により識別されます。 ロールはロール用のコンテキスト<literal>ou=Roles,dc=mycompany,dc=com</literal>に保持され、ユーザーのエントリから<literal>roles</literal>属性を通じて参照されます。 ロールのエントリはロールの名前に対応するロールの一般名（<literal>cn</literal> 属性）により識別されます。 この例では、ユーザーは<literal>enabled</literal>属性をfalseにする事により、使用不可にする事ができます。

source: Writing your own IdentityStore
it_it: Scrivere il proprio IdentityStore
ja_jp: 自分のIDストアを記述する

source: Writing your own identity store implementation allows you to authenticate and perform identity management operations against security providers that aren't supported out of the box by Seam. Only a single class is required to achieve this, and it must implement the <literal>org.jboss.seam.security.management.IdentityStore</literal> interface.
it_it: Scrivere la propria implementazione della memorizzazione delle identità consente di autenticare ed eseguire le operazioni di gestione delle identità su fornitori di sicurezza che non sono gestiti da Seam così com'è. Per ottenere ciò è richiesta una sola classe ed essa deve implementare l'interfaccia <literal>org.jboss.seam.security.management.IdentityStore</literal>.
ja_jp: Seamによって標準でサポートされていないセキュリティプロバイダを使った認証やID管理を行う場合には、<literal>org.jboss.seam.security.management.IdentityStore</literal>を実装する、一つのクラスの実装を記述するだけ実現できます。

source: Please refer to the JavaDoc for <literal>IdentityStore</literal> for a description of the methods that must be implemented.
it_it: Fare riferimento al JavaDoc di <literal>IdentityStore</literal> per una descrizione dei metodi che devono essere implementati.
ja_jp: <literal>IdentityStore</literal>の実装するメソッドの詳細については該当するJavaDocを参照してください。

source: Authentication with Identity Management
it_it: L'autenticazione con la gestione delle identità
ja_jp: ID管理による認証

source: If you are using the Identity Management features in your Seam application, then it is not required to provide an authenticator component (see previous Authentication section) to enable authentication. Simply omit the <literal>authenticator-method</literal> from the <literal>identity</literal> configuration in <literal>components.xml</literal>, and the <literal>SeamLoginModule</literal> will by default use <literal>IdentityManager</literal> to authenticate your application's users, without any special configuration required.
it_it: Se in un'applicazione Seam si stanno usando le funzioni di gestione delle identità, allora non è richiesto di fornire un componente <literal>authenticator</literal> (vedi il precedente paragrafo Autenticazione) per abilitare l'autenticazione. Basta omettere <literal>authenticator-method</literal> dalla configurazione di <literal>identity</literal> in <literal>components.xml</literal> e il <literal>SeamLoginModule</literal> userà per default <literal>IdentityManger</literal> per autenticare gli utenti dell'applicazione, senza nessuna configurazione speciale.
ja_jp: SeamアプリケーションでID管理機能を使っている場合には、認証コンポーネント（認証の項参照）による認証を行う必要はありません。<literal>components.xml</literal>の<literal>identity</literal>設定から<literal>authenticator-method</literal>を削除してください。 これで、特別な設定をすることなく<literal>SeamLoginModule</literal> はデフォルトの<literal>IdentityManager</literal>を使用してユーザーの認証を行うようになります。

source: Using IdentityManager
it_it: Usare IdentityManager
ja_jp: IDマネージャの使用

source: The <literal>IdentityManager</literal> can be accessed either by injecting it into your Seam component as follows:
it_it: <literal>IdentityManager</literal> può essere utilizzato sia iniettandolo in un componente Seam come di seguito:
ja_jp: <literal>IdentityManager</literal>にアクセスできるようにするには、下のようにSeamコンポーネントにインジェクトします。

source: or by accessing it through its static <literal>instance()</literal> method:
it_it: sia accedendo ad esso tramite il suo metodo statico <literal>instance()</literal>:
ja_jp: あるいは、静的な<literal>instance()</literal>メソッド経由でアクセスします。

source: The following table describes <literal>IdentityManager</literal>'s API methods:
it_it: La seguente tabella descrive i metodi di API per <literal>IdentityManager</literal>:
ja_jp: 下のテーブルに<literal>IdentityManager</literal>のAPIのメソッドを示します。

source: Identity Management API
it_it: API per la gestione delle identità
ja_jp: ID管理のAPI

source: Method
it_it: Metodo
ja_jp: メソッド

source: Returns
it_it: Valore restituito
ja_jp: 戻り値

source: Creates a new user account, with the specified name and password. Returns <literal>true</literal> if successful, or <literal>false</literal> if not.
it_it: Crea un nuovo utente con il nome e la password specificate. Restituisce <literal>true</literal> se l'operazione si è conclusa con successo, altrimenti <literal>false</literal>.
ja_jp: 指定されたusernameとpasswordで新規ユーザーのアカウントを作成します。 もし作成が成功すれば<literal>true</literal>を、さもなくば<literal>false</literal>を返します。

source: Deletes the user account with the specified name. Returns <literal>true</literal> if successful, or <literal>false</literal> if not.
it_it: Elimina le informazioni dell'utente con il nome specificato. Restituisce <literal>true</literal> se l'operazione si è conclusa con successo, oppure <literal>false</literal>.
ja_jp: 指定された名前のユーザーを削除します。 もし成功すれば<literal>true</literal>を、さもなくば<literal>false</literal>を返します。

source: Creates a new role, with the specified name. Returns <literal>true</literal> if successful, or <literal>false</literal> if not.
it_it: Crea un nuovo ruolo con il nome specificato. Restituisce <literal>true</literal> se l'operazione si è conclusa con successo, oppure <literal>false</literal>.
ja_jp: 指定された名前で新規のロールを作成します。 もし作成が成功すれば<literal>true</literal>を、さもなくば<literal>false</literal>を返します。

source: Deletes the role with the specified name. Returns <literal>true</literal> if successful, or <literal>false</literal> if not.
it_it: Elimina il ruolo con il nome specificato. Restituisce <literal>true</literal> se l'operazione si è conclusa con successo, oppure <literal>false</literal>.
ja_jp: 指定された名前のロールを削除します。 もし作成が成功すれば<literal>true</literal>を、さもなくば<literal>false</literal>を返します。

source: Enables the user account with the specified name. Accounts that are not enabled are not able to authenticate. Returns <literal>true</literal> if successful, or <literal>false</literal> if not.
it_it: Abilita l'utente con il nome specificato. Gli utenti che non sono abilitati non sono in grado di autenticarsi. Restituisce <literal>true</literal> se l'operazione si è conclusa con successo, oppure <literal>false</literal>.
ja_jp: 指定された名前のユーザーアカウントを活性化します。 活性化されていないアカウントは認証の対象とはなりません。もし成功すれば<literal>true</literal>を、さもなくば<literal>false</literal>を返します

source: Disables the user account with the specified name. Returns <literal>true</literal> if successful, or <literal>false</literal> if not.
it_it: Disabilita l'utente con il nome specificato. Restituisce <literal>true</literal> se l'operazione si è conclusa con successo, oppure <literal>false</literal>.
ja_jp: 指定された名前のユーザーアカウントを不活化します。 もし成功すれば<literal>true</literal>を、さもなくば<literal>false</literal>を返します。

source: Changes the password for the user account with the specified name. Returns <literal>true</literal> if successful, or <literal>false</literal> if not.
it_it: Modifica la password dell'utente con il nome specificato. Restituisce <literal>true</literal> se l'operazione si è conclusa con successo, oppure <literal>false</literal>.
ja_jp: 指定された名前のユーザーアカウントのpasswordの変更をします。 もし成功すれば<literal>true</literal>を、さもなくば<literal>false</literal>を返します。

source: Returns <literal>true</literal> if the specified user account is enabled, or <literal>false</literal> if it isn't.
it_it: Restituisce <literal>true</literal> se l'utente specificato è abilitato, oppure <literal>false</literal> se non lo è.
ja_jp: もし、指定されたユーザーのアカウントが活性化されていれば <literal>true</literal>を、さもなくば<literal>false</literal>を返します。

source: Grants the specified role to the specified user or role. The role must already exist for it to be granted. Returns <literal>true</literal> if the role is successfully granted, or <literal>false</literal> if it is already granted to the user.
it_it: Concede il ruolo specificato all'utente o al ruolo. Il ruolo deve già esistere per essere concesso. Restituisce <literal>true</literal> se il ruolo è stato concesso, oppure <literal>false</literal> se era già stato concesso all'utente.
ja_jp: 特定のロールをユーザーやロールに権限を付与します。 ロールは既に存在していることが必要です。 ロールの付与が成功した場合には<literal>true</literal>を返し、もしそのロールがユーザーに既に付与されていた場合には<literal>false</literal>を返します。

source: Revokes the specified role from the specified user or role. Returns <literal>true</literal> if the specified user is a member of the role and it is successfully revoked, or <literal>false</literal> if the user is not a member of the role.
it_it: Revoca il ruolo specificato all'utente o al ruolo. Restituisce <literal>true</literal> se l'utente specificato era membro del ruolo e questo è stato revocato con successo, oppure <literal>false</literal> se l'utente non è un membro del ruolo.
ja_jp: 特定のユーザーあるいはロールから指定したロールを取り消します。 ユーザーが当該のロールのメンバーであり、かつ取り消しが成功した場合には<literal>true</literal>を返し、ユーザーが当該ロールのメンバーでなければ<literal>false</literal>を返します。

source: Returns <literal>true</literal> if the specified user exists, or <literal>false</literal> if it doesn't.
it_it: Restituisce <literal>true</literal> se l'utente specificato esiste, oppure <literal>false</literal> se non esiste.
ja_jp: もし、当該のユーザーが存在すれば<literal>true</literal>、さもなくば<literal>false</literal>を返します。

source: List
it_it: listUsers(String filter)
ja_jp: リスト

source: Returns a list of all user names, sorted in alpha-numeric order.
it_it: Restituisce una lista di tutti i nomi utente in ordine alfanumerico.
ja_jp: ABC順にソートされたすべてのユーザー名の一覧を返します。

source: Returns a list of all user names filtered by the specified filter parameter, sorted in alpha-numeric order.
it_it: Restituisce una lista di tutti i nomi utente filtrata secondo il parametro di filtro specificato e in ordine alfanumerico.
ja_jp: 指定されたパラメータでフィルタしたユーザー名のリストをABC順にソートして返します

source: Returns a list of all role names.
it_it: Restituisce una lista di tutti i nomi dei ruoli.
ja_jp: すべてのロール名の一覧を返します

source: Returns a list of the names of all the roles explicitly granted to the specified user name.
it_it: Restituisce una lista dei nomi di tutti i ruoli esplicitamente concessi all'utente con il nome specificato.
ja_jp: 指定されたユーザーに明示的に認められたロール名の一覧を返します

source: Returns a list of the names of all the roles implicitly granted to the specified user name. Implicitly granted roles include those that are not directly granted to a user, rather they are granted to the roles that the user is a member of. For example, is the <literal>admin</literal> role is a member of the <literal>user</literal> role, and a user is a member of the <literal>admin</literal> role, then the implied roles for the user are both the <literal>admin</literal>, and <literal>user</literal> roles.
it_it: Restituisce la lista dei nomi di tutti i ruoli implicitamente concessi all'utente specificato. I ruoli implicitamente concessi includono quelli che non sono concessi direttamente all'utente, ma sono concessi ai ruoli di cui l'utente è membro. Ad esempio, se il ruolo <literal>admin</literal> è un membro del ruolo <literal>user</literal> e un utente è membro del ruolo <literal>admin</literal>, allora i ruoli impliciti per l'utente sono sia <literal>admin</literal> che <literal>user</literal>.
ja_jp: 指定されたユーザー名に対して暗示的に付与されているすべてのロール名のリストを返します。 暗示的に付与されているロールとは、ユーザーに直接付与されているロールではなく、ユーザーが所属するロールに対して付与されているロールを言います。 例えば、<literal>admin</literal>ロールは<literal>user</literal>ロールのメンバーであり、ユーザーが<literal>admin</literal>ロールのメンバーであれば、このユーザーには暗示的に<literal>admin</literal>ロールと <literal>user</literal>ロールが付与されている。

source: Authenticates the specified username and password using the configured Identity Store. Returns <literal>true</literal> if successful or <literal>false</literal> if authentication failed. Successful authentication implies nothing beyond the return value of the method. It does not change the state of the <literal>Identity</literal> component - to perform a proper Seam login the <literal>Identity.login()</literal> must be used instead.
it_it: Autenticazione il nome utente e la password specificati usando l'Identity Store configurato. Restituisce <literal>true</literal> se conclude con successo, oppure <literal>false</literal> se l'autenticazione fallisce. Il successo dell'autenticazione non implica niente oltre al valore restituito dal metodo. Non cambia lo stato del componente <literal>Identity</literal>. Per eseguire un vero e proprio login deve essere invece usato il metodo <literal>Identity.login()</literal>.
ja_jp: 設定されたIDストアを使ってusernameとpasswordを認証します。 認証が成功すれば<literal>true</literal>、失敗すれば<literal>false</literal>を返します。 認証が成功しても、このメソッドの戻り値以外は何も変化しませんし、<literal>Identity</literal>コンポーネントの状態も変化しません。 loginを適切に行うためには<literal>Identity.login()</literal>が使用されなければなりません。

source: Adds the specified role as a member of the specified group. Returns true if the operation is successful.
it_it: Aggiunge il ruolo specificato come membro del gruppo specificato. Restituisce <literal>true</literal> se l'operazione va a buon fine.
ja_jp: 特定のロールを指定したグループのメンバーに追加します。 操作が成功した場合にtrueを返します。

source: Removes the specified role from the specified group. Returns true if the operation is successful.
it_it: Rimuove il ruolo specificato dal gruppo specificato. Restituisce <literal>true</literal> se l'operazione va a buon fine.
ja_jp: 指定されたロールを指定されたグループから削除します。 もし成功すればtrueを返します。

source: Lists the names of all roles.
it_it: Elenca i nomi di tutti i ruoli.
ja_jp: すべてのロール名のリスト

source: Using the Identity Management API requires that the calling user has the appropriate authorization to invoke its methods. The following table describes the permission requirements for each of the methods in <literal>IdentityManager</literal>. The permission targets listed below are literal String values.
it_it: L'uso delle API per la gestione delle identità richiede che l'utente chiamante abbia le autorizzazioni appropriate per invocare i suoi metodi. La seguente tabella descrive i permessi richiesti per ciascuno dei metodi in <literal>IdentityManager</literal>. Gli oggetti dei permessi elencati qui sotto sono valori stringa.
ja_jp: ID管理APIを使うためには、ユーザーはそのメソッドを呼び出す適切な権限を持っている必要があります。 以下の表に<literal>IdentityManager</literal>にある個々のメソッドの起動に必要な権限の一覧を示します。 権限はリテラル文字列で指定します。

source: Identity Management Security Permissions
it_it: Permessi di sicurezza nella gestione delle identità
ja_jp: ID管理 セキュリティパーミッション

source: Permission Target
it_it: Oggetto del permesso
ja_jp: パーミッションの対象

source: Permission Action
it_it: Azione del permesso
ja_jp: パーミッションのアクション

source: The following code listing provides an example set of security rules that grants access to all Identity Management-related methods to members of the <literal>admin</literal> role:
it_it: Il seguente listato fornisce un esempio con un insieme di regole di sicurezza che concedono al ruolo <literal>admin</literal> l'accesso a tutti i metodi relativi alla gestione delle identità:
ja_jp: 下の例では、<literal>admin</literal>ロールのメンバーすべてが、すべてのID管理関連のメソッドへのアクセス権を付与されているセキュリティルールを示しています。

source: Error Messages
it_it: Messaggi di errore
ja_jp: エラーメッセージ

source: The security API produces a number of default faces messages for various security-related events. The following table lists the message keys that can be used to override these messages by specifying them in a <literal>message.properties</literal> resource file. To suppress the message, just put the key with an empty value in the resource file.
it_it: Le API di sicurezza producono una serie di messaggi di default per i diversi eventi relaivi alla sicurezza. La seguente tabella elenca le chiavi dei messaggi che possono essere usate per sovrascrivere questi messaggi specificandoli in un file <literal>message.properties</literal>. Per sopprimere un messaggio basta mettere nel file la chiave con un valore vuoto.
ja_jp: セキュリティAPIはセキュリティ関連イベントに対応するいくつかのデフォルトのフェースメッセージを発生します。 以下の表には、リソースファイル<literal>message.properties</literal>で、これらを上書きするためのメッセージキーを一覧にしています。 もし、これらのメッセージを出さないようにするのであれば、リソースファイルで対応するキーの値をブランクにしてください。

source: Security Message Keys
it_it: Chiavi dei messaggi di sicurezza
ja_jp: セキュリティメッセージキー

source: Message Key
it_it: Chiave del messaggio
ja_jp: メッセージキー
