Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: Automatic client authentication with a persistent cookie stored on the client machine is dangerous. While convenient for users, any cross-site scripting security hole in your website would have dramatically more serious effects than usual. Without the authentication cookie, the only cookie to steal for an attacker with XSS is the cookie of the current session of a user. This means the attack only works when the user has an open session - which should be a short timespan. However, it is much more attractive and dangerous if an attacker has the possibility to steal a persistent Remember Me cookie that allows him to login without authentication, at any time. Note that this all depends on how well you protect your website against XSS attacks - it's up to you to make sure that your website is 100% XSS safe - a non-trival achievement for any website that allows user input to be rendered on a page.
it_it: L'autenticazione automatica tramite un cookie persistente memorizzato sulla macchina client è pericolosa. Benché sia conveniente per gli utenti, qualsiasi debolezza nella sicurezza che consenta un cross-site scripting nel sito avrebbe effetti drammaticamente più gravi del solito. Senza il cookie di autenticazione, il solo cookie che un malintenzionato può prelevare tramite un attacco XSS è il cookie della sessione corrente dell'utente. Ciò significa che l'attacco funziona solo quando l'utente ha una sessione aperta, ovvero per un intervallo di tempo limitato. Al contrario è molto più allettante e pericoloso se un malintenzionato ha la possibilità di prelevare il cookie relativo alla funzione "Ricordami su questo computer", il quale gli consentirebbe di accedere senza autenticazione ogni volta che vuole. Notare che questo dipende anche da quanto è efficace la protezione del sito dagli attacchi XSS. Sta a chi scrive l'applicazione fare in modo che il sito sia sicuro al 100% dagli attacchi XSS, un obiettivo non banale per qualsiasi sito che consente di rappresentare sulle pagine un contenuto scritto dagli utenti.
ja_jp: クライアント側の永続的なクッキーによる自動的な認証（第2のモード）は危険で、ユーザーへの利便性は向上しますが、クロスサイトスクリプティングに対するセキュリティホールの影響を通常より遥かに重大な物としてしまいます。 認証のためのクッキーでなければ、XSSにより攻撃者に盗まれるクッキーは、現在のセッションのユーザーのクッキーという事になります。 これは、ユーザーがセッションを開いていなければ攻撃が有効でないことを意味し、攻撃可能な時間が非常に短い事を意味します。 攻撃者が自動認証をサポートする永続的なRemember meクッキーを盗む可能性があるとすれば、それはたいへん危険なことです。 この機能の利用の危険性は、システムがXSS攻撃に対してどれだけ防御できているのかに依存し、XSS攻撃に対して100％の防御を保証している必要がありますが、入力内容をWEBページに表示するようなサイトにとって、これは簡単ではありません。

source: Browser vendors recognized this issue and introduced a "Remember Passwords" feature - today almost all browsers support this. Here, the browser remembers the login username and password for a particular website and domain, and fills out the login form automatically when you don't have an active session with the website. If you as a website designer then offer a convenient login keyboard shortcut, this approach is almost as convenient as a "Remember Me" cookie and much safer. Some browsers (e.g. Safari on OS X) even store the login form data in the encrypted global operation system keychain. Or, in a networked environment, the keychain can be transported with the user (between laptop and desktop for example), while browser cookies are usually not synchronized.
it_it: I produttori di browser hanno riconosciuto questo problema e hanno introdotto la funzione "Ricorda la password", oggi disponibile su quasi tutti i browser. In questo caso il browser ricorda il nome utente e la password per un certo sito e dominio, e riempie la form di accesso automaticamente quando non è attiva una sessione con il sito. Se poi il progettista del sito offre una scorciatoia da tastiera conveniente, questo approccio è quasi altrettanto immediato come il cookie "Ricordami su questo computer", ma molto più sicuro. Alcuni browser (ad esempio Safari su OS X) memorizzano addirittura i dati delle form di accesso nel portachiavi cifrato di sistema. Oppure, in un ambiente di rete, il portachiavi può essere trasportato dall'utente (tra il portatile e il desktop, ad esempio), mentre i cookie del browser di solito non sono sincronizzati.
ja_jp: ブラウザのベンダーはこの問題を認識しており、最近のブラウザでは新たに導入されたRemember Passwordをサポートしています。 この場合は、ブラウザは特定のドメイン、ウェブサイトに対してのusernameとpasswordを記憶しており、ウェブサイトとのセッションがアクティブでない状態で、ログインフォームのusernameとpasswordを自動的に埋めてゆきます。 ウェブデザイナの立場であれば、ログインのためのショートカットキーを設定しておけば、Remember Meと同様にユーザーの利便性を向上させることができます。 OS-xのSafariなど一部のブラウザでは、OSのキーチェインに暗号化したログインのフォームを記憶させています。 また、ブラウザのクッキーは一般に同期化させることはできませんが、ネットワーク環境ではこのキーチェインはラップトップからデスクトップへと移動させることができます。

source: To summarize: While everyone is doing it, persistent "Remember Me" cookies with automatic authentication are a bad practice and should not be used. Cookies that "remember" only the users login name, and fill out the login form with that username as a convenience, are not an issue.
it_it: In definitiva: benché tutti lo stiano facendo, il cookie "Ricordami su questo computer" con l'autenticazione automatica è un cattiva pratica e non dovrebbe essere usata. I cookie che "ricordano" solo il nome dell'utente e riempiono la form di accesso con quel nome utente per praticità, non comportano rischi.
ja_jp: まとめ：自動認証をする永続的なRemember Meの使用は一般化してしまっていますが、セキュリティ上、不適切であり使用すべきではありません。 ログイン時のusernameのみを記憶するクッキーを使用することには問題はありません。

source: To enable the remember me feature for the default (safe, username only) mode, no special configuration is required. In your login form, simply bind the remember me checkbox to <literal>rememberMe.enabled</literal>, like in the following example:
it_it: Per abilitare la funzione "Ricordami su questo computer" nella modalità di default (quella sicura, con il solo nome utente) non è richiesta alcuna speciale configurazione. Basta collegare un checkbox "Ricordami su questo computer" a <literal>rememberMe.enabled</literal> nella form di accesso, come nel seguente esempio:
ja_jp: デフォルトのRemember me(usernameのみ）機能を使用するためには、特に設定は必要ありません。 下の例のように、ログインフォームにremember meチェックボックスを入れて、これを<literal>rememberMe.enabled</literal>とバインドするだけです。

source: <![CDATA[ <div> <h:outputLabel for="name" value="User name"/> <h:inputText id="name" value="#{credentials.username}"/> </div> <div> <h:outputLabel for="password" value="Password"/> <h:inputSecret id="password" value="#{credentials.password}" redisplay="true"/> </div> <div class="loginRow"> <h:outputLabel for="rememberMe" value="Remember me"/> <h:selectBooleanCheckbox id="rememberMe" value="#{rememberMe.enabled}"/> </div>]]>
it_it: <![CDATA[ <div> <h:outputLabel for="name" value="Nome utente"/> <h:inputText id="name" value="#{credentials.username}"/> </div> <div> <h:outputLabel for="password" value="Password"/> <h:inputSecret id="password" value="#{credentials.password}" redisplay="true"/> </div> <div class="loginRow"> <h:outputLabel for="rememberMe" value="Ricordami su questo computer"/> <h:selectBooleanCheckbox id="rememberMe" value="#{rememberMe.enabled}"/> </div>]]>

source: Token-based Remember-me Authentication
it_it: La modalità di autenticazione "Ricordami su questo computer" basata sul token
ja_jp: トークンベースのremember me認証

source: To use the automatic, token-based mode of the remember me feature, you must first configure a token store. The most common scenario is to store these authentication tokens within a database (which Seam supports), however it is possible to implement your own token store by implementing the <literal>org.jboss.seam.security.TokenStore</literal> interface. This section will assume you will be using the provided <literal>JpaTokenStore</literal> implementation to store authentication tokens inside a database table.
it_it: Per usare la modalità automatica, attraverso il token, della funzione "Ricordami su questo computer", occorre prima configurare la memorizzazione del token. Nello scenario più comune (gestito da Seam) questi token di autenticazione vengono memorizzati nel database, comunque è possibile implementare la propria memorizzazione dei token implementando l'interfaccia <literal>org.jboss.seam.security.TokenStore</literal>. In questo paragrafo si suppone che per la memorizzazione dei token in una tabella del database si stia usando l'implementazione fornita con Seam <literal>JpaTokenStore</literal>.
ja_jp: トークンベースの自動認証機能の remember me を使用するためには、まずトークンの記憶場所を設定する必要があります。 Seamでもサポートしていますが、このトークンの記憶場所としてはデータベースが一般的です。 しかし、<literal>org.jboss.seam.security.TokenStore</literal> インタフェースを実装して独自の記憶場所を設定することも可能です。 この章では標準で提供されている<literal>JpaTokenStore</literal>実装を使用して認証トークンをデータベーステーブルに記憶させることを前提としています。

source: The first step is to create a new Entity which will contain the tokens. The following example shows a possible structure that you may use:
it_it: Il primo passo consiste nel creare una nuova entità che conterrà i token. Il seguente esempio mostra una possibile struttura che può essere usata:
ja_jp: まず最初に、トークンを保持する新たなエンティティを作ります。 以下に、一般的なエンティティの構造を示します。

source: As you can see from this listing, a couple of special annotations, <literal>@TokenUsername</literal> and <literal>@TokenValue</literal> are used to configure the username and token properties of the entity. These annotations are required for the entity that will contain the authentication tokens.
it_it: Come si può vedere dal listato, vengono usate un paio di annotazioni speciali, <literal>@TokenUsername</literal> e <literal>@TokenValue</literal>, per configurare le proprietà token e nome utente dell'entità. Queste annotazioni sono richieste per l'entità che conterrà i token di autenticazione.
ja_jp: このコードから分かるように、エンティティのusernameとトークンのプロパティには<literal>@TokenUsername</literal> と<literal>@TokenValue</literal>という特別なアノテーションが使われており、これらは認証トークンを含むエンティティに必須です。

source: The next step is to configure <literal>JpaTokenStore</literal> to use this entity bean to store and retrieve authentication tokens. This is done in <literal>components.xml</literal> by specifying the <literal>token-class</literal> attribute:
it_it: Il passo successivo consiste nel configurare il <literal>JpaTokenStore</literal> per usare questo entity bean per memorizzare e recuperare i token di autenticazione. Ciò viene fatto in <literal>components.xml</literal> specificando l'attributo <literal>token-class</literal>.
ja_jp: 次に、このエンティティBeanに対して認証トークンの出し入れをするために、 <literal>JpaTokenStore</literal>を設定します。 これは、 <literal>components.xml</literal> に<literal>token-class</literal>属性を指定することにより行います。

source: Once this is done, the last thing to do is to configure the <literal>RememberMe</literal> component in <literal>components.xml</literal> also. Its <literal>mode</literal> should be set to <literal>autoLogin</literal>:
it_it: Una volta fatto questo, l'ultima cosa da fare è configurare anche il componente <literal>RememberMe</literal> in <literal>components.xml</literal>. La sua proprietà <literal>mode</literal> dovrà essere impostata a <literal>autoLogin</literal>:
ja_jp: ここまでが終了したら、最後は<literal>components.xml</literal> に<literal>RememberMe</literal>コンポーネントの設定をする事です。 <literal>mode</literal>は<literal>autoLogin</literal>に設定されていなければなりません。

source: That is all that is required - automatic authentication will now occur for users revisiting your site (as long as they check the "remember me" checkbox).
it_it: Questo è tutto ciò che è necessario. L'autenticazione automatica degli utenti avverrà quando torneranno a visitare il sito (purché abbiano impostato il checkbox "Ricordami su questo computer").
ja_jp: これで、remember meをチェックしているユーザーがサイトを再訪した時に、自動的に認証されるようになります。

source: To ensure that users are automatically authenticated when returning to the site, the following section should be placed in components.xml:
it_it: Per essere sicuri che gli utenti siano autenticati automaticamente quando tornano sul sito, il seguente codice deve essere posizionato in <literal>components.xml</literal>:
ja_jp: ユーザーがサイトを再訪した時に確実に自動的に認証される様にするために、<literal>components.xml</literal>に以下が含まれている必要があります。

source: Handling Security Exceptions
it_it: Gestire le eccezioni della sicurezza
ja_jp: セキュリティ例外の処理

source: To prevent users from receiving the default error page in response to a security error, it's recommended that <literal>pages.xml</literal> is configured to redirect security errors to a more "pretty" page. The two main types of exceptions thrown by the security API are:
it_it: Per prevenire il fatto che gli utenti ricevano la pagina di errore di default in risposta ad un errore di sicurezza, si raccomanda che in <literal>pages.xml</literal> sia configurata una redirezione degli errori di sicurezza ad una pagina più "carina". I due principali tipi di eccezione lanciati dalle API della sicurezza sono:
ja_jp: セキュリティエラーでユーザーがデフォルトのエラーページを受け取らないようにするために、<literal>pages.xml</literal>にセキュリティエラーに対応した、もう少し見栄えのするページにリダイレクトするよう設定する事が推奨されます。 セキュリティAPIの発生させる例外には主として二つのタイプがあります。

source: <literal>NotLoggedInException</literal> - This exception is thrown if the user attempts to access a restricted action or page when they are not logged in.
it_it: <literal>NotLoggedInException</literal> - Questa eccezione viene lanciata se l'utente tenta di accedere ad un'azione o ad una pagina protetta quando non ha fatto l'accesso.
ja_jp: <literal>NotLoggedInException</literal> - ユーザーがログインすることなく、特定のページ閲覧、或は特定の操作を実行しようとしたときに投げられます。

source: <literal>AuthorizationException</literal> - This exception is only thrown if the user is already logged in, and they have attempted to access a restricted action or page for which they do not have the necessary privileges.
it_it: <literal>AuthorizationException</literal> - Questa eccezione viene lanciata solo se l'utente ha già fatto l'accesso e ha tentato di accedere ad un'azione o ad una pagina per la quale non ha i privilegi necessari.
ja_jp: <literal>AuthorizationException</literal> - ユーザーが既にログインしていて、当該ユーザーが許可されていないページの閲覧、或は操作を行おうとしたときに投げられます。

source: In the case of a <literal>NotLoggedInException</literal>, it is recommended that the user is redirected to either a login or registration page so that they can log in. For an <literal>AuthorizationException</literal>, it may be useful to redirect the user to an error page. Here's an example of a <literal>pages.xml</literal> file that redirects both of these security exceptions:
it_it: Nel caso della <literal>NotLoggedInException</literal>, si raccomanda che l'utente venga rediretto o sulla pagina di accesso o su quella di registrazione, così che possa accedere. Per una <literal>AuthorizationException</literal>, può essere utile redirigere l'utente su una pagina di errore. Ecco un esempio di un <literal>pages.xml</literal> che redirige entrambe queste eccezioni:
ja_jp: <literal>NotLoggedInException</literal>の場合、ユーザーがログインできるよう、ユーザーをログインページかユーザー登録ページへ誘導する事が推奨されます。 一方、<literal>AuthorizationException</literal>の場合にはユーザーをエラーページに誘導した方が良いでしょう。 以下の例では、この二つのセキュリティ例外によるリダイレクトを処理している<literal>pages.xml</literal>を示しています。

source: <![CDATA[<pages> ... <exception class="org.jboss.seam.security.NotLoggedInException"> <redirect view-id="/login.xhtml"> <message>You must be logged in to perform this action</message> </redirect> </exception> <exception class="org.jboss.seam.security.AuthorizationException"> <end-conversation/> <redirect view-id="/security_error.xhtml"> <message>You do not have the necessary security privileges to perform this action.</message> </redirect> </exception> </pages>]]>
it_it: <![CDATA[<pages> ... <exception class="org.jboss.seam.security.NotLoggedInException"> <redirect view-id="/login.xhtml"> <message>Per eseguire questa operazione devi prima eseguire l'accesso</message> </redirect> </exception> <exception class="org.jboss.seam.security.AuthorizationException"> <end-conversation/> <redirect view-id="/security_error.xhtml"> <message>Non disponi dei privilegi di sicurezza necessari per eseguire questa operazione.</message> </redirect> </exception> </pages>]]>

source: Most web applications require even more sophisticated handling of login redirection, so Seam includes some special functionality for handling this problem.
it_it: La maggior parte delle applicazioni web richiede una gestione più sofisticata della redirezione sulla pagina di accesso, perciò Seam include alcune funzionalità speciali per gestire questo problema:
ja_jp: ほとんどのwebアプリケーションでは、より洗練されたログインリダイレクトを必要としますが、Seamではこの様なケースに対応できるような機能も持たせています。

source: Login Redirection
it_it: Redirezione alla pagina di accesso
ja_jp: ログインリダイレクト

source: You can ask Seam to redirect the user to a login screen when an unauthenticated user tries to access a particular view (or wildcarded view id) as follows:
it_it: E' possibile chiedere a Seam di redirigere l'utente su una pagina di accesso quando un utente non autenticato tenta di accedere ad una particolare view (o ad una view il cui id corrisponda ad una wildcard), nel modo seguente:
ja_jp: 認証されていないユーザーが特定のビュー（或はワイルドカードで指定された複数のビュー）の閲覧をしようとした時に、Seamがユーザーをログイン画面にリダイレクトするようにするためには (<literal>pages.xml</literal>に) 下のように記述します。

source: This is less of a blunt instrument than the exception handler shown above, but should probably be used in conjunction with it.
it_it: Non è che una banale semplificazione rispetto alla gestione dell'eccezione illustrata prima, ma probabilmente dovrà essere usata insieme ad essa.
ja_jp: これは、前項までの例外処理に比べて少々ぶっきらぼうさを抑えた処理ですが、例外処理によるリダイレクトと組み合わせて使用すると良いでしょう

source: After the user logs in, we want to automatically send them back where they came from, so they can retry the action that required logging in. If you add the following event listeners to <literal>components.xml</literal>, attempts to access a restricted view while not logged in will be remembered, so that upon the user successfully logging in they will be redirected to the originally requested view, with any page parameters that existed in the original request.
it_it: Dopo che l'utente ha eseguito l'accesso, lo si vorrà rimandare automaticamente indietro da dove è venuto, così che potrà riprovare ad eseguire l'azione che richiedeva l'accesso. Se si aggiungono i seguenti listener in <literal>components.xml</literal>, i tentativi di accesso ad una view protetta eseguiti quando non si è fatto l'accesso verranno ricordati così, dopo che l'utente ha eseguito l'accesso, può essere rediretto alla view che aveva originariamente richiesto, compresi tutti i parametri di pagina che esistevano nella richiesta originale.
ja_jp: ユーザーがログインした後で、再度ログインし直したい場合に自動的に最初のページ（ユーザーが入ってきたページ）に戻したいような状況を考えてみましょう。 下の様にイベントリスナーを<literal>components.xml</literal>に記述すると、ログインせずに制限されたページの閲覧をした（閲覧に失敗した）ことを記憶させておいて、ユーザーが再ログインして成功したときに、当初の要求時のページパラメータをもと当該ページにリダイレクトさせることができます。

source: Note that login redirection is implemented as a conversation-scoped mechanism, so don't end the conversation in your <literal>authenticate()</literal> method.
it_it: Notare che la redirezione dopo l'accesso è implementata con un meccanismo con visibilità sulla conversazione, perciò occorre evitare di terminare la conversazione nel metodo <literal>authenticate()</literal>.
ja_jp: ログインリダイレクトは対話スコープで実装されていますので、<literal>authenticate()</literal>の中で対話を終了させてはいけません。

source: HTTP Authentication
it_it: Autenticazione HTTP
ja_jp: HTTP認証

source: Although not recommended for use unless absolutely necessary, Seam provides means for authenticating using either HTTP Basic or HTTP Digest (RFC 2617) methods. To use either form of authentication, the <literal>authentication-filter</literal> component must be enabled in components.xml:
it_it: Benché l'uso non sia raccomandato a meno che non sia assolutamente necessario, Seam fornisce gli strumenti per l'autenticazione in HTTP sia con metodo Basic che Digest (RFC 2617). Per usare entrambe le forme di autenticazione, occorre abilitare il componente <literal>authentication-filter</literal> in <literal>components.xml</literal>:
ja_jp: 推奨されませんが、どうしても必要であれば、Seamは（RFC2617）のHTTPBasicあるいはHTTPDigestメソッドを認証に使用する事ができます。 これらの認証フォームを使用する場合にはcomponents.xmlで <literal>authentication-filter</literal>が使用可能に設定されている必要があります。

source: To enable the filter for basic authentication, set <literal>auth-type</literal> to <literal>basic</literal>, or for digest authentication, set it to <literal>digest</literal>. If using digest authentication, the <literal>key</literal> and <literal>realm</literal> must also be set:
it_it: Per abilitare il filtro per l'autenticazione Basic impostare <literal>auth-type</literal> a <literal>basic</literal>, oppure per l'autenticazione Digest, impostarlo a <literal>digest</literal>. Se si usa l'autenticazione Digest, occorre impostare anche un valore per <literal>key</literal> e <literal>realm</literal>:
ja_jp: ベーシックな認証フィルタを使用する場合、<literal>auth-type</literal>に<literal>basic</literal>を設定し、ダイジェスト認証を使用する場合には、<literal>digest</literal>を設定します。 ダイジェスト認証を使用する場合には <literal>key</literal> と <literal>realm</literal>も設定する必要があります。

source: <![CDATA[ <web:authentication-filter url-pattern="*.seam" auth-type="digest" key="AA3JK34aSDlkj" realm="My App"/> ]]>
it_it: <![CDATA[ <web:authentication-filter url-pattern="*.seam" auth-type="digest" key="AA3JK34aSDlkj" realm="La mia Applicazione"/> ]]>

source: The <literal>key</literal> can be any String value. The <literal>realm</literal> is the name of the authentication realm that is presented to the user when they authenticate.
it_it: <literal>key</literal> può essere un qualunque valore stringa. <literal>realm</literal> è il nome del dominio di autenticazione che viene presentato all'utente quando si autentica.
ja_jp: <literal>key</literal>は任意の文字列です。 <literal>realm</literal>はユーザーが認証される時にユーザーに提供される認証レルムです。

source: Writing a Digest Authenticator
it_it: Scrivere un autenticatore Digest
ja_jp: ダイジェスト認証の記述

source: If using digest authentication, your authenticator class should extend the abstract class <literal>org.jboss.seam.security.digest.DigestAuthenticator</literal>, and use the <literal>validatePassword()</literal> method to validate the user's plain text password against the digest request. Here is an example:
it_it: Se si usa l'autenticazione Digest, la classe authenticator deve estendere la classe astratta <literal>org.jboss.seam.security.digest.DigestAuthenticator</literal> e usare il metodo <literal>validatePassword()</literal> per validare la password in chiaro dell'utente con la richiesta Digest. Ecco un esempio:
ja_jp: ダイジェスト認証を使用する場合は<literal>org.jboss.seam.security.digest.DigestAuthenticator</literal>アブストラクトクラスを拡張して、<literal>validatePassword()</literal>メソッドによりユーザーのプレーンテキストのパスワードとダイジェスト要求を照合する必要があります。 以下はコード例です。

source: Advanced Authentication Features
it_it: Caratteristiche di autenticazione avanzate
ja_jp: 高度な認証機能

source: This section explores some of the advanced features provided by the security API for addressing more complex security requirements.
it_it: Questo paragrafo esplora alcune delle caratteristiche avanzate fornite dalle API di sicurezza per affrontare requisiti di sicurezza più complessi.
ja_jp: ここでは、より高度なセキュリティ要求に応えられる、セキュリティAPIで提供されているさらに高度な機能について紹介します。

source: Using your container's JAAS configuration
it_it: Utilizzare la configurazione JAAS del container
ja_jp: 使用しているコンテナのJAASの設定
