Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: Then a <literal>Customer</literal> with an <literal>id</literal> value of <literal>123</literal> would have an identifier value of "<literal>cust:123</literal>".
it_it: Allora un <literal>Customer</literal> con un <literal>id</literal> pari a <literal>123</literal> avrà come identificatore "<literal>cust:123</literal>".
ja_jp: 結果として、<literal>id</literal>が<literal>123</literal>の<literal>Customer</literal>は "<literal>cust:123</literal>"という識別子を持つことになります。

source: Permission Management
it_it: Gestione dei permessi
ja_jp: パーミッションの管理

source: In much the same way that Seam Security provides an Identity Management API for the management of users and roles, it also provides a Permissions Management API for the management of persistent user permissions, via the <literal>PermissionManager</literal> component.
it_it: In modo del tutto simile a come la sicurezza di Seam fornisce una API per la gestione delle identità per gestire utenti e ruoli, essa fornisce anche una API per la gestione dei permessi, tramite il componente <literal>PermissionManager</literal>.
ja_jp: Seamセキュリティでユーザーとロールの管理のために提供しているID管理APIと同様に、永続的なユーザーのアクセス権の管理のためのパーミッションマネージメントAPIを <literal>PermissionManager</literal>により提供しています。

source: The <literal>PermissionManager</literal> component is an application-scoped Seam component that provides a number of methods for managing permissions. Before it can be used, it must be configured with a permission store (although by default it will attempt to use <literal>JpaPermissionStore</literal> if it is available). To explicitly configure a custom permission store, specify the <literal>permission-store</literal> property in components.xml:
it_it: Il componente <literal>PermissionManager</literal> è un componente Seam registrato a livello application che fornisce una serie di metodi per gestire i permessi. Prima di poter essere usato deve essere configurato con un permission store (benché per default tenterà di usare il <literal>JpaPermissionStore</literal> se disponibile). Per configurare esplicitamente un permission store personalizzato, occore specificare la proprietà <literal>permission-store</literal> in components.xml:
ja_jp: <literal>PermissionManager</literal>コンポーネントはパーミッションを管理するための多くのメソッドを持つアプリケーションスコープのSeamのコンポーネントです。 使用する前にパーミッションストアを設定する必要があります（デフォルトで、<literal>JpaPermissionStore</literal>が存在すれば、これを使うようになります）。 明示的に別のパーミッションストアを設定する場合には、<literal>components.xml</literal>に<literal>permission-store</literal>を設定します。

source: The following table describes each of the available methods provided by <literal>PermissionManager</literal>:
it_it: La seguente tabella descrive ciascuno dei metodi disponibili forniti da <literal>PermissionManager</literal>:
ja_jp: 以下の表に<literal>PermissionManager</literal>の提供するメソッドの詳細を示します。

source: PermissionManager API methods
it_it: Metodi della API PermissionManager
ja_jp: パーミッションマネージャAPIのメソッド

source: Returns a list of <literal>Permission</literal> objects representing all of the permissions that have been granted for the specified target and action.
it_it: Restituisce un elenco di oggetti <literal>Permession</literal> che rappresenta tutti i permessi che sono stati concessi all'obiettivo e all'azione specificata.
ja_jp: 指定されたターゲットとアクションに対する承認されたすべてのパーミッションを示す<literal>Permission</literal>オブジェクトを返します。

source: Persists (grants) the specified <literal>Permission</literal> to the backend permission store. Returns true if the operation was successful.
it_it: Memorizza (concede) il <literal>Permission</literal> specificato nel permission store sottostante. Restituisce true se l'operazione si è conclusa con esito positivo.
ja_jp: バックエンドのパーミッションストアに指定した<literal>Permission</literal>sをセーブする。 操作に成功した場合trueを返す。

source: Persists (grants) the specified list of <literal>Permission</literal>s to the backend permission store. Returns true if the operation was successful.
it_it: Memorizza (concede) l'elenco di <literal>Permission</literal> specificato nel permission store sottostante. Restiuisce true se l'operazione si è conclusa con esito positivo.
ja_jp: バックエンドのパーミッションストアに指定した複数の<literal>Permission</literal>sをセーブする。 操作に成功した場合trueを返す。

source: Removes (revokes) the specified <literal>Permission</literal> from the backend permission store. Returns true if the operation was successful.
it_it: Rimuove (revoca) il <literal>Permission</literal> specificato dal permission store sottostante. Restituisce true se l'operazione si è conclusa con esito positivo.
ja_jp: バックエンドのパーミッションストアから指定した<literal>Permission</literal>sを取り除く（削除する）。操作に成功した場合trueを返す。

source: Removes (revokes) the specified list of <literal>Permission</literal>s from the backend permission store. Returns true if the operation was successful.
it_it: Rimuove (revoca) l'elenco di <literal>Permission</literal> specificato dal permission store sottostante. Restituisce true se l'operazione si è conclusa con esito positivo.
ja_jp: バックエンドのパーミッションストアから指定した複数の<literal>Permission</literal>sを取り除く（削除する）。 操作に成功した場合trueを返す。

source: Returns a list of the available actions for the specified target object. The actions that this method returns are dependent on the <literal>@Permission</literal> annotations configured on the target object's class.
it_it: Restituisce un elenco delle azioni disponibili per l'oggetto obiettivo specificato. Le azioni che questo metodo restituisce dipendono dall'annotazione <literal>@Permission</literal> configurata nella classe dell'oggetto obiettivo.
ja_jp: 対象ターゲットに対する適用可能なアクションのリストを返す。 返されるアクションはターゲットオブジェクトクラスに設定されている<literal>@Permission</literal> アノテーションに依存する。

source: Permission checks for PermissionManager operations
it_it: Verifica dei permessi sulle operazioni di PermissionManager
ja_jp: パーミッションマネージャ操作のためのパーミッションチェック

source: Invoking the methods of <literal>PermissionManager</literal> requires that the currently-authenticated user has the appropriate authorization to perform that management operation. The following table lists the required permissions that the current user must have.
it_it: Per chiamare un metodo di <literal>PermissionManager</literal> è richiesto che l'utente correntemente autenticato abbia le autorizzazioni appropriate per eseguire quella operazione di gestione. La seguente tabella elenca i permessi richiesti che l'utente corrente deve avere.
ja_jp: <literal>PermissionManager</literal>メソッドを起動する場合には現在の認証ユーザーが当該管理操作をするために必要な適切なパーミッションを持っている必要があります。 下の表に、現在のユーザーが持っていなければならないパーミッションの一覧を示します。

source: Permission Management Security Permissions
it_it: Permessi per la gestione dei permessi
ja_jp: パーミッション管理 セキュリティパーミッション

source: The specified <literal>target</literal>
it_it: L'<literal>obiettivo</literal> specificato
ja_jp: 特定の<literal>target</literal>

source: The target of the specified <literal>Permission</literal>, or each of the targets for the specified list of <literal>Permission</literal>s (depending on which method is called).
it_it: L'obiettivo del <literal>Permission</literal> specificato, oppure ciascuno degli obiettivi dell'elenco specificato di <literal>Permission</literal> (in funzione di quale metodo viene chiamato).
ja_jp: ターゲットの特定の<literal>Permission</literal>、あるいは個別のターゲットの<literal>Permission</literal>sリスト（どちらのメソッドを呼ぶのかにより異なる）

source: The target of the specified <literal>Permission</literal>.
it_it: L'obiettivo del <literal>Permission</literal> specificato.
ja_jp: ターゲットの特定の<literal>Permission</literal>

source: Each of the targets of the specified list of <literal>Permission</literal>s.
it_it: Ciascuno degli obiettivi dell'elenco di <literal>Permission</literal> specificato.
ja_jp: それぞれのターゲットの特定の<literal>Permission</literal>s

source: SSL Security
it_it: Sicurezza SSL
ja_jp: SSLによるセキュリティ

source: Seam includes basic support for serving sensitive pages via the HTTPS protocol. This is easily configured by specifying a <literal>scheme</literal> for the page in <literal>pages.xml</literal>. The following example shows how the view <literal>/login.xhtml</literal> is configured to use HTTPS:
it_it: Seam include un supporto di base per servire le pagine sensibili tramite il protocollo HTTPS. Si configura facilmente specificando uno <literal>scheme</literal> per la pagina in <literal>pages.xml</literal>. Il seguente esempio mostra come la pagina <literal>/login.xhtml</literal> è configurata per usare HTTPS:
ja_jp: SeamはHTTPSプロトコルによるpageのセキュリティを基本的な部分についてサポートしています。 この機能は、<literal>pages.xml</literal>で必要なページについて<literal>scheme</literal>を指定することにより簡単に設定することができます。 下の例では<literal>/login.xhtml</literal>でHTTPSを使う様に設定しています。

source: This configuration is automatically extended to both <literal>s:link</literal> and <literal>s:button</literal> JSF controls, which (when specifying the <literal>view</literal>) will also render the link using the correct protocol. Based on the previous example, the following link will use the HTTPS protocol because <literal>/login.xhtml</literal> is configured to use it:
it_it: Questa configurazione viene automaticamente estesa ai controlli JSF <literal>s:link</literal> e <literal>s:button</literal>, i quali (quando viene specificata la <literal>view</literal>) faranno in modo che venga prodotto il link usando il protocollo corretto. In base al precedente esempio, il seguente link userà il protocollo HTTPS, perché <literal>/login.xhtml</literal> è configurata per usarlo:
ja_jp: また、この設定は自動的にJSFの<literal>s:link</literal>や<literal>s:button</literal>にも引き継がれ (<literal>view</literal>で指定した場合) 、リンクも正しいプロトコルで描画されます。前述の例の場合、下のようなリンクも<literal>/login.xhtml</literal>がHTTPSを使うように設定されているために、<literal>s:link</literal>先の<literal>login.xhmtl</literal>にもHTTPSがプロトコルとして使用されます。

source: Browsing directly to a view when using the <emphasis>incorrect</emphasis> protocol will cause a redirect to the same view using the <emphasis>correct</emphasis> protocol. For example, browsing to a page that has <literal>scheme="https"</literal> using HTTP will cause a redirect to the same page using HTTPS.
it_it: Navigando direttamente sulla pagina mentre si usa il protocollo <emphasis>non corretto</emphasis> causerà una redirezione alla stessa pagina usando il protocollo <emphasis>corretto</emphasis>. Ad esempio, navigando su una pagina che ha <literal>scheme="https"</literal> usando HTTP causerà una redirezione alla stessa pagina usando HTTPS.
ja_jp: 指定されたプロトコル以外 (<emphasis>正しくない</emphasis>プロトコル) を使って、ページを見ようとすると、<emphasis>正しい</emphasis>プロトコルを使って、指定のページへリダイレクトされます。 <literal>schema="https"</literal>が指定されているページにhttpでアクセスしようとすると、そのページにhttpsを使ってリダイレクトされます。

source: It is also possible to configure a <emphasis>default scheme</emphasis> for all pages. This is useful if you wish to use HTTPS for a only few pages. If no default scheme is specified then the normal behavior is to continue use the current scheme. So once the user accessed a page that required HTTPS, then HTTPS would continue to be used after the user navigated away to other non-HTTPS pages. (While this is good for security, it is not so great for performance!). To define HTTP as the default <literal>scheme</literal>, add this line to <literal>pages.xml</literal>:
it_it: E' anche possibile configurare un <emphasis>default scheme</emphasis> per tutte le pagine. Questo è utile se si vuole usare HTTPS solo per alcune pagine. Se non è indicato un default scheme, allora il comportamento normale è di continuare ad usare lo schema correntemente usato. Perciò una volta che l'utente ha fatto l'accesso ad una pagina che richiede HTTPS, allora HTTPS continuerà ad essere usato dopo che l'utente si sposta su altre pagine non HTTPS. (Mentre questo è buono per la sicurezza, non lo è per le prestazioni!). Per definire HTTP come <literal>default scheme</literal>, aggiungere questa riga a <literal>pages.xml</literal>:
ja_jp: すべてのページに対して<emphasis>デフォルトのscheme</emphasis>を設定することも可能で、一部のページに対してHTTPSを使用したい場合などに有効です。 デフォルトスキーマが設定されていない場合には、現在のスキーマを継承します。 従って、ユーザーがHTTPSを必要とするページにアクセスすると、それ以降はHTTPSを必要としないページに対してもHTTPSを使ったアクセスとなります（これは、セキュリティ上は良いのですが、パフォーマンス上は問題があります）。 HTTPをデフォルトの<literal>scheme</literal>として指定する場合には次の一行を<literal>pages.xml</literal>に追加してください。

source: Of course, if <emphasis>none</emphasis> of the pages in your application use HTTPS then it is not required to specify a default scheme.
it_it: Chiaramente, se <emphasis>nessuna</emphasis> delle pagine dell'applicazione usa HTTPS allora non è richiesto di specificare alcun default scheme.
ja_jp: もちろん、HTTPSを使う必要がなければ、デフォルトのschemaを指定する必要もありません。

source: You may configure Seam to automatically invalidate the current HTTP session each time the scheme changes. Just add this line to <literal>components.xml</literal>:
it_it: E' possibile configurare Seam per invalidare automaticamente la sessione HTTP ogni volta che lo schema cambia. Basta aggiungere questa riga a <literal>components.xml</literal>:
ja_jp: 以下のように、<literal>components.xml</literal>に設定することにより、スキーマが変さらになるたびに現在のHTTPセッションを自動的に無効にする事ができます。

source: This option helps make your system less vulnerable to sniffing of the session id or leakage of sensitive data from pages using HTTPS to other pages using HTTP.
it_it: Questa opzione aiuta nel rendere il sistema meno vulnerabile alle intromissioni che rilevano l'id di sessione o alla mancanza di protezione su dati sensibili dalle pagine che usano HTTPS ad altre che usano HTTP.
ja_jp: このオプションはHTTPSのページから、HTTPのページへの重要データの漏れや、セッションIDの盗聴に対する脆弱性を減少させます。

source: Overriding the default ports
it_it: Modificare le porte di default
ja_jp: デフォルトのポートの上書き

source: If you wish to configure the HTTP and HTTPS ports manually, they may be configured in <literal>pages.xml</literal> by specifying the <literal>http-port</literal> and <literal>https-port</literal> attributes on the <literal>pages</literal> element:
it_it: Se si vogliono configurare manualmente le porte HTTP e HTTPS, queste possono essere configurate in <literal>pages.xml</literal> specificando gli attributi <literal>http-port</literal> e <literal>https-port</literal> nell'elemento <literal>pages</literal>:
ja_jp: もし個別にHTTPとHTTPSの使用を設定する必要があるのであれば、<literal>pages.xml</literal> の<literal>pages</literal> エレメントに<literal>http-port</literal> あるいは <literal>https-port</literal>を設定することにより行えます。

source: Though strictly not part of the security API, Seam provides a built-in CAPTCHA (<emphasis>C</emphasis>ompletely <emphasis>A</emphasis>utomated <emphasis>P</emphasis>ublic <emphasis>T</emphasis>uring test to tell <emphasis>C</emphasis>omputers and <emphasis>H</emphasis>umans <emphasis>A</emphasis>part) algorithm to prevent automated processes from interacting with your application.
it_it: Sebbene non faccia strettamente parte delle API di sicurezza, Seam fornisce un algoritmo CAPTCHA (<emphasis>C</emphasis>ompletely <emphasis>A</emphasis>utomated <emphasis>P</emphasis>ublic <emphasis>T</emphasis>uring test to tell <emphasis>C</emphasis>omputer and <emphasis>H</emphasis>umans <emphasis>A</emphasis>part, test di Turing publico completamente automatico per distinguere gli umani dalle macchine) già fatto per prevenire l'interazione con l'applicazione da parte di procedure automatiche.
ja_jp: 厳密にはセキュリティAPIの一部ではありませんが、SeamはCAPCHA(<emphasis>C</emphasis>ompletely <emphasis>A</emphasis>utomated <emphasis>P</emphasis>ublic <emphasis>T</emphasis>uring test to tell <emphasis>C</emphasis>omputers and <emphasis>H</emphasis>umans <emphasis>A</emphasis>part)アルゴリズムを内蔵しており、ウェブ上の自動処理プログラムによりアプリケーションが動作しないようにする事を可能にしています。

source: Configuring the CAPTCHA Servlet
it_it: Configurare la servlet CAPTCHA
ja_jp: キャプチャ サーブレットの設定

source: To get up and running, it is necessary to configure the Seam Resource Servlet, which will provide the Captcha challenge images to your pages. This requires the following entry in <literal>web.xml</literal>:
it_it: Per partire è necessario configurare la Seam Resource Servlet, che fornirà l'immagine CAPTCHA da risolvere nella pagina. Questo richiede la seguente voce in <literal>web.xml</literal>:
ja_jp: キャプチャを起動して走らせるためには、Seamのリソースサーブレットを下のように、<literal>web.xml</literal>に設定する必要があります。これにより、アプリケーションのページにキャプチャチャレンジのイメージを提供するようになります。

source: Adding a CAPTCHA to a form
it_it: Aggiungere un CAPTCHA ad una form
ja_jp: キャプチャのフォームへの追加

source: Adding a CAPTCHA challenge to a form is extremely easy. Here's an example:
it_it: Aggiungere una verifica CAPTCHA ad una form è estremamente facile. Ecco un esempio:
ja_jp: キャプチャチャレンジをフォームに追加するのは以下のようにいたって簡単です:

source: That's all there is to it. The <literal>graphicImage</literal> control displays the CAPTCHA challenge, and the <literal>inputText</literal> receives the user's response. The response is automatically validated against the CAPTCHA when the form is submitted.
it_it: Questo è tutto. Il controllo <literal>graphicImage</literal> mostra l'immagine CAPTCHA e <literal>inputText</literal> riceve la risposta dell'utente. La risposta viene automaticamente validata con il CAPTCHA quando la form viene inviata.
ja_jp: これですべてです。 <literal>graphicImage</literal> がキャプチャチャレンジの表示を制御し、<literal>inputText</literal>がユーザーからの入力を受け付けます。 ユーザーの入力はフォームが送信された時に自動的にキャプチャと照合されます。

source: Customising the CAPTCHA algorithm
it_it: Personalizzare l'algoritmo CAPTCHA
ja_jp: キャプチャアルゴリズムのカスタム化

source: You may customize the CAPTCHA algorithm by overriding the built-in component:
it_it: E' possibile personalizzare l'algoritmo CAPTCHA sovrascrivendo il componente già fatto:
ja_jp: 内蔵コンポーネントをオーバーライドする事により、キャプチャのアルゴリズムをカスタマイズすることができます。

source: <![CDATA[@Name("org.jboss.seam.captcha.captcha") @Scope(SESSION) public class HitchhikersCaptcha extends Captcha { @Override @Create public void init() { setChallenge("What is the answer to life, the universe and everything?"); setCorrectResponse("42"); } @Override public BufferedImage renderChallenge() { BufferedImage img = super.renderChallenge(); img.getGraphics().drawOval(5, 3, 60, 14); //add an obscuring decoration return img; } }]]>
it_it: <![CDATA[@Name("org.jboss.seam.captcha.captcha") @Scope(SESSION) public class HitchhikersCaptcha extends Captcha { @Override @Create public void init() { setChallenge("Qual è la risposta alla vita, all'universo e a tutto il resto?"); setCorrectResponse("42"); } @Override public BufferedImage renderChallenge() { BufferedImage img = super.renderChallenge(); img.getGraphics().drawOval(5, 3, 60, 14); //aggiungi qualche oscura decorazione return img; } }]]>

source: Security Events
it_it: Eventi della sicurezza
ja_jp: セキュリティ イベント

source: The following table describes a number of events (see <xref linkend="events"/>) raised by Seam Security in response to certain security-related events.
it_it: La seguente tabella descrive una serie di eventi (vedi <xref linkend="events"/>) lanciati dalla sicurezza di Seam in corrispondenza di determinati eventi relativi alla sicurezza.
ja_jp: 以下の表に、セキュリティ関連のイベントによりSeamのセキュリティで発生するイベント（<xref linkend="events"/>）を一覧にしました。

source: Event Key
it_it: Nome dell'evento
ja_jp: イベントキー

source: Raised when a login attempt is successful.
it_it: Lanciato quando un tentativo di login è stato completato con esito positivo.
ja_jp: ログインに成功した時に発生

source: Raised when a login attempt fails.
it_it: Lanciato quando un tentativo di login è fallito.
ja_jp: ログインに失敗した時に発生

source: Raised when a user that is already authenticated attempts to log in again.
it_it: Lanciato quando un utente che ha già fatto il login, tenta di fare il login di nuovo.
ja_jp: ユーザーがすでに認証されていて再度ログインした時に発生

source: Raised when a security check fails when the user is not logged in.
it_it: Lanciato quando una verifica di sicurezza fallisce in quanto l'utente non ha fatto il login.
ja_jp: ユーザーがログインしていないためにセキュリティチェックに失敗した時に発生

source: Raised when a security check fails when the user is logged in however doesn't have sufficient privileges.
it_it: Lanciato quando una verifica di sicurezza fallisce in quanto l'utente ha fatto il login ma non ha i privilegi richiesti.
ja_jp: ユーザーがログインできても十分な特権が無くセキュリティチェックに失敗した時に発生

source: Raised just prior to user authentication.
it_it: Lanciato subito prima l'autenticazione dell'utente.
ja_jp: ユーザーが認証される直前に発生

source: Raised just after user authentication.
it_it: Lanciato subito dopo l'autenticazione dell'utente.
ja_jp: ユーザーが認証された直後に発生

source: Raised after the user has logged out.
it_it: Lanciato dopo che l'utente ha fatto un logout.
ja_jp: ユーザーがログアウトした後に発生

source: Raised when the user's credentials have been changed.
it_it: Lanciato quando le credenziali dell'utente vengono cambiate.
ja_jp: ユーザーのクレデンシャル（信用情報）が変更された時に発生

source: Raised when the Identity's rememberMe property is changed.
it_it: Lanciato quando la proprietà RememberMe di Identity viene modificata.
ja_jp: IdentityのrememberMeプロパティが変更された時に発生

source: Sometimes it may be necessary to perform certain operations with elevated privileges, such as creating a new user account as an unauthenticated user. Seam Security supports such a mechanism via the <literal>RunAsOperation</literal> class. This class allows either the <literal>Principal</literal> or <literal>Subject</literal>, or the user's roles to be overridden for a single set of operations.
it_it: A volte può essere necessario eseguire determinate operazioni con dei privilegi più elevati, come creare un nuovo utente da parte di un utente non autenticato. La sicurezza di Seam gestisce un tale meccanismo tramite la classe <literal>RunAsOperation</literal>. Questa classe consente sia al <literal>Principal</literal> o al <literal>Subject</literal>, che ai ruoli dell'utente di essere sovrascritti per un singolo insieme di operazioni.
ja_jp: 場合により、上位権限で処理することが必要な場合があります（たとえば、認証されていないユーザーが、新しいユーザーアカウントを作成する場合）。 Seamはこのような機能を<literal>RunAsOperation</literal>クラスで提供しています。 このクラスは、限定された一組の操作に対して <literal>Principal</literal>、<literal>Subject</literal>、あるいはユーザーのロールを一時的に上書きする事を可能にします。

source: The following code example demonstrates how <literal>RunAsOperation</literal> is used, by calling its <literal>addRole()</literal> method to provide a set of roles to masquerade as for the duration of the operation. The <literal>execute()</literal> method contains the code that will be executed with the elevated privileges.
it_it: Il seguente codice di esempio mostra come viene usato <literal>RunAsOperation</literal>, chiamando il suo metodo <literal>addRole()</literal> per fornire un insieme di ruoli fittizi solo per la durata dell'operazione. Il metodo <literal>execute()</literal> contiene il codice che verrà eseguito con i privilegi aggiuntivi.
ja_jp: 以下のコード例では<literal>RunAsOperation</literal>の使われ方について、<literal>addRole()</literal> メソッドを呼び出して操作終了まで特定のロールを付与する方法を示します。 <literal>execute()</literal> メソッドはより上位の特権で実行するためのコードを持っています。

source: In a similar way, the <literal>getPrincipal()</literal> or <literal>getSubject()</literal> methods can also be overriden to specify the <literal>Principal</literal> and <literal>Subject</literal> instances to use for the duration of the operation. Finally, the <literal>run()</literal> method is used to carry out the <literal>RunAsOperation</literal>.
it_it: In modo analogo, i metodi <literal>getPrincipal()</literal> o <literal>getSubject()</literal> possono anch'essi essere sovrascritti per specificare le istanze di <literal>Principal</literal> e <literal>Subject</literal> da usare per la durata dell'operazione. Infine, il metodo <literal>run()</literal> è usato per eseguire la <literal>RunAsOperation</literal>.
ja_jp: 同様に<literal>getPrincipal()</literal> や <literal>getSubject()</literal>メソッドは<literal>Principal</literal>インスタンスおよび <literal>Subject</literal>インスタンスを実行中に上書きする事ができます。 最終的に<literal>RunAsOperation</literal>を実行するために<literal>run()</literal>メソッドを使用します。

source: Extending the Identity component
it_it: Estendere il componente Identity
ja_jp: IDコンポーネント（Identity component）の拡張
