Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: If you would rather not use the simplified JAAS configuration provided by the Seam Security API, you may instead delegate to the default system JAAS configuration by providing a <literal>jaas-config-name</literal> property in <literal>components.xml</literal>. For example, if you are using JBoss AS and wish to use the <literal>other</literal> policy (which uses the <literal>UsersRolesLoginModule</literal> login module provided by JBoss AS), then the entry in <literal>components.xml</literal> would look like this:
it_it: Se non si vuole usare la configurazione JAAS semplificata fornita dalle API di sicurezza di Seam, è possibile delegare alla configurazione JAAS di default del sistema fornendo una proprietà <literal>jaas-config-name</literal> in <literal>components.xml</literal>. Ad esempio, se si sta usando JBoss AS e si vuole usare la politica <literal>other</literal> (la quale usa il modulo di login <literal>UsersRolesLoginModule</literal> fornito da JBoss AS), allora la voce da mettere in <literal>components.xml</literal> sarà simile a questa:
ja_jp: もしSeamのセキュリティAPIが提供する簡素化されたJAAS設定を使用したくなければ、<literal>components.xml</literal>に<literal>jaas-config-name</literal> プロパティを設定する事によりシステムのデフォルトのJAAS設定にすることができます。 例として、JBossASをアプリケーションサーバーとして使用していて <literal>other</literal>ポリシー（JBossASの提供する <literal>UsersRolesLoginModule</literal>ログインモジュールを使用する）を使用したい場合には、<literal>components.xml</literal>に以下のような記述をします。

source: Please keep in mind that doing this does not mean that your user will be authenticated in whichever container your Seam application is deployed in. It merely instructs Seam Security to authenticate itself using the configured JAAS security policy.
it_it: E' il caso di tenere ben presente che facendo in questo modo non significa che l'utente verrà autenticato in qualsiasi container in cui venga eseguita l'applicazione Seam. Questa configurazione istruisce semplicemente la sicurezza di Seam ad autenticarsi usando le politiche di sicurezza JAAS configurate.
ja_jp: これは単にSeamのセキュリティに対して設定されたJAASセキュリティポリシーに基づいて認証を行うように指示をしているだけで、Seamアプリケーションが配置されているどのコンテナに対してもユーザーの認証がなされたわけではない事に留意してください。

source: Identity Management
it_it: Gestione delle identità
ja_jp: IDの管理

source: Identity Management provides a standard API for the management of a Seam application's users and roles, regardless of which identity store (database, LDAP, etc) is used on the backend. At the center of the Identity Management API is the <literal>identityManager</literal> component, which provides all the methods for creating, modifying and deleting users, granting and revoking roles, changing passwords, enabling and disabling user accounts, authenticating users and listing users and roles.
it_it: La gestione delle identità fornisce un'API standard per la gestione degli utenti e dei ruoli di una applicazione Seam, a prescindere da quale dispositivo di memorizzazione delle identità è usato internamente (database, LDAP, ecc). Al centro delle API per la gestione delle identità c'è il componente <literal>identityManager</literal>, il quale fornisce tutti i metodi per creare, modificare e cancellare utenti, concedere e revocare ruoli, cambiare le password, abilitare e disabilitare gli utenti, autenticare gli utenti ed elencare utenti e ruoli.
ja_jp: ID管理は、バックエンドのIDストアの種類（データベース、LDAP等）に依存しない、Seamのユーザーとロールの管理のための標準APIを提供します。 ID管理APIの中心は<literal>identityManager</literal>コンポーネントで、新規ユーザーの作成、変更、削除、ロールの追加、無効化、パスワードの変更、ユーザーアカウントの有効化、無効化、ユーザーの認証、ユーザーとロールの一覧等の機能のためのメソッドを提供します。

source: Before it may be used, the <literal>identityManager</literal> must first be configured with one or more <literal>IdentityStore</literal>s. These components do the actual work of interacting with the backend security provider, whether it be a database, LDAP server, or something else.
it_it: Prima di essere usato, <literal>identityManager</literal> deve essere configurato con uno o più <literal>IdentityStore</literal>. Questi componenti fanno il vero lavoro di interagire con il fornitore di sicurezza sottostante, sia che si tratti di un database, di un server LDAP o di qualcos'altro.
ja_jp: 使用する前に<literal>identityManager</literal>に一つ以上の<literal>IdentityStore</literal>sを設定する必要があります。 これらのコンポーネントが実際にバックにあるデータベース、LDAP、その他のセキュリティプロバイダと協調して仕事をします。

source: Configuring IdentityManager
it_it: Configurare l'IdentityManager
ja_jp: IDマネージャの設定

source: The <literal>identityManager</literal> component allows for separate identity stores to be configured for authentication and authorization operations. This means that it is possible for users to be authenticated against one identity store, for example an LDAP directory, yet have their roles loaded from another identity store, such as a relational database.
it_it: Il componente <literal>identityManager</literal> consente di separare i dispositivi di memorizzazione configurati per le operazioni di autenticazione e di autorizzazione. Ciò significa che è possibile autenticare gli utenti tramite un dispositivo di memorizzazione, ad esempio una directory LDAP, e poi avere i loro ruoli caricati da un altro dispositivo di memorizzazione, come un database relazionale.
ja_jp: <literal>identityManager</literal> コンポーネントに認証と許可について別々のIDストアを設定する事が可能で、例えば、LDAPディレクトリを使用してユーザーの認証をし、RDBからこのユーザーのロール情報を得て使用する事ができます。

source: Seam provides two <literal>IdentityStore</literal> implementations out of the box; <literal>JpaIdentityStore</literal> uses a relational database to store user and role information, and is the default identity store that is used if nothing is explicitly configured in the <literal>identityManager</literal> component. The other implementation that is provided is <literal>LdapIdentityStore</literal>, which uses an LDAP directory to store users and roles.
it_it: Seam fornisce due implementazioni <literal>IdentityStore</literal> già pronte. <literal>JpaIdentityStore</literal> usa un database relazionale per memorizzare le informazioni su utenti e ruoli ed è il dispositivo di memorizzazione di identità di default che viene usato se non viene configurato niente in modo esplicito nel componente <literal>identityManager</literal>. L'altra implementazione fornita è <literal>LdapIdentityStore</literal>, che usa una directory LDAP per memorizzare utenti e ruoli.
ja_jp: Seamは<literal>IdentityStore</literal>として二つの<literal>IdentityStore</literal>の実装を提供しています。 ひとつはRDBを使用してユーザーとロールの情報を保持する<literal>JpaIdentityStore</literal>で、デフォルトのIDストアとして設定されており、<literal>identityManager</literal> コンポーネントの設定をすることなく使用する事ができます。 もう一つは<literal>LdapIdentityStore</literal>で、LDAPディレクトリを使用してユーザーとロールを保持します。

source: There are two configurable properties for the <literal>identityManager</literal> component - <literal>identityStore</literal> and <literal>roleIdentityStore</literal>. The value for these properties must be an EL expression referring to a Seam component implementing the <literal>IdentityStore</literal> interface. As already mentioned, if left unconfigured then <literal>JpaIdentityStore</literal> will be assumed by default. If only the <literal>identityStore</literal> property is configured, then the same value will be used for <literal>roleIdentityStore</literal> also. For example, the following entry in <literal>components.xml</literal> will configure <literal>identityManager</literal> to use an <literal>LdapIdentityStore</literal> for both user-related and role-related operations:
it_it: Ci sono due proprietà configurabili per il componente <literal>identityManager</literal>, <literal>identityStore</literal> e <literal>roleIdentityStore</literal>. Il valore di queste proprietà deve essere un'espressione EL che fa riferimento ad un componente Seam che implementa l'interfaccia <literal>IdentityStore</literal>. Come già detto, se viene lasciato non configurato allora <literal>JpaIdentityStore</literal> viene assunto come default. Se è configurata solamente la proprietà <literal>identityStore</literal> allora lo stesso valore verrà usato anche per <literal>roleIdentityStore</literal>. Ad esempio la seguente voce in <literal>components.xml</literal> configura <literal>identityManager</literal> per usare un <literal>LdapIdentityStore</literal> sia per le operazioni relative agli utenti che per quelle relative ai ruoli:
ja_jp: <literal>identityManager</literal> コンポーネントには<literal>identityStore</literal> と <literal>roleIdentityStore</literal>の二つの設定可能なプロパティがあります。これらの値は、<literal>IdentityStore</literal>インタフェースを実装したSeamコンポーネントを参照するEL式である必要があります。 既に言及したように、設定がされていない場合にはデフォルトの <literal>JpaIdentityStore</literal>が使用され、また、<literal>identityStore</literal>のみが設定された場合には<literal>roleIdentityStore</literal> に同じ値が設定されたものとして処理されます。 例えば、<literal>components.xml</literal>で<literal>LdapIdentityStore</literal>を<literal>identityManager</literal>に使用するように設定した場合には、ユーザーに関するものと、ロールに関するものの両方に<literal>identityManager</literal>が使用されます。

source: The following example configures <literal>identityManager</literal> to use an <literal>LdapIdentityStore</literal> for user-related operations, and <literal>JpaIdentityStore</literal> for role-related operations:
it_it: Il seguente esempio configura <literal>identityManager</literal> per usare un <literal>LdapIdentityStore</literal> per le operazioni relative agli utenti e un <literal>JpaIdentityStore</literal> per le operazioni relative ai ruoli.
ja_jp: 下記の例ではユーザーに関しては<literal>LdapIdentityStore</literal>を、またロールに関する処理には<literal>JpaIdentityStore</literal>を使用するよう<literal>identityManager</literal> を設定しています。

source: The following sections explain both of these identity store implementations in greater detail.
it_it: Il paragrafo seguente spiega con maggiore dettaglio entrambe queste implementazioni di <literal>IdentityStore</literal>.
ja_jp: 以下の章ではこれらのIDストアのインプリメンテーションの詳細について説明します

source: This identity store allows for users and roles to be stored inside a relational database. It is designed to be as unrestrictive as possible in regards to database schema design, allowing a great deal of flexibility in the underlying table structure. This is achieved through the use of a set of special annotations, allowing entity beans to be configured to store user and role records.
it_it: Questa memorizzazione delle identità consente agli utenti e ai ruoli di essere memorizzati in un database relazionale. E' progettato per essere il meno restrittivo possibile riguardo allo schema del database, consentendo una grande flessibilità per la struttura delle tabelle sottostanti. Questo si ottiene tramite l'uso di uno speciale insieme di annotazioni, consentendo agli entity bean di essere configurati per memorizzare utenti e ruoli.
ja_jp: このIDストアはユーザーおよびロールをリレーショナルデータベースに保存する事を可能としています。 また、データベースのスキーマ設計にはできる限り制約を作らないように設計されており、使用するテーブルの構造に大幅な自由度を認めています。 これはユーザーおよびロールのレコード用のエンティティBeanに特別のアノテーションを使用する事により実現しています。

source: Configuring JpaIdentityStore
it_it: Configurare JpaIdentityStore
ja_jp: JpaIdentityStoreの設定

source: <literal>JpaIdentityStore</literal> requires that both the <literal>user-class</literal> and <literal>role-class</literal> properties are configured. These properties should refer to the entity classes that are to be used to store both user and role records, respectively. The following example shows the configuration from <literal>components.xml</literal> in the SeamSpace example:
it_it: <literal>JpaIdentityStore</literal> richiede che siano configurate sia la proprietà <literal>user-class</literal> che <literal>role-class</literal>. Queste proprietà devono riferirsi a classi entità che servono per memorizzare i record relativi agli utente e ai ruoli, rispettivamente. Il seguente esempio illustra la configurazione di <literal>components.xml</literal> nell'applicazione di esempio SeamSpace:
ja_jp: <literal>JpaIdentityStore</literal> は <literal>user-class</literal> 属性と<literal>role-class</literal>属性を設定する必要があります。 これらの属性は、それぞれユーザーとロールのレコードを保存するエンティティクラスを参照している必要があります。 下の例では、サンプルソースのSeamSpaceの<literal>components.xml</literal>の該当部分を示しています。

source: Configuring the Entities
it_it: Configurare le entità
ja_jp: エンティティの設定

source: As already mentioned, a set of special annotations are used to configure entity beans for storing users and roles. The following table lists each of the annotations, and their descriptions.
it_it: Come già menzionato, un apposito insieme di annotazioni viene usato per configurare gli entity bean per la memorizzazione di utenti e ruoli. La seguente tabella elenca ciascuna di queste annotazioni e la relativa descrizione.
ja_jp: 先に述べたように、特定のアノテーションを使用してユーザーとロールを保持するエンティティBeanを設定します。 下の表に、これらのアノテーションとその詳細な説明について示します。

source: User Entity Annotations
it_it: Annotazioni per l'entità utente
ja_jp: ユーザーエンティティアノテーション

source: Annotation
it_it: Annotazione
ja_jp: アノテーション

source: Status
it_it: Stato
ja_jp: 状態

source: Description
it_it: Descrizione
ja_jp: 詳細

source: Required
it_it: Richiesta
ja_jp: 要求条件

source: This annotation marks the field or method containing the user's username.
it_it: Questa annotazione contrassegna il campo o il metodo che contiene lo username dell'utente.
ja_jp: このアノテーションでユーザーのusernameを保持しているフィールドあるいはメソッドをマークします。

source: This annotation marks the field or method containing the user's password. It allows a <literal>hash</literal> algorithm to be specified for password hashing. Possible values for <literal>hash</literal> are <literal>md5</literal>, <literal>sha</literal> and <literal>none</literal>. E.g:
it_it: Questa annotazione contrassegna il campo o il metodo che contiene la password dell'utente. Consente di specificare un algoritmo di <literal>hash</literal> per nascondere la password. I possibili valori per <literal>hash</literal> sono <literal>md5</literal>, <literal>sha</literal> e <literal>none</literal>. Ad esempio:
ja_jp: このアノテーションは、アノテートされたフィールドあるいはメソッドにユーザーのpasswordがある事を示しています。 passwordのハッシュアルゴリズムを<literal>hash</literal>で指定することが可能で、指定できる値には<literal>md5</literal>, <literal>sha</literal> と <literal>none</literal>があります。

source: If an application requires a hash algorithm that isn't supported natively by Seam, it is possible to extend the <literal>PasswordHash</literal> component to implement other hashing algorithms.
it_it: Se un'applicazione richiede un algoritmo di hash che non è supportato direttamente da Seam, è possibile estendere il componente <literal>PasswordHash</literal> per implementare un altro algoritmo.
ja_jp: Seamが標準でサポートしていないハッシュアルゴリズムを使用する場合には、<literal>PasswordHash</literal>を拡張して必要なハッシュアルゴリズムを実装してください。

source: Optional
it_it: Opzionale
ja_jp: オプション

source: This annotation marks the field or method containing the user's first name.
it_it: Questa annotazione contrassegna il campo o il metodo contenente il nome dell'utente.
ja_jp: ユーザーのファーストネームを保持しているフィールドあるいはメソッドをマークします。

source: This annotation marks the field or method containing the user's last name.
it_it: Questa annotazione contrassegna il campo o il metodo contenente il cognome dell'utente.
ja_jp: ユーザーのラストネームを保持しているフィールドあるいはメソッドをマークします。

source: This annotation marks the field or method containing the enabled status of the user. This should be a boolean property, and if not present then all user accounts are assumed to be enabled.
it_it: Questa annotazione contrassegna il campo o il metodo contenente lo stato di abilitazione dell'utente. Questo deve essere una proprietà boolean e, se non presente, tutti gli utenti saranno considerati abilitati.
ja_jp: このアノテーションは、アノテートされたフィールドあるいはメソッドがユーザーが不活化されているか否かを示していることを示しています。 ここでアノテートされるフィールドあるいはメソッドの属性はbooleanでなければなりません。 また、もしこのアノテーションが無ければ、すべてのユーザーが不活化されていないことになります。

source: This annotation marks the field or method containing the roles of the user. This property will be described in more detail further down.
it_it: Questa annotazione contrassegna il campo o il metodo contenente i ruoli dell'utente. Questa proprietà verrà descritta in maggiore dettaglio successivamente.
ja_jp: このアノテーションは、アノテートされたフィールドあるいはメソッドにユーザーのロールがある事を示しています。 この属性については、以下により詳細に記述します。

source: Role Entity Annotations
it_it: Annotazioni per l'entità ruolo
ja_jp: エンティティのロールのアノテーション

source: This annotation marks the field or method containing the name of the role.
it_it: Questa annotazione contrassegna il campo o il metodo contenente il nome del ruolo.
ja_jp: ユーザーのロール名を保持しているフィールドあるいはメソッドをマークします。

source: This annotation marks the field or method containing the group memberships of the role.
it_it: Questa annotazione contrassegna il campo o il metodo contenente i gruppi di appartenenza del ruolo.
ja_jp: ロールのグループメンバーを保持しているフィールドあるいはメソッドをマークします。

source: This annotation marks the field or method indicating whether the role is conditional or not. Conditional roles are explained later in this chapter.
it_it: Questa annotazione contrassegna il campo o il metodo che indica se il ruolo è condizionale o no. I ruoli condizionali verranno spiegati più avanti in questo capitolo.
ja_jp: ロールが条件付きか否かを示すフィールドあるいはメソッドをマークします。

source: Entity Bean Examples
it_it: Esempi di entity bean
ja_jp: エンティティ Beanの例

source: As mentioned previously, <literal>JpaIdentityStore</literal> is designed to be as flexible as possible when it comes to the database schema design of your user and role tables. This section looks at a number of possible database schemas that can be used to store user and role records.
it_it: Come detto precedentemente, <literal>JpaIdentityStore</literal> è progettato per essere il più possibile flessibile per ciò che riguarda lo schema del database delle tabelle degli utenti e dei ruoli. Questo paragrafo esamina una serie di possibili schemi di database che possono essere usati per memorizzare i record degli utenti e dei ruoli.
ja_jp: 既に示したように<literal>JpaIdentityStore</literal>はデータベースのユーザーとロールに関するテーブルのスキーマのデザインができるだけ自由にできるように設計されています。 ここでは、ユーザーとロールを保持するいくつかのデータベースのスキーマについてみてゆきます。

source: Minimal schema example
it_it: Esempio di uno schema minimo
ja_jp: 最小のスキーマの例

source: In this bare minimal example, a simple user and role table are linked via a many-to-many relationship using a cross-reference table named <literal>UserRoles</literal>.
it_it: In questo esempio minimale una tabella di utenti e una di ruoli sono legate tramite una relazione molti-a-molti che utilizza una tabella di collegamento chiamata <literal>UserRoles</literal>.
ja_jp: この単純な例では、クロス参照テーブル<literal>UserRoles</literal>を通じてmany-to-many関連でリンクされているuserとroleのテーブルで構成されています。

source: Complex Schema Example
it_it: Esempio di uno schema complesso
ja_jp: 複雑なスキーマの例

source: This example builds on the above minimal example by including all of the optional fields, and allowing group memberships for roles.
it_it: Questo esempio è costruito a partire dall'esempio minimo includendo tutti i campi opzionali e consentendo ai ruoli di appartenere ai gruppi.
ja_jp: この例では、前の最少機能の例にすべてのオプションフィールドと、ロールにグループメンバーを許可する機能を追加しています。

source: JpaIdentityStore Events
it_it: Eventi del JpaIdentityStore
ja_jp: JpaIdentityStore関連のイベント

source: When using <literal>JpaIdentityStore</literal> as the identity store implementation with <literal>IdentityManager</literal>, a few events are raised as a result of invoking certain <literal>IdentityManager</literal> methods.
it_it: Quando si usa <literal>JpaIdentityStore</literal> come implementazione della memorizzazione delle identità con <literal>IdentityManager</literal>, alcuni eventi vengono lanciati in corrispondenza dell'invocazione di certi metodi di <literal>IdentityManager</literal>.
ja_jp: <literal>IdentityManager</literal>のIDストアの実装として<literal>JpaIdentityStore</literal>を使用する場合、特定の <literal>IdentityManager</literal>メソッドを起動するとイベントが発生します。

source: This event is raised in response to calling <literal>IdentityManager.createUser()</literal>. Just before the user entity is persisted to the database, this event will be raised passing the entity instance as an event parameter. The entity will be an instance of the <literal>user-class</literal> configured for <literal>JpaIdentityStore</literal>.
it_it: Questo evento viene lanciato in corrispondenza della chiamata <literal>IdentityManager.createUser()</literal>. Subito prima che l'entità utente sia resa persistente sul database questo evento viene lanciato passando l'istanza dell'entità come parametro dell'evento. L'entità sarà un istanza di <literal>user-class</literal> configurata per <literal>JpaIdentityStore</literal>.
ja_jp: このイベントは<literal>IdentityManager.createUser()</literal>を呼ぶと発生します。 ユーザーエンティティがデータベースに保持される直前にエンティティインスタンスをイベントパラメータとしたイベントが発生します。 このエンティティは<literal>JpaIdentityStore</literal>に設定した <literal>user-class</literal>のインスタンスです。

source: Writing an observer for this event may be useful for setting additional field values on the entity, which aren't set as part of the standard <literal>createUser()</literal> functionality.
it_it: Scrivere un metodo che osserva questo evento può essere utile per impostare valori addizionali sui campi dell'entità che non vengono impostati nell'ambito delle funzionalità standard di <literal>createUser()</literal>.
ja_jp: エンティティに標準の<literal>createUser()</literal>で設定されない追加的なフィールド値を設定するためにこのイベントに対応するオブザーバを利用する事ができます。

source: This event is also raised in response to calling <literal>IdentityManager.createUser()</literal>. However, it is raised after the user entity has already been persisted to the database. Like the <literal>EVENT_PRE_PERSIST_USER</literal> event, it also passes the entity instance as an event parameter. It may be useful to observe this event if you also need to persist other entities that reference the user entity, for example contact detail records or other user-specific data.
it_it: Anche questo evento viene lanciato in corrispondenza di <literal>IdentityMananger.createUser()</literal>. Però viene lanciato dopo che l'entità utente è già stata resa persistente sul database. Come per l'evento <literal>EVENT_PRE_PERSIST_USER</literal>, anche questo passa l'istanza dell'entità come un parametro dell'evento. Può essere utile osservare questo evento se c'è bisogno di rendere persistenti altre entità che fanno riferimento all'entità utente, ad esempio informazioni di dettaglio del contatto o altri dati specifici dell'utente.
ja_jp: このイベントは<literal>IdentityManager.createUser()</literal>を呼ぶことによっても発生します。 しかし、このイベントはユーザーエンティティの内容がデータベースに保持された後に発生します。 このイベントも<literal>EVENT_PRE_PERSIST_USER</literal>と同様、イベントパラメータとしてエンティティのインスタンスを渡します。 ユーザーエンティティを参照する、コンタクトの詳細や当該ユーザー特有のデータのエンティティをデータベースに保存する必要がある場合には、このイベントを観察しておくのが有効です。

source: This event is raised when calling <literal>IdentityManager.authenticate()</literal>. It passes the user entity instance as the event parameter, and is useful for reading additional properties from the user entity that is being authenticated.
it_it: Questo evento viene lanciato quando viene chiamata <literal>IdentityManager.authenticate()</literal>. Passa l'istanza dell'entità utente come parametro dell'evento e risulta utile per leggere proprietà aggiuntive dall'entità dell'utente che è stato autenticato.
ja_jp: このイベントは<literal>IdentityManager.authenticate()</literal>を呼んだ時に発生します。 このイベントはエンティティインスタンスをイベントパラメータとして渡しますので、認証されたユーザーのその他の属性を読みだす時に有効に使用できます。

source: This identity store implementation is designed for working with user records stored in an LDAP directory. It is very highly configurable, allowing great flexibility in how both users and roles are stored in the directory. The following sections describe the configuration options for this identity store, and provide some configuration examples.
it_it: Questa implementazione della memorizzazione delle identità è progettata per funzionare quando le informazioni sugli utenti sono memorizzate in una directory LDAP. E' molto configurabile consentendo una grande flessibilità sul modo in cui utenti e ruoli sono memorizzati nella directory. ll seguente paragrafo descrive le opzioni di configurazione per questa implementazione e fornisce alcuni esempi di configurazione.
ja_jp: このIDストアの実装はLDAPディレクトリをユーザーレコードとして使用するよう設計されています。 この実装は、ユーザーとロールのディレクトリへの保存の方法の設定の自由度が高くなっています。 以下のセクションでは、このIIDストアの設定オプションについて説明し、いくつかのサンプル設定を示します。
