Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Security.po
Languages: it_it, ja_jp

source: Now for something more complex. Let's say you have a <literal>h:dataTable</literal> control on a page listing records for which you may or may not wish to render action links depending on the user's privileges. The <literal>s:hasPermission</literal> EL function allows us to pass in an object parameter which can be used to determine whether the user has the requested permission for that object or not. Here's how a dataTable with secured links might look:
it_it: Ora andiamo su qualcosa di più complesso. Supponiamo di avere in una pagina un controllo <literal>h:dataTable</literal> che elenca delle righe per le quali si può volere visualizzare o meno i link alle azioni in funzione dei permessi dell'utente. La funzione EL <literal>s:hasPermission</literal> ci consente di passare un parametro oggetto che può essere usato per determinare se l'utente ha o meno il permesso richiesto per quell'oggetto. Ecco come può apparire una <literal>dataTable</literal> con dei link controllati dalla sicurezza:
ja_jp: 次にもう少し複雑な例： <literal>h:dataTable</literal>の制御用のアクションリンクの表示非表示をユーザーの権限により制御する事を考えます。 EL式<literal>s:hasPermission</literal>により、ユーザーが必要な権限を持っているか否かを決定するために必要なオブジェクトをパラメータとして渡すことができます。 以下に、セキュリティを向上させたリンクを持たせた<literal>h:dataTable</literal>の例を示します。

source: <![CDATA[<h:dataTable value="#{clients}" var="cl"> <h:column> <f:facet name="header">Name</f:facet> #{cl.name} </h:column> <h:column> <f:facet name="header">City</f:facet> #{cl.city} </h:column> <h:column> <f:facet name="header">Action</f:facet> <s:link value="Modify Client" action="#{clientAction.modify}" rendered="#{s:hasPermission(cl,'modify')"/> <s:link value="Delete Client" action="#{clientAction.delete}" rendered="#{s:hasPermission(cl,'delete')"/> </h:column> </h:dataTable>]]>
it_it: <![CDATA[<h:dataTable value="#{clients}" var="cl"> <h:column> <f:facet name="header">Nome</f:facet> #{cl.name} </h:column> <h:column> <f:facet name="header">Città</f:facet> #{cl.city} </h:column> <h:column> <f:facet name="header">Azione</f:facet> <s:link value="Modifica cliente" action="#{clientAction.modify}" rendered="#{s:hasPermission(cl,'modifica')"/> <s:link value="Cancella cliente" action="#{clientAction.delete}" rendered="#{s:hasPermission(cl,'cancella')"/> </h:column> </h:dataTable>]]>

source: Securing pages
it_it: Rendere sicure le pagine
ja_jp: ページ単位のセキュリティ

source: Page security requires that the application is using a <literal>pages.xml</literal> file, however is extremely simple to configure. Simply include a <literal>&lt;restrict/&gt;</literal> element within the <literal>page</literal> elements that you wish to secure. If no explicit restriction is specified by the <literal>restrict</literal> element, an implied permission of <literal>/viewId.xhtml:render</literal> will be checked when the page is accessed via a non-faces (GET) request, and a permission of <literal>/viewId.xhtml:restore</literal> will be required when any JSF postback (form submission) originates from the page. Otherwise, the specified restriction will be evaluated as a standard security expression. Here's a couple of examples:
it_it: La sicurezza delle pagine richiede che l'applicazione usi un file <literal>pages.xml</literal>. Comunque è molto semplice da configurare. Basta includere un elemento <literal>&lt;restrict&gt;</literal> all'interno degli elementi <literal>page</literal> che si vogliono rendere sicuri. Se tramite l'elemento <literal>restrict</literal> non viene indicata esplicitamente una restrizione, verrà controllato implicitamente il permesso <literal>/viewId.xhtml:render</literal> quando la richiesta della pagina avviene in modo non-faces (GET), e il permesso<literal>/viewId.xhtml:restore</literal> quando un JSF postback (il submit della form) viene originato dalla pagina. Altrimenti viene la restrizione specificata verrà valutata come una normale espressione di sicurezza. Ecco un paio di esempi:
ja_jp: ページレベルのセキュリティはアプリケーションが<literal>pages.xml</literal>を使用していることが必要ですが、設定自身は非常に簡単です。単に保護したいページの <literal>page</literal>エレメントに<literal>&lt;restrict/&gt;</literal>を追加するだけです。 明示的に<literal>restrict</literal>で制限をしない場合、 当該ページに対してGET要求でアクセスが試みられると <literal>/viewId.xhtml:render</literal> がチェックされ、またJSFポストバック（フォームのサブミッション）に対しては <literal>/viewId.xhtml:restore</literal>権限がチェックされます。 これ以外の場合には、指定した制限について通常のセキュリティ式評価が行われます。 以下にいくつかの例を示します。

source: This page has an implied permission of <literal>/settings.xhtml:render</literal> required for non-faces requests and an implied permission of <literal>/settings.xhtml:restore</literal> for faces requests.
it_it: Questa pagina richiede implicitamente un permesso <literal>/settings.xhtml:render</literal> per le richieste non-faces e un permesso <literal>/settings.xhtml:restore</literal> per le richieste faces.
ja_jp: このページは暗黙的に、GET要求に対して<literal>/settings.xhtml:render</literal>権限を要求し、フェース要求に対しては<literal>/settings.xhtml:restore</literal>権限を要求しています。

source: <![CDATA[<page view-id="/reports.xhtml"> <restrict>#{s:hasRole('admin')}</restrict> </page>]]>
it_it: <![CDATA[<page view-id="/reports.xhtml"> <restrict>#{s:hasRole('amministratore')}</restrict> </page>]]>

source: Both faces and non-faces requests to this page require that the user is a member of the <literal>admin</literal> role.
it_it: Sia le richieste faces che quelle non-faces a questa pagina richiedono che l'utente sia membro del ruolo <literal>amministratore</literal>.
ja_jp: このページに対するfacesあるいはnon-facesな要求はユーザーが<literal>admin</literal>ロールのメンバーである事が必要です。

source: Securing Entities
it_it: Rendere sicure le entità
ja_jp: エンティティのセキュリティ

source: Seam security also makes it possible to apply security restrictions to read, insert, update and delete actions for entities.
it_it: La sicurezza di Seam consente anche di applicare le restrizioni di sicurezza alle azioni per leggere, inserire, aggiornare e cancellare le entità.
ja_jp: Seamのセキュリティは、エンティティ単位でのread,insert,updateおよびdelete操作に対してのセキュリティ制約をかけることを可能にしています。

source: To secure all actions for an entity class, add a <literal>@Restrict</literal> annotation on the class itself:
it_it: Per rendere sicure tutte le azioni per una classe entità, aggiungere un'annotazione <literal>@Restrict</literal> alla classe stessa:
ja_jp: エンティティクラスのアクション全部に対してセキュリティをかけたいのであれば、下のようにクラスに<literal>@Restrict</literal>アノテーションを付記します。

source: If no expression is specified in the <literal>@Restrict</literal> annotation, the default security check that is performed is a permission check of <literal>entity:action</literal>, where the permission target is the entity instance, and the <literal>action</literal> is either <literal>read</literal>, <literal>insert</literal>, <literal>update</literal> or <literal>delete</literal>.
it_it: Se nell'annotazione <literal>@Restrict</literal> non è indicata alcuna espressione, il controllo di sicurezza di default che viene eseguito è una verifica del permesso <literal>entità:azione</literal>, dove l'obiettivo del permesso è l'istanza dell'entità e <literal>azione</literal> è <literal>read</literal>, <literal>insert</literal>, <literal>update</literal> o <literal>delete</literal>.
ja_jp: もし、<literal>@Restrict</literal>が評価式無しで付記されていれば、デフォルトとして<literal>entity:action</literal>のパーミッションがチェックされます。 ここで、パーミッションの対象はエンティティのインスタンスで、<literal>action</literal> は <literal>read</literal>, <literal>insert</literal>, <literal>update</literal> あるいは <literal>delete</literal>のいずれかです。

source: It is also possible to only restrict certain actions, by placing a <literal>@Restrict</literal> annotation on the relevent entity lifecycle method (annotated as follows):
it_it: E' anche possibile applicare una restrizione solo a determinate azioni, posizionando l'annotazione <literal>@Restrict</literal> nel corrispondente metodo relativo al ciclo di vita dell'entità (annotato come segue):
ja_jp: また、下のようにエンティティのライフサイクルに<literal>@Restrict</literal> アノテーションを付記することにより、特定の操作だけに制約を課すことができます。

source: <literal>@PostLoad</literal> - Called after an entity instance is loaded from the database. Use this method to configure a <literal>read</literal> permission.
it_it: <literal>@PostLoad</literal> - Chiamato dopo che l'istana di una entità viene caricata dal database. Usare questo metodo per configurare un permesso <literal>read</literal>.
ja_jp: <literal>@PostLoad</literal> - エンティティのインスタンスがデータベースからロードされた後に呼び出されます。このメソッドは<literal>read</literal> パーミッションの設定に使用してください。

source: <literal>@PrePersist</literal> - Called before a new instance of the entity is inserted. Use this method to configure an <literal>insert</literal> permission.
it_it: <literal>@PrePersist</literal> - Chiamato prima che una nuova istanza dell'entità sia inserita. Usare questo metodo per configurare un permesso <literal>insert</literal>.
ja_jp: <literal>@PrePersist</literal> - エンティティの新規のインスタンスが (データベースに）挿入される前に呼び出されます。 このメソッドは<literal>insert</literal> パーミッションの設定に使用してください。

source: <literal>@PreUpdate</literal> - Called before an entity is updated. Use this method to configure an <literal>update</literal> permission.
it_it: <literal>@PreUpdate</literal> - Chiamato prima che un'entità sia aggiornata. Usare questo metodo per configurare un permesso <literal>update</literal>.
ja_jp: <literal>@PreUpdate</literal> - エンティティが更新される前に呼び出されます。 このメソッドは<literal>update</literal>パーミッションの設定に使用してください。

source: <literal>@PreRemove</literal> - Called before an entity is deleted. Use this method to configure a <literal>delete</literal> permission.
it_it: <literal>@PreRemove</literal> - Chiamato prima che un'entità venga cancellata. Usare questo metodo per configuare un permesso <literal>delete</literal>.
ja_jp: <literal>@PreRemove</literal> - エンティティが削除される前に呼び出されます。 このメソッドは<literal>delete</literal>パーミッションの設定に使用してください。

source: Here's an example of how an entity would be configured to perform a security check for any <literal>insert</literal> operations. Please note that the method is not required to do anything, the only important thing in regard to security is how it is annotated:
it_it: Ecco un esempio di come un'entità potrebbe essere configurata per eseguire un controllo di sicurezza per tutte le operazioni <literal>insert</literal>. Notare che non è richiesto che il metodo faccia qualcosa, la sola cosa importante per quanto riguarda la sicurezza è come è annotato:
ja_jp: ここでは<literal>insert</literal>操作に対してのセキュリティチェックをするためのエンティティの設定方法を示しています。 ここで注意していただきたいのは、メソッドの内容はセキュリティと関係なく、アノテーションの仕方が重要な事です。

source: Using <literal>/META-INF/orm.xml</literal>
it_it: Usare <literal>/META-INF/orm.xml</literal>
ja_jp: <literal>/META-INF/orm.xml</literal>の使用

source: You can also specify the call back method in <literal>/META-INF/orm.xml</literal>:
it_it: E' anche possibile specificare i metodi callback in <literal>/META-INF/orm.xml</literal>:
ja_jp: <literal>/META-INF/orm.xml</literal>にコールバックメソッドを指定する事もできます:

source: Of course, you still need to annotate the <literal>prePersist()</literal> method on <literal>Customer</literal> with <literal>@Restrict</literal>
it_it: Ovviamente c'è sempre bisogno di annotare il metodo <literal>prePersist()</literal> in <literal>Customer</literal> con <literal>@Restrict</literal>.
ja_jp: もちろん この場合も<literal>Customer</literal>の<literal>prePersist()</literal> メソッドに<literal>@Restrict</literal>アノテーションは必要です。

source: And here's an example of an entity permission rule that checks if the authenticated user is allowed to insert a new <literal>MemberBlog</literal> record (from the seamspace example). The entity for which the security check is being made is automatically inserted into the working memory (in this case <literal>MemberBlog</literal>):
it_it: Ed ecco un esempio di una regola sui permessi di entità che controlla se all'utente autenticato è consentito di inserire un record <literal>MemberBlog</literal> (dall'applicazione di esempio seamspace). L'entità per la quale viene fatto il controllo di sicurezza è inserita automaticamente nella working memory (in questo caso <literal>MemberBlog</literal>):
ja_jp: これは、認証されているユーザーが新規に<literal>MemberBlog</literal>レコードを追加する事ができるか否かをチェックする、エンティティ権限ルールの例（サンプルソースのseamspaceのコードから）です。 セキュリティチェックの対象となるエンティティは自動的にワーキングメモリー（この場合、<literal>MemberBlog</literal>）に挿入されます。

source: This rule will grant the permission <literal>memberBlog:insert</literal> if the currently authenticated user (indicated by the <literal>Principal</literal> fact) has the same name as the member for which the blog entry is being created. The "<literal>principal: Principal()</literal>" structure that can be seen in the example code is a variable binding - it binds the instance of the <literal>Principal</literal> object from the working memory (placed there during authentication) and assigns it to a variable called <literal>principal</literal>. Variable bindings allow the value to be referred to in other places, such as the following line which compares the member's username to the <literal>Principal</literal> name. For more details, please refer to the JBoss Rules documentation.
it_it: Questa regola concederà il permesso <literal>memberBlog:insert</literal> se l'utente attualmente autenticato (indicato dal fatto <literal>Principal</literal>) ha lo stesso nome del membro per il quale è stata creata la voce del blog. La riga "<literal>principal: Principal()</literal>" può essere vista nel codice di esempio come un collegamento con una variabile. Essa collega l'istanza dell'oggetto <literal>Principal</literal> nella working memory (posizionato durante l'autenticazione) e lo assegna ad una variabile chiamata <literal>principal</literal>. I collegamenti con le variabili consentono di fare riferimento al valore in altri posti, come nella riga successiva che confronta il nome dell'utente con il nome del <literal>Principal</literal>. Per maggiori dettagli fare riferimento alla documentazione di JBoss Rules.
ja_jp: このルールは<literal>Principal</literal>ファクトで示される現在の認証ユーザーがブログのエントリを作成したメンバーと同じ名前であれば<literal>memberBlog:insert</literal>パーミッションを付与します。 例示したコード中にある、構造体 "<literal>principal: Principal()</literal>" は認証の過程で挿入された ワーキングメモリ中の<literal>Principal</literal>オブジェクトへの変数結合で、変数<literal>principal</literal>と命名されています。 変数結合にする事により、他の場所で値が参照可能となり、下のように<literal>Principal</literal>名とメンバーのユーザー名を比較する事ができます。 詳細は、JBoss Rules ドキュメントを参照してください。

source: Finally, we need to install a listener class that integrates Seam security with your JPA provider.
it_it: Infine abbiamo bisogno di installare una classe listener che integra la sicurezza Seam con la libreria JPA.
ja_jp: 最後に、JPAプロバイダをSeamセキュリティと統合するために、リスナークラスをインストールします。

source: Entity security with JPA
it_it: La sicurezza delle entità con JPA
ja_jp: JPAでのエンティティセキュリティ

source: Security checks for EJB3 entity beans are performed with an <literal>EntityListener</literal>. You can install this listener by using the following <literal>META-INF/orm.xml</literal> file:
it_it: I controlli di sicurezza sugli entity bean EJB3 sono eseguiti con un <literal>EntityListener</literal>. E' possibile installare questo listener usando il seguente file <literal>META-INF/orm.xml</literal>:
ja_jp: EJB3エンティティBeanのセキュリティチェックは<literal>EntityListener</literal>により行われ、下記のような<literal>META-INF/orm.xml</literal>の設定でリスナーをインストールすることができます。

source: Entity security with a Managed Hibernate Session
it_it: Sicurezza delle entità con una sessione Hibernate gestita
ja_jp: 管理されたHibernateセッションにおけるエンティティのセキュリティ

source: If you are using a Hibernate <literal>SessionFactory</literal> configured via Seam, and are using annotations, or <literal>orm.xml</literal>, then you don't need to do anything special to use entity security.
it_it: Se si sta usando un <literal>SessionFactory</literal> di Hibernate configurato tramite Seam e si stanno usando le annotazioni oppure <literal>orm.xml</literal>, allora non c'è bisogno di fare niente di particolare per usare la sicurezza sulle entità.
ja_jp: Seamで設定されるHibernateの<literal>SessionFactory</literal>とアノテーションを使用している場合、あるいは<literal>orm.xml</literal>を使用している場合にはエンティティセキュリティ機能を使用するために特別な設定をする必要はありません。

source: Typesafe Permission Annotations
it_it: Annotazioni tipizzate per i permessi
ja_jp: タイプセーフなアクセス権のアノテーション

source: Seam provides a number of annotations that may be used as an alternative to <literal>@Restrict</literal>, which have the added advantage of providing compile-time safety as they don't support arbitrary EL expressions in the same way that <literal>@Restrict</literal> does.
it_it: Seam fornisce una serie di annotazioni che possono essere usate come un'alternativa a <literal>@Restrict</literal> e che hanno l'ulteriore vantaggio di essere verificabili durante la compilazione, dato che non gestiscono espressioni EL arbitrarie nel modo in cui succede per la <literal>@Restrict</literal>.
ja_jp: Seamは<literal>@Restrict</literal>に代わるアノテーションをいくつか持っており、これらを使う事により<literal>@Restrict</literal>とは異なりEL式の評価を行わないので、コンパイル時の安全性を提供します。

source: Out of the box, Seam comes with annotations for standard CRUD-based permissions, however it is a simple matter to add your own. The following annotations are provided in the <literal>org.jboss.seam.annotations.security</literal> package:
it_it: Così com'è, Seam contiene delle annotazioni per i permessi standard per le operazioni CRUD, comunque è solo questione di aggiungerne altre. Le seguenti annotazioni sono fornire nel package <literal>org.jboss.seam.annotations.security</literal>:
ja_jp: Seamには標準のCRUD操作に関するパーミッション用のアノテーションが提供されていますが、独自のアノテーションを作成する事もできます。 以下は<literal>org.jboss.seam.annotations.security</literal>パッケージで配布されているアノテーションです。

source: To use these annotations, simply place them on the method or parameter for which you wish to perform a security check. If placed on a method, then they should specify a target class for which the permission will be checked. Take the following example:
it_it: Per usare queste annotazioni basta metterle sul metodo o sul parametro per il quale si vuole eseguire il controllo di sicurezza. Se messe su un metodo, allora dovranno specificare la classe obiettivo per la quale il permesso deve essere controllato. Si prenda il seguente esempio:
ja_jp: これらのアノテーションを使うには、単にセキュリティチェックを行いたいメソッドやパラメータをアノテートするだけです。 メソッドがアノテートされた場合には、アクセス権のチェックの対象となるターゲットクラスも指定する必要があります。 以下の例を見てください。

source: In this example, a permission check will be performed for the user to ensure that they have the rights to create new <literal>Customer</literal> objects. The target of the permission check will be <literal>Customer.class</literal> (the actual <literal>java.lang.Class</literal> instance itself), and the action is the lower case representation of the annotation name, which in this example is <literal>insert</literal>.
it_it: In questo esempio un controllo di permessi viene fatto sull'utente per assicurarsi che abbia i diritti per creare un nuovo oggetto <literal>Customer</literal>. L'obiettivo del controllo di permessi sarà <literal>Customer.class</literal> (l'effettiva istanza di <literal>java.lang.Class</literal>) e l'azione è la rappresentazione a lettere minuscole del nome dell'annotazione, che in questo esempio è <literal>insert</literal>.
ja_jp: この例ではユーザーが新規の<literal>Customer</literal>オブジェクトを作成する権限があるか否かパーミッションチェックを行います。 パーミッションチェックの対象は<literal>Customer.class</literal>（<literal>java.lang.Class</literal>インスタンスそのもの）で、アクションはアノテーション名の小文字に変換されたもの、ここでは<literal>insert</literal>、となります。

source: It is also possible to annotate the parameters of a component method in the same way. If this is done, then it is not required to specify a permission target (as the parameter value itself will be the target of the permission check):
it_it: E' anche possibile annotare i parametri di un metodo di un componente allo stesso modo. Se viene fatto in questo modo non è richiesto di specificare l'obiettivo del permesso (dato che il valore stesso del parametro sarà l'obiettivo del controllo di permessi):
ja_jp: 同様にコンポーネントのメソッドのパラメータに対してもアノテートする事ができます。 これを行った場合には、パラメータの値がアクセス権チェックの対象ですから、アクセス権のターゲットを指定する必要はありません。

source: To create your own security annotation, you simply need to annotate it with <literal>@PermissionCheck</literal>, for example:
it_it: Per creare una propria annotazione di sicurezza basta annotarla con <literal>@PermissionCheck</literal>, ad esempio:
ja_jp: 下のように、独自のセキュリティアノテーションを作る場合には、単に<literal>@PermissionCheck</literal>とアノテートするだけです。

source: If you wish to override the default permisison action name (which is the lower case version of the annotation name) with another value, you can specify it within the <literal>@PermissionCheck</literal> annotation:
it_it: Se si vuole modificare il nome dell'azione di default del permesso (che è la versione a lettere minuscole del nome dell'annotazione) con un altro valore, è possibile specificarlo all'interno dell'annotazione <literal>@PermissionCheck</literal>:
ja_jp: もしデフォルトのアクセス権アクション名（アノテーション名の小文字版）を他の値で上書きする必要があれば、<literal>@PermissionCheck</literal>アノテーション内にその値を指定することができます。

source: Typesafe Role Annotations
it_it: Annotazioni tipizzate per i ruoli
ja_jp: タイプセーフなロールのアノテーション

source: In addition to supporting typesafe permission annotation, Seam Security also provides typesafe role annotations that allow you to restrict access to component methods based on the role memberships of the currently authenticated user. Seam provides one such annotation out of the box, <literal>org.jboss.seam.annotations.security.Admin</literal>, used to restrict access to a method to users that are a member of the <literal>admin</literal> role (so long as your own application supports such a role). To create your own role annotations, simply meta-annotate them with <literal>org.jboss.seam.annotations.security.RoleCheck</literal>, like in the following example:
it_it: In aggiunta alla gestione tipizzata delle annotazioni sui permessi, la sicurezza di Seam fornisce anche le annotazioni tipizzate per i ruoli che consentono di limitare l'accesso ai metodi dei componenti in base all'appartenenza ad un ruolo dell'utente attualmente autenticato. Seam fornisce una di queste annotazioni già fatta, <literal>org.jboss.seam.annotations.security.Admin</literal>, usata per limitare l'accesso ad un metodo agli utenti che sono membri del ruolo <literal>admin</literal> (purché l'applicazione gestisca un tale ruolo). Per creare le proprie annotazioni per i ruoli basta meta-annotarle con <literal>org.jboss.seam.annotations.security.RoleCheck</literal>, come nel seguente esempio:
ja_jp: タイプセーフなパーミッションのアノテーションをサポートするのに加えて、Seamセキュリティはタイプセーフなロールのアノテーションを提供し、認証されているユーザーがどのロールのメンバーに属しているかに基づいてコンポーネントのメソッドへのアクセスを制限する事を可能にしています。 Seamはこのようなアノテーションとして、<literal>admin</literal>ロール（アプリケーションにこのロールが設定されていれば）のメンバーに属しているユーザーのみにアクセスを制限する<literal>org.jboss.seam.annotations.security.Admin</literal>を提供しています。 独自のロールのアノテーションを作成するためには、下の例のように<literal>org.jboss.seam.annotations.security.RoleCheck</literal>でメタアノテートします。

source: Any methods subsequently annotated with the <literal>@User</literal> annotation as shown in the above example will be automatically intercepted and the user checked for the membership of the corresponding role name (which is the lower case version of the annotation name, in this case <literal>user</literal>).
it_it: Qualsiasi metodo successivamente annotato con l'annotazione <literal>@User</literal> come mostrata nell'esempio precedente, sarà automaticamente intercettato e sarà verificata l'appartenenza dell'utente al ruolo con il nome corrispondente (che è la versione a lettere minuscole del nome dell'annotazione, in questo caso <literal>user</literal>).
ja_jp: 上の例に示されているような<literal>@User</literal>アノテーションを持つメソッドは、呼ばれる度に自動的にインタセプトされ対応するロール名（アノテーション名を小文字に書き換えた名前ーこの場合は<literal>user</literal>）のメンバーにユーザーが含まれるかチェックされます。

source: The Permission Authorization Model
it_it: Il modello di autorizzazione dei permessi
ja_jp: パーミッション許可モデル
