Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Spring.po
Languages: it_it, ja_jp

source: Spring Framework integration
it_it: Integrazione con il framework Spring
ja_jp: Spring Framework 統合

source: The Spring integration (part of the Seam IoC module) allows easy migration of Spring-based projects to Seam and allows Spring applications to take advantage of key Seam features like conversations and Seam's more sophisticated persistence context management.
it_it: L'integrazione con Spring (parte del modulo IoC di Seam) consente una facile migrazione a Seam dei progetti basati su Spring e consente alla applicazioni Spring di sfruttare le funzionalità chiave di Seam come le conversazioni e la sofisticata gestione del contesto di persistenza.

source: Note! The Spring integration code is included in the jboss-seam-ioc library. This dependency is required for all seam-spring integration techniques covered in this chapter.
it_it: Nota! Il codice di integrazione di Spring è incluso nella libreria jboss-seam-ioc. Questa dipendenza è richiesta per tutte le tecniche di integrazione seam-spring coperte in questo capitolo.
ja_jp: 注意! Spring 統合コードは jboss-seam-ioc ライブラリに含まれています。 この依存性は本章に記載されているすべての seam-spring 統合技術に必要となります。

source: Seam's support for Spring provides the ability to:
it_it: Il supporto di Seam per Spring fornisce la possibilità di:
ja_jp: Spring の Seam サポートは次のような機能を提供します。

source: inject Seam component instances into Spring beans
it_it: iniettare le istanze dei componenti Seam nei bean Spring
ja_jp: Seam コンポーネントインスタンスを Spring Bean にインジェクトする

source: inject Spring beans into Seam components
it_it: iniettare i bean Spring nei componenti Seam
ja_jp: Spring Bean を Seam コンポーネントにインジェクトする

source: turn Spring beans into Seam components
it_it: trasformare i bean Spring in componenti Seam
ja_jp: Spring Bean を Seam コンポーネントに変換する

source: allow Spring beans to live in any Seam context
it_it: consentire ai bean Spring di vivere in un qualsiasi contesto Seam
ja_jp: Spring Bean を Seam コンテキストに配置できるようにする

source: start a spring WebApplicationContext with a Seam component
it_it: avviare un WebApplicationContext di Spring con un componente Seam
ja_jp: Seam コンポーネント で Spring Web アプリケーションを起動する

source: Support for Spring PlatformTransactionManagement
it_it: Supporto a PlatformTransactionManagement di Spring
ja_jp: Spring PlatformTransactionManagement のサポート

source: provides a Seam managed replacement for Spring's <literal>OpenEntityManagerInViewFilter</literal> and <literal>OpenSessionInViewFilter</literal>
it_it: fornisce un sostituto gestito da Seam per <literal>OpenEntityManagerInViewFilter</literal> e <literal>OpenSessionInViewFilter</literal> di Spring
ja_jp: Spring の <literal>OpenEntityManagerInViewFilter</literal> および <literal>OpenSessionInViewFilter</literal> の代替として Seam 管理を提供します。

source: Support for Spring <literal>TaskExecutors</literal> to back <literal>@Asynchronous</literal> calls
it_it: Supporto per <literal>TaskExecutors</literal> di Spring alle chiamate <literal>@Asynchronous</literal>
ja_jp: <literal>@Asynchronous</literal> コールに対応する Spring <literal>TaskExecutors</literal> のサポート

source: Injecting Seam components into Spring beans
it_it: Iniezione dei componenti Seam nei bean Spring
ja_jp: Seam コンポーネントを Spring Bean にインジェクトする

source: Injecting Seam component instances into Spring beans is accomplished using the <literal>&lt;seam:instance/&gt;</literal> namespace handler. To enable the Seam namespace handler, the Seam namespace must be added to the Spring beans definition file:
it_it: L'iniezione di istanze di componenti Seam nei bean Spring viene compiuto usando l'handler di namespace <literal>&lt;seam:instance/&gt;</literal>. Per abilitare questo handler occorre aggiungere il namespace di Seam al file di definizione dei bean Spring:
ja_jp: Seam コンポーネントインスタンスの Spring Bean へのインジェクションは、 <literal>&lt;seam:instance/&gt;</literal> 名前空間ハンドラを使用して行います。 Seam 名前空間ハンドラを有効にするには、 Seam 名前空間を Spring Bean 定義ファイルに追加しなければなりません。

source: Now any Seam component may be injected into any Spring bean:
it_it: Ora ciascuno componente di Seam può essere iniettato in un bean Spring:
ja_jp: これで、 Seam コンポーネントはいずれの Spring Bean にもインジェクション可能となりました。

source: An EL expression may be used instead of a component name:
it_it: Un'espressione EL può essere usata al posto del nome del componente:
ja_jp: コンポーネント名の代わりに EL 式が利用可能です。

source: Seam component instances may even be made available for injection into Spring beans by a Spring bean id.
it_it: Le istanze dei componenti Seam possono essere disponibili anche per l'iniezione nei bean Spring tramite l'id del bean.
ja_jp: Seam コンポーネントインスタンスは、 Spring Bean id で Spring Bean へのインジェクションができるようになります。

source: Now for the caveat!
it_it: Adesso alcuni caveat!
ja_jp: 警告!

source: Seam was designed from the ground up to support a stateful component model with multiple contexts. Spring was not. Unlike Seam bijection, Spring injection does not occur at method invocation time. Instead, injection happens only when the Spring bean is instantiated. So the instance available when the bean is instantiated will be the same instance that the bean uses for the entire life of the bean. For example, if a Seam <literal>CONVERSATION</literal>-scoped component instance is directly injected into a singleton Spring bean, that singleton will hold a reference to the same instance long after the conversation is over! We call this problem <emphasis>scope impedance</emphasis>. Seam bijection ensures that scope impedance is maintained naturally as an invocation flows through the system. In Spring, we need to inject a proxy of the Seam component, and resolve the reference when the proxy is invoked.
it_it: Seam è stato progettato da principio per supportare un modello a componenti stateful con contesti multipli. Spring no. A differenza della bijection di Seam, l'iniezionedi Spring non avviene al momento dell'invocazione del metodo. Invece avviene solo quando viene istanziato il bean Spring. Quindi quando viene istanziato il bean l'istanza disponibile sarà la stessa istanza che il bean usa per l'intera vita del bean. Per esempio, se un'istanza di un componente con scope <literal>CONVERSATION</literal> viene direttamente iniettata in un bean singleton di Spring, tale singleton manterrà un riferimento alla stessa istanza anche quando la conversazioneè terminata! Questo problema viene chiamato <emphasis>impedenza di scope</emphasis>. La bijection di Seam assicura che l'impedenza di scope sia naturalmente mantenuta quando un'invocazione attraversa il sistema. In Spring occorre iniettare un proxy del componente Seam e risolvere il riferimento quando il proxy viene invocato.
ja_jp: Seamは複数のコンテキストを持つステートフルなコンポーネントモデルに対応することを基本に設計されました。 Spring はそうではありません。 Seam のバイジェクションと異なり、 Spring のインジェクションはメソッド呼び出し時に発生しません。 その代わり、 Spring Bean がインスタンス化されるときだけ、 インジェクションは発生します。 従って、 Bean がインスタンス化されるときに利用可能なインスタンスは、 Beanのライフサイクル全期間で Bean が使用するものと同じインスタンスです。 例えば、 Seam <literal>対話</literal> スコープコンポーネントのインスタンスが 直接、 単一の Spring Bean にインジェクトされると、 その単一の Spring Bean はその対話が終了した後もずっと同じインスタンスに対する参照を保持します。 この問題を <emphasis>スコープインピーダンス (scope impedance)</emphasis> と呼んでいます。 システム全体に呼び出しが流れるように、 Seam バイインジェクションはスコープインピーダンスが自然に維持されるようにします。 Spring では、 Seam コンポーネントのプロキシをインジェクトすることでプロキシが呼ばれた場合に参照を解決する必要があります。

source: The <literal>&lt;seam:instance/&gt;</literal> tag lets us automatically proxy the Seam component.
it_it: Il tag <literal>&lt;seam:instance/&gt;</literal> consente di creare automaticamente il componente proxy del componente Seam.
ja_jp: <literal>&lt;seam:instance/&gt;</literal> タグで自動的に Seam コンポーネントをプロキシできるようになります。

source: This example shows one way to use a Seam-managed persistence context from a Spring bean. (For a more robust way to use Seam-managed persistence contexts as a replacement for the Spring <literal>OpenEntityManagerInView</literal> filter see section on <link linkend="spring-persistence">Using a Seam Managed Persistence Context in Spring</link>)
it_it: Quest'esempio mostra una modalità d'uso del contesto di persistenza gestito da Seam da un bean di Spring. (Per vedere un modo più robusto di usare i contesti di persistenza gestiti da Seam in sostituzione del filtro <literal>OpenEntityManagerInView</literal> di Spring si veda la sezione <link linkend="spring-persistence">Uso di un contesto di persistenza gestito da Seam in Spring</link>)
ja_jp: 上記の例では Spring Bean から Seam 管理の永続コンテキストを使用する方法のひとつを示しています。 (Spring <literal>OpenEntityManagerInView</literal> フィルタの代替として Seam 管理の永続コンテキストを使用するより堅牢な方法については、 <link linkend="spring-persistence">Spring で Seam 管理の永続コンテキストを使用する</link> のセクションを参照してください。)

source: Injecting Spring beans into Seam components
it_it: Iniettare i bean Spring nei componenti Seam
ja_jp: Spring Bean を Seam コンポーネントにインジェクトする

source: It is even easier to inject Spring beans into Seam component instances. Actually, there are two possible approaches:
it_it: E' ancora più facile iniettare i bean Spring nelle istanze dei componenti Seam. In verità ci sono due approcci:
ja_jp: Spring Bean を Seam コンポーネントインスタンスにインジェクトするのはさらに簡単です。 実際、 可能な方法は 2 つあります。

source: inject a Spring bean using an EL expression
it_it: iniettare un bean Spring usando un'espressione EL
ja_jp: EL 式を使用して Spring Bean をインジェクトする

source: make the Spring bean a Seam component
it_it: rendere il bean Spring un componente Seam
ja_jp: Spring Bean を Seam コンポーネントにする

source: We'll discuss the second option in the next section. The easiest approach is to access the Spring beans via EL.
it_it: Si discuterà la seconda opzione nella prossima sezione. L'approccio più facile è accedere ai bean Spring via EL.
ja_jp: 次のセクションでは 2 番目の選択肢について説明します。 もっとも容易な方法は EL を使って Spring Bean にアクセスします。

source: The Spring <literal>DelegatingVariableResolver</literal> is an integration point Spring provides for integrating Spring with JSF. This <literal>VariableResolver</literal> makes all Spring beans available in EL by their bean id. You'll need to add the <literal>DelegatingVariableResolver</literal> to <literal>faces-config.xml</literal>:
it_it: <literal>DelegatingVariableResolver</literal> di Spring è un punto di integrazione che Spring fornisce per integrarsi con JSF. Questo <literal>VariableResolver</literal> rende disponibili in EL tutti i bean di Spring tramite il loro id bean. Occorrerà aggiungere <literal>DelegatingVariableResolver</literal> a <literal>faces-config.xml</literal>:
ja_jp: Spring の <literal>DelegatingVariableResolver</literal> は Spring を JSF と統合する場合に Spring によって提供される統合ポイントになります。 この <literal>VariableResolver</literal> はその Bean ID によって EL ですべての Spring Bean を利用可能にさせることができます。 <literal>DelegatingVariableResolver</literal> を <literal>faces-config.xml</literal> に追加する必要があります。

source: Then you can inject Spring beans using <literal>@In</literal>:
it_it: Poi si possono iniettare i bean Spring usando <literal>@In</literal>:
ja_jp: これを行うと <literal>@In</literal> を使って Spring Bean をインジェクトできるようになります。

source: The use of Spring beans in EL is not limited to injection. Spring beans may be used anywhere that EL expressions are used in Seam: process and pageflow definitions, working memory assertions, etc...
it_it: L'uso dei bean Spring in EL non è limitato all'iniezione. I bean Spring possono essere usati ovunque sono usate le espressioni EL in Seam: definizioni di processo e pageflow, asserzioni nella working memory, ecc.
ja_jp: EL 式でインジェクションを行うために Spring Bean を使用することに制限はありません。 Seam で EL 式が使用されるところならどこでも Spring Bean を使用することができます。 プロセスとページフロー定義、 ワーキングメモリアサーションなど。

source: Making a Spring bean into a Seam component
it_it: Inserire un bean Spring in un componente Seam
ja_jp: Spring Bean を Seam コンポーネントにする

source: The <literal>&lt;seam:component/&gt;</literal> namespace handler can be used to make any Spring bean a Seam component. Just place the <literal>&lt;seam:component/&gt;</literal> tag within the declaration of the bean that you wish to be a Seam component:
it_it: L'handler namespace <literal>&lt;seam:component/&gt;</literal> può essere usato per far diventare un bean Spring un componente Seam. Si collochi il tag <literal>&lt;seam:component/&gt;</literal> dentro la dichiarazione del bean che si vuole rendere componente Seam:
ja_jp: <literal>&lt;seam:component/&gt;</literal> 名前空間ハンドラを使用すると、 どんな Spring Bean でも Seam コンポーネントにすることができます。 Seam コンポーネントにしたい Bean の宣言内に <literal>&lt;seam:component/&gt;</literal> タグを配置するだけです。

source: By default, <literal>&lt;seam:component/&gt;</literal> will create a <literal>STATELESS</literal> Seam component with class and name provided in the bean definition. Occasionally, such as when a <literal>FactoryBean</literal> is used, the class of the Spring bean may not be the class appearing in the bean definition. In such cases the <literal>class</literal> should be explicitly specified. A Seam component name may be explicitly specified in cases where there is potential for a naming conflict.
it_it: Di default, <literal>&lt;seam:component/&gt;</literal> creerà un componente Seam <literal>STATELESS</literal> con classe e nome forniti nella definizione del bean. Occasionalmente, come ad esempio quando viene usato un <literal>FactoryBean</literal>, la classe del bean di Spring potrebbe non essere la classe che appare nella definizione del bean. In tali casi la <literal>class</literal> deve essere specificata esplicitamente. Un nome di un componente Seam può essere specificato esplicitamente nei casi in cui c'è un potenziale conflitto di nomi.
ja_jp: デフォルトでは、 <literal>&lt;seam:component/&gt;</literal>は Bean 定義で与えられるクラスと名前を付けて <literal>STATELESS</literal>コンポーネントを生成します。 ときおり、<literal>FactoryBean</literal> が使用される場合など、 Spring Bean のクラス が Bean 定義に出てくるクラスではないことがあります。 このような場合、 <literal>class</literal> は明示的に指定されなければなりません。 名前付けに競合の可能性がある場合、 Seam コンポーネント名を明示的に指定しても構いません。

source: The <literal>scope</literal> attribute of <literal>&lt;seam:component/&gt;</literal> may be used if you wish the Spring bean to be managed in a particular Seam scope. The Spring bean must be scoped to <literal>prototype</literal> if the Seam scope specified is anything other than <literal>STATELESS</literal>. Pre-existing Spring beans usually have a fundamentally stateless character, so this attribute is not usually needed.
it_it: L'attributo <literal>scope</literal> di <literal>&lt;seam:component/&gt;</literal> può essere impiegato se si vuole che un bean Spring venga gestito in un particolare scope di Seam. Il bean di Spring deve avere scope <literal>prototype</literal> se lo scope di Seam specificato è diverso da <literal>STATELESS</literal>. I bean di Spring preesistenti hanno di solito un carattere fondamentalmente stateless, quindi quest'attributo non è di solito necessario.
ja_jp: Spring Bean を特定の Seam スコープで管理したい場合、 <literal>&lt;seam:component/&gt;</literal> の <literal>scope</literal> 属性を使用することができます。 指定される Seam スコープが <literal>STATELESS</literal> ではない場合、 Spring Bean は <literal>prototype</literal> にスコープされなければなりません。 既にある Spring Bean は通常ステートレスな特徴を基本的に持っていますので、 この属性は一般的には不要になります。

source: Seam-scoped Spring beans
it_it: Bean Spring con scope di Seam
ja_jp: Seam スコープの Spring Bean

source: The Seam integration package also lets you use Seam's contexts as Spring 2.0 style custom scopes. This lets you declare any Spring bean in any of Seam's contexts. However, note once again that Spring's component model was never architected to support statefulness, so please use this feature with great care. In particular, clustering of session or conversation scoped Spring beans is deeply problematic, and care must be taken when injecting a bean or component from a wider scope into a bean of a narrower scope.
it_it: Il pacchetto di integrazione di Seam consente di usare i contesti Seam come scope personalizzati di Spring 2.0. Questo permette di dichiarare un bean Spring in un qualsiasi contesto di Seam. Comunque, si noti nuovamente che il modello a componenti di Spring non è stato progettato per supportare la modalità stateful, quindi si usi questa funzionalità con molta attenzione. In particolare il clustering dei bean di Spring con scope sessione o conversazione è molto problematico e deve esserci molta attenzione quando si inietta un bean o un componente da uno scope più ampio in un bean con scope più piccolo.
ja_jp: Seam 統合パッケージにより Seam のコンテキストを Spring 2.0 スタイルのカスタムスコープとして使用することもできるようになります。 これによりいずれの Seam コンテキスト内でもあらゆる Spring Bean を宣言することができるようになります。 ただし、 Spring のコンポーネントモデルはステートフル性に対応するようには設計されたことはないため、 この機能を使用する際は十分に気を付けてください。 特に、 セッションや対話スコープの Spring Bean のクラスタ化は根深い問題があるため、 広いスコープの Bean やコンポーネントをスコープの狭い Bean にインジェクトする場合は注意が必要です。

source: By specifying <literal>&lt;seam:configure-scopes/&gt;</literal> once in a Spring bean factory configuration, all of the Seam scopes will be available to Spring beans as custom scopes. To associate a Spring bean with a particular Seam scope, specify the Seam scope in the <literal>scope</literal> attribute of the bean definition.
it_it: Specificando una sola volta <literal>&lt;seam:configure-scopes/&gt;</literal> nella configurazione di un bean factory di Bean, tutti gli scope di Seam saranno disponibili ai bean di Spring come scope personalizzati. Per associare un bean di Spring con un particolare scope di Seam, occorre specificare lo scope di Seam nell'attributo <literal>scope</literal> della definizione del bean.
ja_jp: Spring Bean factory 設定で<literal>&lt;seam:configure-scopes/&gt;</literal> を一度指定すると、 すべての Seam スコープがカスタムスコープとして Spring Bean に利用可能になります。 Spring Bean を特定の Seam スコープに関連付けるには、 Bean 定義の <literal>scope</literal> 属性で Seam スコープを指定してください。

source: The prefix of the scope name may be changed by specifying the <literal>prefix</literal> attribute in the <literal>configure-scopes</literal> definition. (The default prefix is <literal>seam.</literal>)
it_it: Il prefisso del nome dello scope può essere cambiato specificando l'attributo <literal>prefix</literal> nella definizione di <literal>configure-scopes</literal>. (Il prefisso di default è <literal>seam.</literal>)
ja_jp: <literal>configure-scopes</literal> 定義内の <literal>prefix</literal> 属性を指定することによって、 スコープ名のプレフィックスを変更することができます。 (デフォルトのプレフィックスは <literal>seam.</literal> です。)

source: By default an instance of a Spring Component registered in this way is not automatically created when referenced using <literal>@In</literal>. To have an instance auto-created you must either specify <literal>@In(create=true)</literal> at the injection point to identify a specific bean to be auto created or you can use the <literal>default-auto-create</literal> attribute of <literal>configure-scopes</literal> to make all spring beans who use a seam scope auto created.
it_it: Di default un'istanza di un componente Spring registrato in questo modo non viene automaticamente creato quando viene referenziato usando <literal>@In</literal>. Per avere un'istanza auto-creata si deve o specificare <literal>@In(create=true)</literal> nel punto di iniezione per identificare un bean specifico da autocreare oppure si può usare l'attributo <literal>default-auto-create</literal> di <literal>configure-scopes</literal> per rendere auto-creati tutti i bean di Spring che usano uno scope di Seam.
ja_jp: デフォルトではこの方法で登録される Spring コンポーネントのインスタンスは <literal>@In</literal> を使って参照される場合に自動的には作成されません。 インスタンスを自動作成させるにはインジェクションポイントで <literal>@In(create=true)</literal> を指定して自動作成される特定 Bean を識別するか、 <literal>configure-scopes</literal> の <literal>default-auto-create</literal> 属性を使って Seam スコープを使用する Spring Bean はすべて自動作成されるようにします。

source: Seam-scoped Spring beans defined this way can be injected into other Spring beans without the use of <literal>&lt;seam:instance/&gt;</literal>. However, care must be taken to ensure scope impedance is maintained. The normal approach used in Spring is to specify <literal>&lt;aop:scoped-proxy/&gt;</literal> in the bean definition. However, Seam-scoped Spring beans are <emphasis>not</emphasis> compatible with <literal>&lt;aop:scoped-proxy/&gt;</literal>. So if you need to inject a Seam-scoped Spring bean into a singleton, <literal>&lt;seam:instance/&gt;</literal> must be used:
it_it: I bean di Spring con scope Seam definiti in questo modo possono essere iniettati in altri bean di Spring senza l'uso di <literal>&lt;seam:instance/&gt;</literal>. Comunque si presti molta attenzione affinché venga mantenuta la impedenza di scope. L'approccio normale usato in Spring è quello di specificare <literal>&lt;aop:scoped-proxy/&gt;</literal> nella definizione del bean. Comunque i bean di Spring con scope Seam <emphasis>non</emphasis> compatibili con <literal>&lt;aop:scoped-proxy/&gt;</literal>. Quindi se occorre iniettare un bean di Spring con scope Seam in un singleton, deve essere usato <literal>&lt;seam:instance/&gt;</literal>:
ja_jp: この方法で定義された Seam スコープの Spring Bean は、 <literal>&lt;seam:instance/&gt;</literal> を使用することなく他の Spring Bean にインジェクト可能です。 ただし、 スコープインピーダンスが必ず維持されるよう十分に注意してください。 Spring で一般的に使用される方法は、 Bean 定義内での <literal>&lt;aop:scoped-proxy/&gt;</literal> の指定です。 しかし、 Seamスコープの Spring Bean は <literal>&lt;aop:scoped-proxy/&gt;</literal> との<emphasis>互換性がありません</emphasis>。 したがって、 単一の Bean に Seam スコープ Spring Beanをインジェクトする必要がある場合、 <literal>&lt;seam:instance/&gt;</literal>を使用しなければなりません。

source: Using Spring PlatformTransactionManagement
it_it: Uso di Spring PlatformTransactionManagement
ja_jp: Spring の PlatformTransactionManagement を使用する

source: Spring provides an extensible transaction management abstraction with support for many transaction APIs (JPA, Hibernate, JDO, and JTA) Spring also provides tight integrations with many application server TransactionManagers such as Websphere and Weblogic. Spring transaction management exposes support for many advanced features such as nested transactions and supports full Java EE transaction propagation rules like REQUIRES_NEW and NOT_SUPPORTED. For more information see the spring documentation <ulink url="http://static.springframework.org/spring/docs/2.0.x/reference/transaction.html">here</ulink>.
it_it: Spring fornisce un'astrazione estensibile della gestione delle transazioni con supporto a molte API per le transazioni (JPA, Hibernate, JDO e JTA). Spring fornisce anche una stretta integrazione con molti TransactionManagers degli application server quali Websphere e Weblogic. La gestione delle transazioni di Spring espone il supporto a funzionalità avanzate quali transazioni innestate e supporto alle regole di propagazione delle transazioni Java EE come REQUIRES_NEW e NOT_SUPPORTED. Per maggiori informazioni guardare <ulink url="http://static.springframework.org/spring/docs/2.0.x/reference/transaction.html">here</ulink>.
ja_jp: Spring は拡張可能なトランザクション管理抽象を提供し、 多くのトランザクション API (JPA、 Hibernate、 JDO、 JTA など) に対応します。 また、 Spring は Websphere や Weblogic などの多くのアプリケーションサーバーの TransactionManagers との堅固な統合を実現します。 Spring トランザクション管理はネストされるトランザクションなど多くの高度な機能のサポートを提供し、 REQUIRES_NEW や NOT_SUPPORTED のような完全 Java EE トランザクション伝播のルールに対応します。 詳細については Spring のドキュメント <ulink url="http://static.springframework.org/spring/docs/2.0.x/reference/transaction.html">ここ</ulink> を参照してください。

source: To configure Seam to use Spring transactions enable the SpringTransaction component like so:
it_it: Per configurare Seam ad usare le transazioni di Spring abilitare il componente SpringTransaction in queso modo:
ja_jp: Seam が Spring のトランザクションを使用するよう設定するには、 SpringTransaction コンポーネントを以下のように有効にします。

source: The <literal>spring:spring-transaction</literal> component will utilize Springs transaction synchronization capabilities for synchronization callbacks.
it_it: Il componente <literal>spring:spring-transaction</literal> utilizzerà le capacità di sincronizzazione delle transazioni di Spring per le callback di sincronizzazione.
ja_jp: <literal>spring:spring-transaction</literal> コンポーネントは同期のコールバックに Spring トランザクション同期の機能を利用します。

source: Using a Seam Managed Persistence Context in Spring
it_it: Uso del contesto di persistenza gestito da Seam in Spring
ja_jp: Spring で Seam 管理の永続コンテキストを使用する
