Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Spring.po
Languages: it_it, ja_jp

source: One of the most powerful features of Seam is its conversation scope and the ability to have an EntityManager open for the life of a conversation. This eliminates many of the problems associated with the detachment and re-attachment of entities as well as mitigates occurrences of the dreaded <literal>LazyInitializationException</literal>. Spring does not provide a way to manage an persistence context beyond the scope of a single web request (<literal>OpenEntityManagerInViewFilter</literal>). So, it would be nice if Spring developers could have access to a Seam managed persistence context using all of the same tools Spring provides for integration with JPA(e.g. <literal>PersistenceAnnotationBeanPostProcessor</literal>, <literal>JpaTemplate</literal>, etc.)
it_it: Una delle caratteristiche più potenti di Seam è lo scope conversazione e la possibilità di avere un EntityManager aperto per l'intera vita di una conversazione. Questo elimina i problemi associati al detach e re-attach degli entity così come vengono mitigate le apparizioni della temuta <literal>LazyInitializationException</literal>. Spring non fornisce un modo per gestire un contesto di persistenza oltre lo scope di una singola richiesta web (<literal>OpenEntityManagerInViewFilter</literal>). Quindi sarebbe bello se gli sviluppatori di Spring potessero avere accesso al contesto di persistenza gestito da Seam usando tutti gli stessi tool che Spring fornisce per l'integrazione con JPA (es. <literal>PersistenceAnnotationBeanPostProcessor</literal>, <literal>JpaTemplate</literal>, ecc.)
ja_jp: Seam のパワフルな機能のひとつにその対話スコープと対話が生きている間 EntityManager をオープンにしておく機能があります。 これによりエンティティの分離や再併合に関連する多くの問題が解消され、 深刻な <literal>LazyInitializationException</literal> の発生を軽減することができます。 Spring は Web の一要求のスコープを越えて永続コンテキストを管理する方法は提供していません (<literal>OpenEntityManagerInViewFilter</literal>)。 このため、 Spring が JPA との統合に提供しているのとすべて同じツールを使った Seam 管理の永続コンテキストへのアクセスを Spring 開発者に持たせることができるとよいでしょう (<literal>PersistenceAnnotationBeanPostProcessor</literal>、 <literal>JpaTemplate</literal> など)。

source: Seam provides a way for Spring to access a Seam managed persistence context with Spring's provided JPA tools bringing conversation scoped persistence context capabilities to Spring applications.
it_it: Seam fornisce un modo per far accedere Spring ad un contesto di persistenza gestito da Seam con i tool JPA forniti da Spring che portano nelle applicazioni Seam le capacità del contesto di persistenza con scope conversazione.
ja_jp: Seam は提供される JPA ツールを使って Spring が Seam 管理永続コンテキストにアクセスする方法を提供します。 これにより Spring アプリケーションに対して対話スコープの永続コンテキスト機能を実現します。

source: This integration work provides the following functionality:
it_it: Questo lavoro di integrazione fornisce la seguente funzionalità:
ja_jp: この統合作業により次のような機能を実現します。

source: transparent access to a Seam managed persistence context using Spring provided tools
it_it: accesso trasparente al contesto di persistenza gestito da Seam usando i tool forniti da Spring
ja_jp: Spring 提供ツールを使った Seam 管理永続コンテキストへの透過的なアクセス

source: access to Seam conversation scoped persistence contexts in a non web request (e.g. asynchronous quartz job)
it_it: accesso ai contesti di persistenza con scope conversazione di Seam in una richiesta non web (es. job asincrono di quartz)
ja_jp: Web 要求以外での Seam 対話スコープ永続コンテキストへのアクセス (非同期の quartz ジョブなど)

source: allows for using Seam managed persistence contexts with Spring managed transactions (will need to flush the persistence context manually)
it_it: consente l'uso dei contesti di persistenza gestiti da Seam con le transazioni gestite da Spring (occorrerà eseguire manualmente il flush del contesto di persistenza)
ja_jp: Seam 管理永続コンテキストと Spring 管理トランザクションとの併用が可能 (手作業による永続コンテキストのフラッシュが必要)

source: Spring's persistence context propagation model allows only one open EntityManager per EntityManagerFactory so the Seam integration works by wrapping an EntityManagerFactory around a Seam managed persistence context.
it_it: Il modello di propagazione del contesto di persistenza di Spring consente solo un EntityManager aperto per EntityManagerFactory, quindi l'integrazione con Seam funziona facendo il wrapping dell'EntityManagerFactory attorno al contesto di persistenza gestito da Seam.
ja_jp: Spring の永続コンテキスト伝播モデルは EntityManagerFactory ごと一つの EntityManager しかオープンにしないため、 Seam 統合は EntityManagerFactory を Seam 管理永続コンテキストでラップすることで動作します。

source: Where 'persistenceContextName' is the name of the Seam managed persistence context component. By default this EntityManagerFactory has a unitName equal to the Seam component name or in this case 'entityManager'. If you wish to provide a different unitName you can do so by providing a persistenceUnitName like so:
it_it: dove 'persistenceContextName' è il nome del componente con contesto di persistenza gestito da Seam. Di default questo EntityManagerFactory ha un unitName uguale al nome del componente Seam o in questo caso 'entityManager'. Se si vuole fornire un unitName diverso, si può fornire un persistenceUnitName così:
ja_jp: 「persistenceContextName」は Seam 管理の永続コンテキストコンポーネントの名前になります。 デフォルトではこの EntityManagerFactory には Seam コンポーネント名と同等の unitName があり、 この場合は「entityManager」になります。 別の unitName を与えたい場合は次のようにして persistenceUnitName を与えることができます。

source: This EntityManagerFactory can then be used in any Spring provided tools. For example, using Spring's <literal>PersistenceAnnotationBeanPostProcessor</literal> is the exact same as before.
it_it: EntityManagerFactory può essere usata in un qualsiasi tool fornito da Spring. Per esempio, l'uso di <literal>PersistenceAnnotationBeanPostProcessor</literal> di Spring è lo stesso di prima.
ja_jp: これでこの EntityManagerFactory をいずれの Spring 提供のツールでも使用することができるようになります。 たとえば、 Spring の <literal>PersistenceAnnotationBeanPostProcessor</literal> を使用すると前とまったく同じになります。

source: If you define your real EntityManagerFactory in Spring but wish to use a Seam managed persistence context you can tell the <literal>PersistenceAnnotationBeanPostProcessor</literal> which persistenctUnitName you wish to use by default by specifying the <literal>defaultPersistenceUnitName</literal> property.
it_it: Se si definisce in Spring un EntityManagerFactory ma si vuole usare un contesto di persistenza gestito da Seam, si può dire al <literal>PersistenceAnnotationBeanPostProcessor</literal> quale persistenctUnitName si desidera usare come default specificando la proprietà <literal>defaultPersistenceUnitName</literal>.
ja_jp: Spring では実際の EntityManagerFactory を定義するが Seam 管理の永続コンテキストを使用したい場合は <literal>defaultPersistenceUnitName</literal> プロパティを指定してデフォルトで使用したい persistenctUnitName を <literal>PersistenceAnnotationBeanPostProcessor</literal> に指示することができます。

source: The <literal>applicationContext.xml</literal> might look like:
it_it: <literal>applicationContext.xml</literal> potrebbe apparire come:
ja_jp: <literal>applicationContext.xml</literal> は次に似たようなものになります。

source: The <literal>component.xml</literal> might look like:
it_it: <literal>component.xml</literal> potrebbe così apparire:
ja_jp: <literal>component.xml</literal> は次に似たようなものになります。

source: <literal>JpaTemplate</literal> and <literal>JpaDaoSupport</literal> are configured the same way for a Seam managed persistence context as they would be fore a Seam managed persistence context.
it_it: <literal>JpaTemplate</literal> e <literal>JpaDaoSupport</literal> sono configurati allo stesso modo per un contesto di persistenza gestito da Seam.
ja_jp: <literal>JpaTemplate</literal> および <literal>JpaDaoSupport</literal> は Seam 管理永続コンテキスト用となるため、 Seam 管理永続コンテキストに対して同じ方法で設定します。

source: Using a Seam Managed Hibernate Session in Spring
it_it: Uso di una sessione Hibernate gestita da Seam in Spring
ja_jp: Spring で Seam 管理の Hibernate セッションを使用する

source: The Seam Spring integration also provides support for complete access to a Seam managed Hibernate session using spring's tools. This integration is very similar to the <link linkend="spring-persistence">JPA integration</link>.
it_it: L'integrazione di Spring con Seam fornisce anche il supporto al completo accesso alla sessione Hibernate gestita da Seam usando i tool di Spring. Quest'integrazione è molto simile all'<link linkend="spring-persistence">integrazione JPA</link>.
ja_jp: Seam Spring 統合により Spring のツールを使った Seam 管理 Hibernate セッションへの完全アクセスに対応することもできます。 この統合は <link linkend="spring-persistence">JPA 統合</link> に非常に似ています。

source: Like Spring's JPA integration spring's propagation model allows only one open EntityManager per EntityManagerFactory per transaction??? to be available to spring tools. So, the Seam Session integration works by wrapping a proxy SessionFactory around a Seam managed Hibernate session context.
it_it: Come per l'integrazione JPA di Spring, il modello di propagazione di Spring consente di avere aperto solo un EntityManager per EntityManagerFactory per transazione disponibile ai tool di Spring. Quindi , l'integrazione della Sessione di Seam funziona solo con il wrap di un proxy SessionFactory attorno al contesto sessione di Hibernate gestito da Seam.
ja_jp: Spring の JPA 統合と同様に Spring の伝播モデルは一トランザクションの一EntityManagerFactory ごとに一つの EntityManager しか Spring ツールに対して利用できるようオープンにしません。 このため、 Seam Session 統合は proxy SessionFactory を Seam 管理の Hibernate セッションコンテキストでラップすることにより動作します。

source: Where 'sessionName' is the name of the <literal>persistence:managed-hibernate-session</literal> component. This SessionFactory can then be used in any Spring provided tools. The integration also provides support for calls to <literal>SessionFactory.getCurrentInstance()</literal> as long as you call getCurrentInstance() on the <literal>SeamManagedSessionFactory</literal>.
it_it: dove 'sessionName' è il nome del componente <literal>persistence:managed-hibernate-session</literal>. Questo SessionFactory può essere allora usato in un qualsiasi tool fornito da Spring. L'integrazione fornisce anche supporto alle chiamare a <literal>SessionFactory.getCurrentInstance()</literal> finché si chiama getCurrentInstance() su <literal>SeamManagedSessionFactory</literal>.
ja_jp: 「sessionName」は <literal>persistence:managed-hibernate-session</literal> コンポーネントの名前になります。 これでこの SessionFactory はいずれの Spring 提供ツールでも使用することができるようになります。 この統合は <literal>SeamManagedSessionFactory</literal> で getCurrentInstance() を呼び出している場合であれば <literal>SessionFactory.getCurrentInstance()</literal> に対する呼び出しにも対応します。

source: Spring Application Context as a Seam Component
it_it: Contesto Applicazione di Spring come componente Seam
ja_jp: Seam コンポーネントとしての Spring Application Context

source: Although it is possible to use the Spring <literal>ContextLoaderListener</literal> to start your application's Spring ApplicationContext there are a couple of limitations.
it_it: Sebbene sia possibile usare il <literal>ContextLoaderListener</literal> di Spring per avviare l'ApplicationContext di Spring della propria applicazione, ci sono un paio di limitazioni.
ja_jp: アプリケーションの持つ Spring の ApplicationContext を起動するために Spring の <literal>ContextLoaderListener</literal> を使用することはできますが、 制約がいくつかあります。

source: the Spring ApplicationContext must be started <emphasis>after</emphasis> the <literal>SeamListener</literal>
it_it: L'ApplicationContext di Spring deve essere avviato <emphasis>dopo</emphasis> <literal>SeamListener</literal>
ja_jp: Spring ApplicationContext は、 <literal>SeamListener</literal>の<emphasis>後に</emphasis>起動されなければなりません。

source: it can be tricky starting a Spring ApplicationContext for use in Seam unit and integration tests
it_it: può essere insidioso avviare un ApplicationContext di Spring da usarsi nei test d'unità e di integrazionedi Seam
ja_jp: Seam ユニットおよび統合テストでの使用を目的とした Spring ApplicationContext の起動は厄介なことがあります。

source: To overcome these two limitations the Spring integration includes a Seam component that will start a Spring ApplicationContext. To use this Seam component place the <literal>&lt;spring:context-loader/&gt;</literal> definition in the <literal>components.xml</literal>. Specify your Spring context file location in the <literal>config-locations</literal> attribute. If more than one config file is needed you can place them in the nested <literal>&lt;spring:config-locations/&gt;</literal> element following standard <literal>components.xml</literal> multi value practices.
it_it: Per superare queste due limitazioni, l'integrazione di Spring include un componente di Seam che avvia un ApplicationContext di Spring. Per usare questo componente di Seam si collochi la definizione <literal>&lt;spring:context-loader/&gt;</literal> in <literal>components.xml</literal>. Si specifichi la posizione del file col contesto di Spring nell'attributo <literal>config-locations</literal>. Se sono presenti più di un file si possono posizionare nell'elemento <literal>&lt;spring:config-locations/&gt;</literal> seguendo le practice multi-value di <literal>components.xml</literal>.
ja_jp: これら 2 つの制約を克服するために Spring 統合には Spring ApplicationContext を起動する Seam コンポーネントが含まれています。 この Seam コンポーネントを使用するには、 <literal>&lt;spring:context-loader/&gt;</literal> の定義を <literal>components.xml</literal> に配置します。 <literal>config-locations</literal> 属性で使用する Spring コンテキストファイルの場所を指定します。 複数の設定ファイルが必要な場合は、 ネストされる <literal>&lt;spring:config-locations/&gt;</literal> エレメントに配置することができます。 これを行うには、 <literal>components.xml</literal> ファイルに複数の値エレメントを追加する基準に従ってください。

source: Using a Spring TaskExecutor for @Asynchronous
it_it: Uso di TaskExecutor di Spring per @Asynchronous
ja_jp: @Asynchronous に Spring の TaskExecutor を使用する

source: Spring provides an abstraction for executing code asynchronously called a <literal>TaskExecutor</literal>. The Spring Seam integration allows for the use of a Spring <literal>TaskExecutor</literal> for executing immediate <literal>@Asynchronous</literal> method calls. To enable this functionality install the <literal>SpringTaskExecutorDispatchor</literal> and provide a spring bean defined taskExecutor like so:
it_it: Spring fornisce un'astrazione per eseguire codice in modo asincrono chiamata <literal>TaskExecutor</literal>. L'integrazione con Seam consente di usare un <literal>TaskExecutor</literal> di Spring per eseguire chiamate immediate di metodi <literal>@Asynchronous</literal>. Per abilitare questa funzionalità si installi <literal>SpringTaskExecutorDispatchor</literal> e si fornisca un bean di Spring definito taskExecutor in questo modo:
ja_jp: Spring はコードを非同期に実行するために <literal>TaskExecutor</literal> と呼ばれる抽象を提供します。 Spring Seam 統合では <literal>@Asynchronous</literal> メソッドのコールを直ちに実行するために Spring の <literal>TaskExecutor</literal> を使用できます。 この機能を有効にするには <literal>SpringTaskExecutorDispatchor</literal> をインストールしてから次のように Spring Bean 定義の taskExecutor を与えます。

source: Because a Spring <literal>TaskExecutor</literal> does not support scheduling of an asynchronous event a fallback Seam <literal>Dispatcher</literal> can be provided to handle scheduled asynchronous event like so:
it_it: Poiché un <literal>TaskExecutor</literal> di Spring non supporta lo scheduling di eventi asincroni, può essere fornito un <literal>Dispatcher</literal> di Seam per gestire gli eventi asincroni schedulati in questo modo:
ja_jp: Spring の <literal>TaskExecutor</literal> は非同期イベントのスケジューリングには対応しないため、 代替となる Seam <literal>Dispatcher</literal> を与えて次のようにスケジュールされた非同期イベントを処理することができます。
