Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Text.po
Languages: it_it

source: Collaboration-oriented websites require a human-friendly markup language for easy entry of formatted text in forum posts, wiki pages, blogs, comments, etc. Seam provides the <literal>&lt;s:formattedText/&gt;</literal> control for display of formatted text that conforms to the <emphasis>Seam Text</emphasis> language. Seam Text is implemented using an ANTLR-based parser. You don't need to know anything about ANTLR to use it, however.
it_it: I siti web orientati alla collaborazione tra utenti richiedono un linguaggio per marcare in modo comprensibile il testo formattato da inserire nei post di un forum, nelle pagine wiki, nei commenti, ecc. Seam fornisce il controllo <literal>&lt;s:formattedText/&gt;</literal> per mostrare il testo formattato in modo conforme con il linguaggio <emphasis>Seam Text</emphasis>. Seam Text è realizzato utilizzando un interprete basato su ANTLR. Comunque non c'è bisogno di sapere niente di ANTLR per utilizzarlo.

source: Basic fomatting
it_it: Formattazione di base

source: Here is a simple example:
it_it: Ecco un semplice esempio:

source: <![CDATA[It's easy to make *emphasis*, |monospace|, ~deleted text~, super^scripts^ or _underlines_.]]>
it_it: <![CDATA[E' semplice rendere il testo *evidenziato*, |a spaziatura fissa|, ~cancellato~, sovra^scritto^ o _sottolineato_.]]>

source: If we display this using <literal>&lt;s:formattedText/&gt;</literal>, we will get the following HTML produced:
it_it: Se mostriamo questo testo usando <literal>&lt;s:formattedText/&gt;</literal>, otteniamo il seguente codice HTML:

source: <![CDATA[<p> It's easy to make <i>emphasis</i>, <tt>monospace</tt> <del>deleted text</del>, super<sup>scripts</sup> or <u>underlines</u>. </p>]]>
it_it: <![CDATA[E' semplice rendere il testo *evidenziato*, |a spaziatura fissa|, ~cancellato~, sovra^scritto^ o _sottolineato_.]]>

source: We can use a blank line to indicate a new paragraph, and <literal>+</literal> to indicate a heading:
it_it: E' possibile usare una riga vuota per indicare un nuovo paragrafo e un <literal>+</literal> per indicare un titolo:

source: <![CDATA[+This is a big heading You /must/ have some text following a heading! ++This is a smaller heading This is the first paragraph. We can split it across multiple lines, but we must end it with a blank line. This is the second paragraph.]]>
it_it: <![CDATA[+Questo è un grande titolo /Dovrai/ avere del testo dopo il titolo! ++Questo è un titolo più piccolo Questo è il primo paragrafo. Lo possiamo dividere in più righe, ma per terminarlo serve una riga vuota. Questo è il secondo paragrafo.]]>

source: (Note that a simple newline is ignored, you need an additional blank line to wrap text into a new paragraph.) This is the HTML that results:
it_it: (Notare che un semplice a-capo viene ignorato, è necessaria una riga vuota per avere il testo in un nuovo paragrafo). Questo è il codice HTML risultante:

source: <![CDATA[<h1>This is a big heading</h1> <p> You <i>must</i> have some text following a heading! </p> <h2>This is a smaller heading</h2> <p> This is the first paragraph. We can split it across multiple lines, but we must end it with a blank line. </p> <p> This is the second paragraph. </p>]]>
it_it: <![CDATA[<h1>Questo è un grande titolo</h1> <p> <i>Dovrai</i> avere del testo dopo il titolo! </p> <h2>Questo è un titolo più piccolo</h2> <p> Questo è il primo paragrafo. Lo possiamo dividere in più righe, ma per terminarlo serve una riga vuota. </p> <p> Questo è il secondo paragrafo. </p>]]>

source: Ordered lists are created using the <literal>#</literal> character. Unordered lists use the <literal>=</literal> character:
it_it: Le liste ordinate sono generate dal carattere <literal>#</literal>. Le liste non ordinate dal carattere <literal>=</literal>:

source: <![CDATA[An ordered list: #first item #second item #and even the /third/ item An unordered list: =an item =another item]]>
it_it: <![CDATA[Una lista ordinata: #prima voce #seconda voce #e anche la /terza/ voce Una lista non ordinata: =una voce =un'altra voce]]>

source: <![CDATA[<p> An ordered list: </p> <ol> <li>first item</li> <li>second item</li> <li>and even the <i>third</i> item</li> </ol> <p> An unordered list: </p> <ul> <li>an item</li> <li>another item</li> </ul>]]>
it_it: <![CDATA[<p> Una lista ordinata: </p> <ol> <li>prima voce</li> <li>seconda voce</li> <li>e anche una <i>terza</i> voce</li> </ol> <p> Una lista non ordinata: </p> <ul> <li>una voce</li> <li>un'altra voce</li> </ul>]]>

source: Quoted sections should be surrounded in double quotes:
it_it: I brani con citazioni devono essere racchiusi tra virgolette:

source: <![CDATA[The other guy said: "Nyeah nyeah-nee /nyeah/ nyeah!" But what do you think he means by "nyeah-nee"?]]>
it_it: <![CDATA[L'altro ragazzo disse: "Nyeah nyeah-nee /nyeah/ nyeah!" Ma cosa pensi abbia voluto dire con "nyeah-nee"?]]>

source: <![CDATA[<p> The other guy said: </p> <q>Nyeah nyeah-nee <i>nyeah</i> nyeah!</q> <p> But what do you think he means by <q>nyeah-nee</q>? </p>]]>
it_it: <![CDATA[<p> L'altro ragazzo disse: </p> <q>Nyeah nyeah-nee <i>nyeah</i> nyeah!</q> <p> Ma cosa pensi abbia voluto dire con <q>nyeah-nee</q>? </p>]]>

source: Entering code and text with special characters
it_it: Inserire codice e testo con caratteri speciali

source: Special characters such as <literal>*</literal>, <literal>|</literal> and <literal>#</literal>, along with HTML characters such as <literal>&lt;</literal>, <literal>&gt;</literal> and <literal>&amp;</literal> may be escaped using <literal>\</literal>:
it_it: Caratteri speciali come <literal>*</literal>, <literal>|</literal> e <literal>#</literal>, e anche i caratteri HTML come <literal>&lt;</literal>, <literal>&gt;</literal> e <literal>&amp;</literal> possono essere inseriti usando il carattere di escape<literal>\</literal>:

source: <![CDATA[You can write down equations like 2\*3\=6 and HTML tags like \<body\> using the escape character: \\.]]>
it_it: <![CDATA[E' possibile scrivere equazioni come 2\*3\=6 e tag HTML come \<body\> usando il carattere di escape: \\.]]>

source: <![CDATA[<p> You can write down equations like 2*3=6 and HTML tags like &lt;body&gt; using the escape character: \. </p>]]>
it_it: <![CDATA[<p> E' possibile scrivere equazioni come 2*3=6 e tag HTML come &lt;body&gt; usando il carattere di escape: \. </p>]]>

source: And we can quote code blocks using backticks:
it_it: Ed è possibile citare blocchi di codice usando l'apice inverso (purtroppo l'apice inverso non c'è nella tastiera italiana, ndt):

source: <![CDATA[My code doesn't work: `for (int i=0; i<100; i--) { doSomething(); }` Any ideas?]]>
it_it: <![CDATA[Il mio codice non funziona: `for (int i=0; i<100; i--) { doSomething(); }` Qualche idea?]]>

source: <![CDATA[<p> My code doesn't work: </p> <pre>for (int i=0; i&lt;100; i--) { doSomething(); }</pre> <p> Any ideas? </p>]]>
it_it: <![CDATA[<p> Il mio codice non funziona: </p> <pre>for (int i=0; i&lt;100; i--) { doSomething(); }</pre> <p> Qualche idea? </p>]]>

source: Note that inline monospace formatting always escapes (most monospace formatted text is in fact code or tags with many special characters). So you can, for example, write:
it_it: Notare che la formattazione in linea a spaziatura fissa considera sempre i caratteri speciali (la maggior parte del testo formattato a spaziatura fissa in effetti è codice o tag con molti caratteri speciali). Così, ad esempio, è possibile scrivere:

source: <![CDATA[This is a |<tag attribute="value"/>| example.]]>
it_it: <![CDATA[Questo è un |<tag attribute="value"/>| esempio.]]>

source: without escaping any of the characters inside the monospace bars. The downside is that you can't format inline monospace text in any other way (italics, underscore, and so on).
it_it: senza bisogno di usare il carattere di escape per i caratteri all'interno del brano formattato a spaziatura fissa. Lo svantaggio è che non è possibile formattare il testo in linea a spaziatura fissa in altri modi (corsivo, sottolineato, e così via).

source: Links
it_it: Link

source: A link may be created using the following syntax:
it_it: Un link può essere creato utilizzando la seguente sintassi:

source: <![CDATA[Go to the Seam website at [=>http://jboss.com/products/seam].]]>
it_it: <![CDATA[Vai al sito web di Seam [=>http://jboss.com/products/seam].]]>

source: Or, if you want to specify the text of the link:
it_it: Oppure, se si vuole specificare il testo del link:

source: <![CDATA[Go to [the Seam website=>http://jboss.com/products/seam].]]>
it_it: <![CDATA[Vai al [sito web di Seam=>http://jboss.com/products/seam].]]>

source: For advanced users, it is even possible to customize the Seam Text parser to understand wikiword links written using this syntax.
it_it: Per gli utenti esperti è possibile anche personalizzare l'interprete Seam Text in modo da comprendere i link in formato wiki scritti usando questa sintassi.

source: Entering HTML
it_it: Inserire codice HTML

source: Text may even include a certain limited subset of HTML (don't worry, the subset is chosen to be safe from cross-site scripting attacks). This is useful for creating links:
it_it: Il testo può anche includere un certo sottoinsieme limitato di HTML (non c'è da preoccuparsi, il sottoinsieme è stato scelto in modo da essere sicuro rispetto alla possibilità di attacchi di tipo cross-site scripting). Questo è utile per creare dei link:

source: <![CDATA[You might want to link to <a href="http://jboss.com/products/seam">something cool</a>, or even include an image: <img src="/logo.jpg"/>]]>
it_it: <![CDATA[Potresti voler fare un link a <a href="http://jboss.com/products/seam">qualcosa di forte</a>, oppure includere un'immagine: <img src="/logo.jpg"/>]]>

source: And for creating tables:
it_it: E per creare delle tabelle:

source: <![CDATA[<table> <tr><td>First name:</td><td>Gavin</td></tr> <tr><td>Last name:</td><td>King</td></tr> </table>]]>
it_it: <![CDATA[<table> <tr><td>Nome:</td><td>Gavin</td></tr> <tr><td>Cognome:</td><td>King</td></tr> </table>]]>

source: But you can do much more if you want!
it_it: Ma è possibile fare molto di più, volendo!

source: Using the SeamTextParser
it_it: Utilizzo di SeamTextParser

source: The <literal>&lt;s:formattedText/&gt;</literal> JSF component internally uses the <literal>org.jboss.seam.text.SeamTextParser</literal>. You can use that class directly and implement your own text parsing, rendering, or HTML sanitation procedure. This is especially useful if you have a custom frontend for entering rich text, such as a Javascript-based HTML editor, and you want to validate user input to protect your website against Cross-Site Scripting (XSS) attacks. Another usecase are custom wiki text parsing and rendering engines.
it_it: Il componente JSF <literal>&lt;s:formattedText/&gt;</literal> utilizza internamente <literal>org.jboss.seam.text.SeamTextParser</literal>. Si può usare direttamente questa classe ed implementare la propria procedura di parsing del testo, rendering o sanitizzazione HTML. Questo è utile se si hanno frontend personalizzati per l'inserimento di testo, quali editor HTML basati su javascript, e se si vuole validare l'input utente per proteggere il sito web da attacchi Cross-Site Scripting (XSS). Un altro caso d'uso sono i motori di parsing e rendering per il testo wiki.

source: The following example defines a custom text parser that overrides the default HTML sanitizer:
it_it: Il seguente esempio definisce un parser di testo personalizzato che sovrascrive il sanitizer HTML di default:

source: The <literal>linkTag()</literal> and <literal>paragraphOpenTag()</literal> methods are just some of many you can override to customize rendered output. These methods generally return <literal>String</literal>. See the Javadoc for more details.
it_it: I metodi <literal>linkTag()</literal> e <literal>paragraphOpenTag()</literal> sono solo alcuni modi in cui si può sovrascrivere l'output renderizzato. Questi metodi restituiscono generalmente <literal>String</literal>. Si veda la documentazione Javadoc per ulteriori informazioni.

source: Also consult the Javadoc of <literal>org.jboss.seam.text.SeamTextParser.DefaultSanitizer</literal> for more information on what HTML elements, attributes, and attribute values or filtered by default.
it_it: Inoltre si consulti Javadoc riguardo <literal>org.jboss.seam.text.SeamTextParser.DefaultSanitizer</literal> per maggiori informazioni su quali elementi HTML, attributi e valori di attributi vengano filtrati di default.
