Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Tutorial.po
Languages: it_it, ja_jp

source: The <literal>&lt;task-node&gt;</literal> node represents a <emphasis>wait state</emphasis>, where business process execution pauses, waiting for one or more tasks to be performed.
it_it: Il nodo <literal>&lt;task-node&gt;</literal> rappresenta uno <emphasis>stato di attesa</emphasis>, dove l'esecuzione del processo di business va in pausa, ed aspetta che uno o più task vengano eseguiti.
ja_jp: <literal>&lt;task-node&gt;</literal> ノードは、<emphasis>待ち状態</emphasis> を表します。 ビジネスプロセスの実行が一時停止され、一つまたは複数のタスクが行われるのを待機します。

source: The <literal>&lt;task&gt;</literal> element defines a task to be performed by a user. Since there is only one task defined on this node, when it is complete, execution resumes, and we transition to the end state. The task gets its description from a Seam component named <literal>todoList</literal> (one of the JavaBeans).
it_it: L'elemento <literal>&lt;task&gt;</literal> definisce un task che deve essere eseguito da un utente. Poiché c'è solo un task definito su questo nodo, quando completa, l'esecuzione riprende e si transita verso lo stato finale. Il task recupera la sua descrizione da un componente Seam chiamato <literal>todoList</literal> (uno dei JavaBean).
ja_jp: <literal>&lt;task&gt;</literal> 要素は、ユーザーによって実行されるタスクを定義します。 このノードには一つのタスクしか定義されていないので、 それが完了すると実行が再開され、 終了状態に遷移していきます。 このタスクは、 <literal>todoList</literal> という名前の Seam コンポーネント (JavaBean の 一種) から description を取得します。

source: Tasks need to be assigned to a user or group of users when they are created. In this case, the task is assigned to the current user, which we get from a built-in Seam component named <literal>actor</literal>. Any Seam component may be used to perform task assignment.
it_it: I task devono essere assegnati ad un utente od un gruppo di utenti quando vengono creati. In questo caso il task viene assegnato all'utente corrente che viene recuperato dal componente Seam predefinito chiamato <literal>actor</literal>. Ogni componente Seam può essere impiegato per assegnare un task.
ja_jp: タスクを生成するとき、タスクはユーザーあるいはユーザーグループに割り当てる必要があります。 このサンプルでは、タスクは、現在のユーザーに割り当てられています。 現在のユーザーは <literal>actor</literal> という名前の組み込み Seam コンポーネントから取得します。 どのような Seam コンポーネントもタスク割り当てを実行するために使用される可能性があります。

source: The <literal>&lt;end-state&gt;</literal> node defines the logical end of the business process. When execution reaches this node, the process instance is destroyed.
it_it: Il nodo <literal>&lt;end-state&gt;</literal> definisce la fine logica del processo di business. Quando l'esecuzione raggiunge questo nodo, l'istanza di processo viene distrutta.
ja_jp: <literal>&lt;end-state&gt;</literal>ノードは、ビジネスプロセスの論理的な終了を定義します。 実行がこのノードに到達したとき、 プロセスインスタンスは、破棄されます。

source: If we view this process definition using the process definition editor provided by JBossIDE, this is what it looks like:
it_it: Se viene impiegato l'editor per le definizioni di processo fornito da JBossIDE, questa apparirà così:
ja_jp: JBossIDE に提供されたプロセス定義エディタを使用してプロセス定義を見た場合、 以下のようになります。

source: This document defines our <emphasis>business process</emphasis> as a graph of nodes. This is the most trivial possible business process: there is one <emphasis>task</emphasis> to be performed, and when that task is complete, the business process ends.
it_it: Questo documento definisce il <emphasis>processo di business</emphasis> come un grafo di nodi. Questo è un processo di business molto banale: c'è un <emphasis>task</emphasis> da eseguire e quando questo viene completato, il processo termina.
ja_jp: このドキュメントは、ノードのグラフとして <emphasis>ビジネスプロセス</emphasis> を定義します。 これは現実にあり得る最小のビジネスプロセスです。実行されなければならない <emphasis>タスク</emphasis> は、一つだけです。 タスクが完了したとき ビジネスプロセスは終了します。

source: The first JavaBean handles the login screen <literal>login.jsp</literal>. Its job is just to initialize the jBPM actor id using the <literal>actor</literal> component. In a real application, it would also need to authenticate the user.
it_it: Il primo javaBean gestisce la pagina <literal>login.jsp</literal>. Il suo compito è quello di inizializzare l'id actor jBPM usando il componente <literal>actor</literal>. Nelle applicazioni occorrerà autenticare l'utente.
ja_jp: 最初の JavaBean はログイン画面 <literal>login.jsp</literal> を処理します。 処理は単に <literal>actor</literal> コンポーネントを使用して jBPM actor id を初期化するだけです。 実際のアプリケーションではユーザー認証も必要です。

source: Here we see the use of <literal>@In</literal> to inject the built-in <literal>Actor</literal> component.
it_it: Qua si vede l'uso di <literal>@In</literal> per iniettare il componente predefinito <literal>Actor</literal>.
ja_jp: ここでは、組み込み <literal>Actor</literal> コンポーネントをインジェクトするために、 <literal>@In</literal> を使用しているのがわかります。

source: The JSP itself is trivial:
it_it: Lo stesso JSP è banale:
ja_jp: 次の JSP 自体は重要ではありません。

source: The second JavaBean is responsible for starting business process instances, and ending tasks.
it_it: Il secondo JavaBean è responsabile per l'avvio delle istanze del processo di business e della fine dei task.
ja_jp: 二つめの JavaBean は、ビジネスプロセスインスタンスの開始とタスクの終了を担当します。

source: The description property accepts user input from the JSP page, and exposes it to the process definition, allowing the task description to be set.
it_it: La proprietà descrizione accetta l'input utente dalla pagina JSP e lo espone alla definizione del processo, consentendo che venga impostata la descrizione del task.

source: The Seam <literal>@CreateProcess</literal> annotation creates a new jBPM process instance for the named process definition.
it_it: L'annotazione Seam <literal>@CreateProcess</literal> crea una nuova istanza di processo jBPM dalla definizione del processo.
ja_jp: Seam <literal>@CreateProcess</literal> アノテーションは、名前付きプロセス定義のために jBPM プロセスインスタンスを生成します。

source: The Seam <literal>@StartTask</literal> annotation starts work on a task. The <literal>@EndTask</literal> ends the task, and allows the business process execution to resume.
it_it: L'annotazione Seam <literal>@StartTask</literal> avvia un task. <literal>@EndTask</literal> termina il task, e consente di ripristinare l'esecuzione del processo di business.
ja_jp: Seam <literal>@StartTask</literal> アノテーションは、タスク上で作業を開始します。 <literal>@EndTask</literal> は、タスクを終了し、ビジネスプロセスの再開を可能にします。

source: In a more realistic example, <literal>@StartTask</literal> and <literal>@EndTask</literal> would not appear on the same method, because there is usually work to be done using the application in order to complete the task.
it_it: In un esempio più realistico <literal>@StartTask</literal> e <literal>@EndTask</literal> non apparirebbero nello stesso metodo, poiché solitamente c'è del lavoro da fare in un'applicazione prima che il task venga terminato.
ja_jp: より現実的なサンプルでは、 <literal>@StartTask</literal> と <literal>@EndTask</literal> は同じメソッドの上には登場しません。 なぜなら、通常、タスクを完了するために、アプリケーションを使用して行われる仕事があるからです。

source: Finally, the core of the application is in <literal>todo.jsp</literal>:
it_it: Infine, il cuore dell'applicazione è in <literal>todo.jsp</literal>:
ja_jp: 最後に、このアプリケーションのポイントは <literal>todo.jsp</literal> にあります。

source: Let's take this one piece at a time.
it_it: Si prenda un pezzo alla volta.
ja_jp: 一つづつ見ていきましょう。

source: The page renders a list of tasks, which it gets from a built-in Seam component named <literal>taskInstanceList</literal>. The list is defined inside a JSF form.
it_it: La pagina renderizza una lista di task prelevati da un componente di Seam chiamato <literal>taskInstanceList</literal>. La lista è definita dentro una form JSF.
ja_jp: ページはタスク一覧をレンダリングしています。 これは、<literal>taskInstanceList</literal> と呼ばれる Seam 組み込みコンポーネントから取得します。 この一覧はJSFフォームの中に定義されています。

source: Each element of the list is an instance of the jBPM class <literal>TaskInstance</literal>. The following code simply displays the interesting properties of each task in the list. For the description, priority and due date, we use input controls, to allow the user to update these values.
it_it: Ciascun elemento della lista è un'istanza della classe jBPM <literal>TaskInstance</literal>. Il codice seguente mostra semplicemente le proprietà di interesse per ogni task della lista. Per consentire all'utente di aggiornare i valori di descrizione, priorità e data di ultimazione, si usano i controlli d'input.
ja_jp: 一覧の各要素は jBPM クラス <literal>TaskInstance</literal> のインスタンスです。 以下のコードは単に、一覧中の各タスクの興味深いプロパティを表示しています。 記述内容 (Description) 、 優先順 (Priority) や、 納期の値 (Due Date) については、 ユーザーがこれらの値を更新できるよう入力コントロールを使用します。

source: Seam provides a default JSF date converter for converting a string to a date (no time). Thus, the converter is not necessary for the field bound to <literal>#{task.dueDate}</literal>.
it_it: Seam fornisce di default un converter JSF di date per convertire una stringa in una data (no tempo). Quindi , il converter non è necessario per un'associazione di campo a <literal>#{task.dueDate}</literal>.

source: This button ends the task by calling the action method annotated <literal>@StartTask @EndTask</literal>. It passes the task id to Seam as a request parameter:
it_it: Questo pulsante termina il task chiamando il metodo d'azione annotato con <literal>@StartTask @EndTask</literal>. Inoltre passa l'id del task come parametro di richiesta a Seam.
ja_jp: このボタンは、 <literal>@StartTask @EndTask</literal> アノテーション付きのアクションメソッドが呼び出されることにより終了します。 それは、task id を要求パラメータとして Seam に渡します。

source: Note that this is using a Seam <literal>&lt;s:button&gt;</literal> JSF control from the <literal>seam-ui.jar</literal> package. This button is used to update the properties of the tasks. When the form is submitted, Seam and jBPM will make any changes to the tasks persistent. There is no need for any action listener method:
it_it: Si noti che questo sta usando un controllo JSF Seam <literal>&lt;s:button&gt;</literal> del pacchetto <literal>seam-ui.jar</literal>. Questo pulsante è usato per aggiornare le proprietà dei task. Quando la form viene aggiornata, Seam e jBPM renderanno persistenti i cambiamenti ai task. Non c'è bisogno di alcun metodo action listener:
ja_jp: これは <literal>seam-ui.jar</literal> パッケージから Seam <literal>&lt;s:button&gt;</literal> JSF コントロールを使用していることに留意してください。 このボタンはタスクのプロパティを更新するために使われます。 フォームがサブミットされるとき、Seam と jBPM はタスク永続に変化も起こします。 アクションリスナーメソッドには何の必要もありません。

source: A second form on the page is used to create new items, by calling the action method annotated <literal>@CreateProcess</literal>.
it_it: Viene usata una seconda form per creare nuovi item, chiamando il metodo d'azione annotato con <literal>@CreateProcess</literal>.
ja_jp: ページの 二つ目のフォームは新しいアイテムを作成するために使用されます。 <literal>@CreateProcess</literal>アノテーション付きアクションメソッドから呼び出されることにより行われます。

source: After logging in, todo.jsp uses the <literal>taskInstanceList</literal> component to display a table of outstanding todo items for a the current user. Initially there are none. It also presents a form to enter a new entry. When the user types the todo item and hits the "Create New Item" button, <literal>#{todoList.createTodo}</literal> is called. This starts the todo process, as defined in <literal>todo.jpdl.xml</literal>.
it_it: Dopo la login, todo.jsp utilizza il componente <literal>taskInstanceList</literal> per mostrare un tabella con i compiti da eseguire da parte dell'utente corrente. Inizialmente non ce ne sono. Viene presentata anche una form per l'inserimento di una nuova voce. Quando l'utente digita il compito da eseguire e preme il pulsante "Create New Item", viene chiamato <literal>#{todoList.createTodo}</literal>. Questo inizia il processo todo, così come definito in <literal>todo.jpdl.xml</literal>.
ja_jp: ログイン後、todo.jsp は現在のユーザーのための未解決の To-Do 項目を表示するために <literal>taskInstanceList</literal> を使用します。最初は何もありません。新しいエントリを登録するフォームが表示されます。ユーザーが todo 項目をタイプし、"Create New Item" ボタンを押下するとき、<literal>#{todoList.createTodo}</literal> は呼ばれます。これは <literal>todo.jpdl.xml</literal> で定義したプロセスを開始します。

source: The process instance is created, starting in the start state and immediately transition to the <literal>todo</literal> state, where a new task is created. The task description is set based on the user's input, which was saved to <literal>#{todoList.description}</literal>. Then, the task is assigned to the current user, which was stored in the seam actor component. Note that in this example, the process has no extra process state. All the state in this example is stored in the task definition. The process and task information is stored in the database at the end of the request.
it_it: L'istanza di processo viene creata a partire dallo stato di start ed immediatamente viene eseguita una transizione allo stato <literal>todo</literal>, dove viene creato un nuovo task. La descrizione del task viene impostata in base all'input dell'utente, che è stato memorizzato in <literal>#{todoList.description}</literal>. Poi il task viene assegnato all'utente corrente, memorizzato nel componente Seam chiamato actor. Si noti che in quest'esempio il processo non ha ulteriori stati di processo. Tutti gli stati sono memorizzati nella definizione del task. Il processo e le informazioni sul task sono memorizzati nel database alla fine della richiesta.
ja_jp: プロセスインスタンスが生成されると、start 状態が開始されすぐに <literal>todo</literal> 状態に遷移します。そこで新しいタスクが生成されます。 タスク記述はユーザーの入力にしたがって設定されます。それは <literal>#{todoList.description}</literal> に保存されます。 そして、タスクは現在のユーザーに割り当てられます。それは Seam の actor コンポーネントに保管されます。 このサンプルにおいて、プロセスは追加のプロセス状態を持っていないことに留意してください。 このサンプルにおけるすべての状態はタスク定義に保管されています。 プロセスとタスク情報は要求の最後でデータベースに保管されます。

source: When <literal>todo.jsp</literal> is redisplayed, <literal>taskInstanceList</literal> now finds the task that was just created. The task is shown in an <literal>h:dataTable</literal>. The internal state of the task is displayed in each column: <literal>#{task.description}</literal>, <literal>#{task.priority}</literal>, <literal>#{task.dueDate}</literal>, etc... These fields can all be edited and saved back to the database.
it_it: Quando <literal>todo.jsp</literal> viene rivisualizzata, <literal>taskInstanceList</literal> trova il task appena creato. Il task viene mostrato in un <literal>h:dataTable</literal>. Lo stato interno del task è mostrato in ciascuna colonna: <literal>#{task.description}</literal>, <literal>#{task.priority}</literal>, <literal>#{task.dueDate}</literal>, ecc... Questi campi possono essere tutti editati e salvati nel database.
ja_jp: <literal>todo.jsp</literal> が再表示されるとき、<literal>taskInstanceList</literal> はちょうど作成されたタスクを見つけます。 タスクは <literal>h:dataTable</literal> に表示されます。 タスクの内部状態は <literal>#{task.description}</literal>、 <literal>#{task.priority}</literal>、 <literal>#{task.dueDate}</literal> などのカラムに表示されます。 これらのフィールドはすべて編集やデータベースに保管可能です。

source: Each todo item also has "Done" button, which calls <literal>#{todoList.done}</literal>. The <literal>todoList</literal> component knows which task the button is for because each s:button specificies <literal>taskInstance="#{task}"</literal>, referring to the task for that particular line of of the table. The <literal>@StartTast</literal> and <literal>@EndTask</literal> annotations cause seam to make the task active and immediately complete the task. The original process then transitions into the <literal>done</literal> state, according to the process definition, where it ends. The state of the task and process are both updated in the database.
it_it: Ogni elemento todo ha anche un pulsante "Done", che chiama <literal>#{todoList.done}</literal>. Il componente <literal>todoList</literal> sa a quale task si riferisce il pulsante, poiché ogni s:button specifica <literal>taskInstance="#{task}"</literal>, che si riferisce al task per quella particolare linea della tabella. Le annotazioni <literal>@StartTast</literal> e <literal>@EndTask</literal> obbligano seam a rendere attivo il task e a completarlo. Il processo originale quindi transita verso lo stato <literal>done</literal>, secondo la definizione del processo, dove poi termina. Lo stato del task e del processo sono entrambi aggiornati nel database.
ja_jp: 各To-Do項目は "Done" ボタンを持っていて、それは <literal>#{todoList.done}</literal> を呼び出します。 <literal>todoList</literal> コンポーネントは、各 s:button が <literal>taskInstance="#{task}"</literal> を指定しているために、どのタスクボタンがテーブルの特定行のためのタスクを参照するかを知っています。 <literal>@StartTast</literal> と <literal>@EndTask</literal> アノテーションは タスクをアクティブにさせるものと、すぐにタスクを完了させるものです。 プロセス定義にしたがってオリジナルのプロセスが <literal>done</literal> 状態に遷移します。 そこでそれは終了します。 タスクとプロセスの状態はともにデータベースにアップデートされます。

source: When <literal>todo.jsp</literal> is displayed again, the now-completed task is no longer displayed in the <literal>taskInstanceList</literal>, since that component only display active tasks for the user.
it_it: Quando <literal>todo.jsp</literal> viene di nuovo visualizzata, il task adesso completato non viene più mostrato in <literal>taskInstanceList</literal>, poiché questo componente mostra solo i task attivi per l'utente.
ja_jp: <literal>todo.jsp</literal> が再表示されるとき、いま完了したタスクはもう <literal>taskInstanceList</literal> には表示されません。 なぜならコンポーネントはユーザーにとってアクティブなタスクだけを表示するからです。

source: Seam pageflow: the numberguess example
it_it: Seam pageflow: esempio di indovina-numero
ja_jp: Seam ページフロー: 数字当てゲームサンプル

source: For Seam applications with relatively freeform (ad hoc) navigation, JSF/Seam navigation rules are a perfectly good way to define the page flow. For applications with a more constrained style of navigation, especially for user interfaces which are more stateful, navigation rules make it difficult to really understand the flow of the system. To understand the flow, you need to piece it together from the view pages, the actions and the navigation rules.
it_it: Per le applicazioni Seam con una navigazione relativamente libera, le regole di navigazione JSF/Seam sono un modo perfetto per definire il flusso di pagine. Per applicazioni con uno stile di navigazione più vincolato, specialmente per interfacce utente più stateful, le regole di navigazione rendono difficile capire il flusso del sistema. Per capire il flusso occorre mettere assieme le pagine, le azioni e le regole di navigazione.
ja_jp: 比較的自由な (アドホック) 画面遷移をさせる Seam アプリケーションの場合、 JSF/Seam ナビゲーション規則がページフローを定義するのに最適な方法となります。 画面遷移に制約が多いスタイルのアプリケーションの場合、 特によりステートフルなユーザーインタフェースの場合、 ナビゲーション規則ではシステムの流れを本当に理解するのは困難になります。 フローを理解するには、 ビューページ、 アクション、 ナビゲーション規則からフローに関する情報をかき集める必要があります。

source: Seam allows you to use a jPDL process definition to define pageflow. The simple number guessing example shows how this is done.
it_it: Seam consente di usare la definizione di processo con jPDL per definire il flusso di pagine. L'esempio indovina-numero mostra come fare.
ja_jp: Seam は、jPDL プロセス定義を使うことでページフロー定義を可能にします。 この簡単な数字当てゲームサンプルからどのようにこれが実現されているかがわかります。

source: The example is implemented using one JavaBean, three JSP pages and a jPDL pageflow definition. Let's begin with the pageflow:
it_it: Quest'esempio è implementato usando un JavaBean, tre pagine JSP ed una definizione di pageflow jPDL. Iniziamo con il pageflow:
ja_jp: このサンプルは 一つのJavaBean、三つの JSP ページ、それと jPDL プロセスフロー定義で実装されています。 ページフローから始めましょう。

source: The <literal>&lt;page&gt;</literal> element defines a wait state where the system displays a particular JSF view and waits for user input. The <literal>view-id</literal> is the same JSF view id used in plain JSF navigation rules. The <literal>redirect</literal> attribute tells Seam to use post-then-redirect when navigating to the page. (This results in friendly browser URLs.)
it_it: L'elemento <literal>&lt;page&gt;</literal> definisce uno stato di attesa dove il sistema mostra una particolare vista JSF ed attende input da parte dell'utente. <literal>view-id</literal> è lo stesso id view usato nelle regole di navigazione nel pure JSF. L'attributo <literal>redirect</literal> dice a Seam di usare il post-then-redirect quando si passa ad un'altra pagina. (Questo capita con gli URL dei browser.)
ja_jp: <literal>&lt;page&gt;</literal> 要素は、待ち状態を定義しています。 ここでは、システムは特定の JSF ビューを表示し、ユーザー入力を待っています。 <literal>view-id</literal> は普通の JSF ナビゲーション規則で使用されている JSF ビュー と同じものです。 ページが画面遷移するときに、 <literal>redirect</literal> 属性は、Seam に post-then-redirect の使用を指示しています。 (この結果がブラウザ URL に表示されます。)

source: The <literal>&lt;transition&gt;</literal> element names a JSF outcome. The transition is triggered when a JSF action results in that outcome. Execution will then proceed to the next node of the pageflow graph, after invocation of any jBPM transition actions.
it_it: L'elemento <literal>&lt;transition&gt;</literal> chiama un esito JSF. La transizione è lanciata quando un'azione JSF ha tale esito. L'esecuzione quindi procederà verso il successivo nodo del grafo pageflow, dopo l'invocazione di una qualsiasi azione di transizione jBPM.
ja_jp: <literal>&lt;transition&gt;</literal> 要素は JSF 結果 (outcome) に名前を付けます。 JSF アクションがその結果 (outcome) となる場合に、 transition が起動されます。 jBPM 遷移アクションが呼び出された後、 実行はページフローグラフの次のノードに進みます。

source: A transition <literal>&lt;action&gt;</literal> is just like a JSF action, except that it occurs when a jBPM transition occurs. The transition action can invoke any Seam component.
it_it: Una transizione <literal>&lt;action&gt;</literal> è come un'azione JSF, tranne che avviene quando si verifica una transizione jBPM. L'azione di transizione può invocare qualsiasi componente Seam.
ja_jp: transition の <literal>&lt;action&gt;</literal> は、 jBPM の transitionでそれが起こることを除けば、 JSF アクションと同じです。 遷移アクションはどのような Seam コンポーネントでも呼び出すことが可能です。

source: A <literal>&lt;decision&gt;</literal> node branches the pageflow, and determines the next node to execute by evaluating a JSF EL expression.
it_it: Un nodo <literal>&lt;decision&gt;</literal> divide il pageflow e determina il successivo nodo da eseguire valutando un'espressione JSF EL.
ja_jp: <literal>&lt;decision&gt;</literal> ノードはページフローを分岐させ、 JSF EL 式を評価することによって次に実行されるノードを決定します。

source: Here is what the pageflow looks like in the JBoss Developer Studio pageflow editor:
it_it: Ecco come appare il pageflow nell'editor di pageflow di JBoss Developer Studio:
ja_jp: 以下は JBoss Developer Studio ページフローエディタでどのように表示するかを示しています。

source: Now that we have seen the pageflow, it is very, very easy to understand the rest of the application!
it_it: Ora che abbiamo visto il pageflow, è molto facile capire il resto dell'applicazione.
ja_jp: ページフローを見終わりました。 アプリケーションの残りの部分を理解することはもう簡単です。

source: Here is the main page of the application, <literal>numberGuess.jspx</literal>:
it_it: Ecco la pagina principale dell'applicazione, <literal>numberGuess.jspx</literal>:
ja_jp: これがアプリケーションの中心のページ <literal>numberGuess.jspx</literal> です。

source: Notice how the command button names the <literal>guess</literal> transition instead of calling an action directly.
it_it: Si noti come il pulsante di comando chiama la transizione <literal>guess</literal> invece di chiamare direttamente un'azione.
ja_jp: アクションを直接呼び出す代わりに、 どのようにコマンドボタンは<literal>guess</literal> transitionを指定しているかに着目してください。

source: The <literal>win.jspx</literal> page is predictable:
it_it: La pagina <literal>win.jspx</literal> è prevedibile:
ja_jp: <literal>win.jspx</literal> ページはごく普通のものです。

source: The <literal>lose.jspx</literal> looks roughly the same, so we'll skip over it.
it_it: <literal>lose.jspx</literal> è più o meno uguale, quindi si passa oltre.
ja_jp: <literal>lose.jspx</literal> はほぼ同じです。 説明は省略します。

source: Finally, we'll look at the actual application code:
it_it: Infine diamo un'occhiata al codice dell'applicazione:
ja_jp: 最後に、実際のアプリケーションコードを見ましょう。
