Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Tutorial.po
Languages: it_it, ja_jp

source: The Blog example demonstrates the use of "pull"-style MVC, where instead of using action listener methods to retrieve data and prepare the data for the view, the view pulls data from components as it is being rendered.
it_it: L'esempio Blog mostra l'uso di MVC di tipo "pull", dove invece di usare metodi action listener per recuperare i dati e preparare i dati per la vista, la vista preleva (pull) i dati dai componenti quando viene generata.
ja_jp: この Blog サンプルは、"引っぱり (PULL) " - スタイル MVC の使用を実演しています。 ここで、ビューのためのデータ取得とデータ準備のアクションメソッドリスナーを使用する代わりに、 ビューは、レンダリングしているコンポーネントからデータを引き出します (PULL) 。

source: Using "pull"-style MVC
it_it: Utilizzo di MVC "pull"-style
ja_jp: "PULL" 型 MVC の使用

source: This snippet from the <literal>index.xhtml</literal> facelets page displays a list of recent blog entries:
it_it: Questo frammento della pagina facelets <literal>index.xhtml</literal> mostra una lista di messaggi recenti al blog:
ja_jp: <literal>index.xhtml</literal> facelets ページの一部は最新のブログエントリの一覧を表示しています。

source: If we navigate to this page from a bookmark, how does the <literal>#{blog.recentBlogEntries}</literal> data used by the <literal>&lt;h:dataTable&gt;</literal> actually get initialized? The <literal>Blog</literal> is retrieved lazily &#8212; "pulled" &#8212; when needed, by a Seam component named <literal>blog</literal>. This is the opposite flow of control to what is used in traditional action-based web frameworks like Struts.
it_it: Se si arriva in quaste pagina da un segnalibro, come viene inizializzato <literal>#{blog.recentBlogEntries}</literal> usato da <literal>&lt;h:dataTable&gt;</literal>? <literal>Blog</literal> viene recuperato in modo lazy &#8212; "tirato" &#8212; quando serve, da un componente Seam chiamato <literal>blog</literal>. Questo è il flusso di controllo opposto a quello usato nei tradizionali framework web basati sull'azione, come ad esempio Struts.

source: This component uses a <emphasis>seam-managed persistence context</emphasis>. Unlike the other examples we've seen, this persistence context is managed by Seam, instead of by the EJB3 container. The persistence context spans the entire web request, allowing us to avoid any exceptions that occur when accessing unfetched associations in the view.
it_it: Questo componente utilizza un <emphasis>contesto di persistenza gestito da Seam</emphasis>. A differenza deglialtri esempi visti, questo contesto di persistenza è gestito da Seam, invece che dal container EJB3. Il contesto di persistenza estende l'intera richiesta web, consentendo di evitare le eccezioni che avvengono quando nella vista si accede ad associazioni non recuperate (unfetched).
ja_jp: このコンポーネントは <emphasis>Seam 管理永続コンテキスト (seam-managed persistence context)</emphasis> を使用しています。 これまで見てきた他のサンプルとは異なり、この永続コンテキストは、EJB3 コンテナの代わりに Seam により管理されます。 永続コンテキストは Web 要求全体におよび、ビューにおいてフェッチしていない関連にアクセスするときに発生する例外を回避することが可能です。

source: The <literal>@Unwrap</literal> annotation tells Seam to provide the return value of the method &#8212; the <literal>Blog</literal> &#8212; instead of the actual <literal>BlogService</literal> component to clients. This is the Seam <emphasis>manager component pattern</emphasis>.
it_it: L'annotazione <literal>@Unwrap</literal> impone a Seam di restituire il valore di ritorno del metodo &#8212; <literal>Blog</literal> &#8212; invece dell'attuale componente <literal>BlogService</literal> ai client. Questo è il <emphasis>manager component pattern</emphasis> di Seam.

source: This is good so far, but what about bookmarking the result of form submissions, such as a search results page?
it_it: Finora va bene, ma cosa succede se si memorizza il risultato di un invio di form, come ad esempio una pagina di risultati di ricerca?
ja_jp: これは、これまでのところ良いですが、 検索結果ページのようなフォームサブミットの結果のブックマークではどうでしょうか？

source: Bookmarkable search results page
it_it: Pagina bookmarkable dei risultati di ricerca
ja_jp: ブックマーク可能検索結果ページ

source: The blog example has a tiny form in the top right of each page that allows the user to search for blog entries. This is defined in a file, <literal>menu.xhtml</literal>, included by the facelets template, <literal>template.xhtml</literal>:
it_it: L'esempio Blog ha una piccola form in alto a destra di ogni pagina, che consente all'utente di cercare le entry del blog. E' definito in un file, <literal>menu.xhtml</literal>, incluso nel template facelets, <literal>template.xhtml</literal>:
ja_jp: この Blog サンプルは、 各ページの右上にユーザーの Blog 記事の検索を可能にする小さなフォームを持ちます。 これは、facelet テンプレート、<literal>template.xhtml</literal> に含まれる <literal>menu.xhtml</literal> ファイルに定義されます。

source: To implement a bookmarkable search results page, we need to perform a browser redirect after processing the search form submission. Because we used the JSF view id as the action outcome, Seam automatically redirects to the view id when the form is submitted. Alternatively, we could have defined a navigation rule like this:
it_it: Per implementare una pagina di risultati di ricerca memorizzabili come segnalibro, occorre eseguire un redirect del browser dopo aver elaborato la form di ricerca inviata. Poiché si è impiegato come esito d'azione l'id della vista JSF, Seam redirige automaticamente all'id vista quando la form viene inviata. In alternativa, si può definire una regola di navigazione come questa:
ja_jp: ブックマーク可能検索結果ページの実装のために、 検索フォームのサブミットを処理した後に、 ブラウザリダイレクトを実行する必要があります。 アクション結果 (outcome) として JSF ビュー ID を使用しているので、 Seam は、フォームがサブミットされたとき、自動的に ビュー ID にリダイレクトします。 別の方法として、以下のようなナビゲーションルールを定義することも可能です。

source: Then the form would have looked like this:
it_it: Quindi la form avrebbe dovuto essere così:
ja_jp: フォームは、以下と似たようなものになるでしょう。

source: But when we redirect, we need to include the values submitted with the form in the URL to get a bookmarkable URL like <literal>http://localhost:8080/seam-blog/search/</literal>. JSF does not provide an easy way to do this, but Seam does. We use two Seam features to accomplish this: <emphasis>page parameters</emphasis> and <emphasis>URL rewriting</emphasis>. Both are defined in <literal>WEB-INF/pages.xml</literal>:
it_it: Ma quando viene fatto il redirect, occorre includere i valori sottomessi con la form dentro l'URL per ottenere un URL memorizzabile come ad esempio <literal>http://localhost:8080/seam-blog/search/</literal>. JSF non fornisce un modo semplice per farlo, ma Seam sì. Per ottenere questo si usano due funzionalità di Seam: <emphasis>i parametri di pagina</emphasis> e <emphasis>la riscrittura dell'URL</emphasis>. Entrambi sono definiti in <literal>WEB-INF/pages.xml</literal>:

source: The page parameter instructs Seam to link the request parameter named <literal>searchPattern</literal> to the value of <literal>#{searchService.searchPattern}</literal>, both whenever a request for the Search page comes in and whenever a link to the search page is generated. Seam takes responsibility for maintaining the link between URL state and application state, and you, the developer, don't have to worry about it.
it_it: Il parametro di pagina istruisce Seam a fare collegare il parametro di richiesta chiamato <literal>searchPattern</literal> al valore di <literal>#{searchService.searchPattern}</literal>, sia quando arriava una richiesta per la pagina di ricerca, sia quando viene generato un link alla pagina di ricerca. Seam si prende la responsabilità di mantenere il link tra lo stato dell'URL e lo stato dell'applicazione, mentre voi, come sviluppatori, non dovete preoccuparvene.
ja_jp: 検索ページへの要求があるときや検索ページへのリンクが生成されるときはいつでも、ページパラメータは Seam に <literal>searchPattern</literal> という名前の要求パラメータを <literal>#{searchService.searchPattern}</literal> の値にリンクすることを指示します。 Seam は URL とアプリケーションの状態のリンクについて維持することに責任を持ちます。 私たちや開発者はそれを心配する必要はありません。

source: Without URL rewriting, the URL for a search on the term <literal>book</literal> would be <literal>http://localhost:8080/seam-blog/seam/search.xhtml?searchPattern=book</literal>. This is nice, but Seam can make the URL even simpler using a rewrite rule. The first rewrite rule, for the pattern <literal>/search/{searchPattern}</literal>, says that any time we have a URL for search.xhtml with a searchPattern request parameter, we can fold that URL into the simpler URL. So,the URL we saw earlier, <literal>http://localhost:8080/seam-blog/seam/search.xhtml?searchPattern=book</literal> can be written instead as <literal>http://localhost:8080/seam-blog/search/book</literal>.
it_it: Senza riscrittura, l'URL di una ricerca di un termine <literal>book</literal> sarebbe <literal>http://localhost:8080/seam-blog/seam/search.xhtml?searchPattern=book</literal>. Questo può andare bene, ma Seam può semplificare l'URL usando una regola di riscrittura. La prima regola, per il pattern <literal>/search/{searchPattern}</literal>, dice che in ogni volta che si ha un URL per search.xhtml con un parametro di richiesta searchPattern, si può semplificare quest'URL. E quindi l'URL visto prima, <literal>http://localhost:8080/seam-blog/seam/search.xhtml?searchPattern=book</literal> viene riscritto come <literal>http://localhost:8080/seam-blog/search/book</literal>.

source: Just like with page parameters, URL rewriting is bi-directional. That means that Seam forwards requests for the simpler URL to the the right view, and it also automatically generates the simpler view for you. You never need to worry about constructing URLs. It's all handled transparently behind the scenes. The only requirement is that to use URL rewriting, the rewrite filter needs to be enabled in <literal>components.xml</literal>.
it_it: Come per i parametri di pagina, la riscrittura dell'URL è bidirezionale. Questo significa che Sean inoltra le richieste di URL più semplici alla giusta vista e genera automaticamente la vista più semplice per voi. Non serve preoccuparsi della costruzione dell'URL. Viene tutto gestito in modo trasparente dietro. L'unico requisito è che per usare la riscrittura dell'URL, occorre abilitare il filtro di riscrittura in <literal>components.xml</literal>.
ja_jp: ページパラメータと同様に、URL 書き換えは両方向です。 Seam はより簡単な URL の要求を適切なビューにフォーワードすること、そして簡単なビューを自動的に生成することも意味します。 唯一の要件は URL を書き換えするために、書き換えフィルタが <literal>components.xml</literal> において使用可能であることです。

source: The redirect takes us to the <literal>search.xhtml</literal> page:
it_it: Il redirect di porta alla pagina <literal>search.xhtml</literal>:
ja_jp: リダイレクトによって <literal>search.xhtml</literal> ページに移動します。

source: Which again uses "pull"-style MVC to retrieve the actual search results using Hibernate Search.
it_it: Il quale usa ancora MVC di tipo "pull" per recuperare i risultati di ricerca usando hibernate Search.
ja_jp: これもまた Hibernate 検索を使用し実際の検索結果を取得するために "PULL" 型 MVC を使用しています。

source: Using "push"-style MVC in a RESTful application
it_it: Uso di MVC push in un'applicazione RESTful
ja_jp: RESTful アプリケーションの "PUSH" 型 MVC の使用

source: Very occasionally, it makes more sense to use push-style MVC for processing RESTful pages, and so Seam provides the notion of a <emphasis>page action</emphasis>. The Blog example uses a page action for the blog entry page, <literal>entry.xhtml</literal>. Note that this is a little bit contrived, it would have been easier to use pull-style MVC here as well.
it_it: Alcune volte ha più senso usare MVC push-style per processare pagine RESTful, e quindi Seam fornisce la nozione di <emphasis>azione di pagina</emphasis>. L'esempio di Blog utilizza l'azione di pagina per pagina di entry del blog, <literal>entry.xhtml</literal>. Notare che questo è un pò forzato, sarebbe stato più facile usare anche qua lo stile MVC pull-style.
ja_jp: ごく希に、RESTful ページ処理のために PUSH 型 MVC を使用することが当然の場合があります。 そこで、Seam は、<emphasis>ページアクション</emphasis> の概念を提供します。 Blog サンプルは、 Blog 記入ページ、 <literal>entry.xhtml</literal> にページアクションを使用しています。 これは、少しわざとらしい感じで、ここでは、PULL 型 MVC を使用する方が容易かもしれません。

source: The <literal>entryAction</literal> component works much like an action class in a traditional push-MVC action-oriented framework like Struts:
it_it: Il componente <literal>entryAction</literal> funziona come una action class in un framework tradizionale orientato alle azioni e push-MVC come Struts:
ja_jp: <literal>entryAction</literal> コンポーネントは、 Struts のような典型的な PUSH 型 MVC アクション指向フレームワークのように動作します。

source: Page actions are also declared in <literal>pages.xml</literal>:
it_it: Le azione nella pagina vengono anche dichiarate in <literal>pages.xml</literal>:
ja_jp: ページアクションは、<literal>pages.xml</literal> でも宣言されます。

source: Notice that the example is using page actions for post validation and the pageview counter. Also notice the use of a parameter in the page action method binding. This is not a standard feature of JSF EL, but Seam lets you use it, not just for page actions but also in JSF method bindings.
it_it: Notare che l'esempio utilizza azioni di pagina per la validazione e per il conteggio delle pagine visitate. Si noti anche l'uso di un parametro nel binding di metodo all'interno della azione di pagina. Questa non è una caratteristiva standard di JSF EL, ma Seam consente di usarla, non solo per le azioni di pagina, ma anche nei binding di metodo JSF.
ja_jp: このサンプルはポストバリデーションとページビューカウンタのためにページアクションを使用していことに留意してください。 同様にページアクションメソッドバインディングでのパラメータの使用にも留意してください。 これは標準 JSF EL の機能ではありませんが、Seam はページアクションだけでなく JSF メソッドバインディングでも使用を可能にしています。

source: When the <literal>entry.xhtml</literal> page is requested, Seam first binds the page parameter <literal>blogEntryId</literal> to the model. Keep in mind that because of the URL rewriting, the blogEntryId parameter name won't show up in the URL. Seam then runs the page action, which retrieves the needed data &#8212; the <literal>blogEntry</literal> &#8212; and places it in the Seam event context. Finally, the following is rendered:
it_it: Quando la pagina <literal>entry.xhtml</literal> viene richiesta, Seam innanzitutto lega il parametro della pagina <literal>blogEntryId</literal> al modello. Si tenga presente che a causa della riscrittura dell'URL, il nome del parametro blogEntryId non verrà mostrato nell'URL. Seam quindi esegue l'azione, che recupera i dati necessari &#8212; <literal>blogEntry</literal> &#8212; e li colloca nel contesto di evento di Seam. Infine, viene generato il seguente:

source: If the blog entry is not found in the database, the <literal>EntryNotFoundException</literal> exception is thrown. We want this exception to result in a 404 error, not a 505, so we annotate the exception class:
it_it: Se l'entry del blog non viene trovata nel database, viene lanciata l'eccezione <literal>EntryNotFoundException</literal>. Si vuole che quest'eccezione venga evidenziata come errore 404, non 505, e quindi viene annotata la classe dell'eccezione:
ja_jp: blog エントリがデータベースで見つからない場合、 <literal>EntryNotFoundException</literal> 例外がスローされます。 exception is thrown. この例外は 505 エラーではなく 404 であって欲しいので、 例外クラスのアノテーションを付けます。

source: An alternative implementation of the example does not use the parameter in the method binding:
it_it: Un'implementazione alternativa dell'esempio non utilizza il parametro nel method binding:
ja_jp: 別実装のサンプルは、メソッドバインディングでパラメータを使用しません。

source: It is a matter of taste which implementation you prefer.
it_it: E' una questione di gusti su quale implementazione tu preferisca.
ja_jp: どの実装を選択するかは好みの問題です。

source: The blog demo also demonstrates very simple password authentication, posting to the blog, page fragment caching and atom feed generation.
it_it: La demo del blog mostra anche una semplice autenticazione di password, un invio di un post al blog, un esempio di caching frammentato della pagina e la generazione di atom feed.
ja_jp: ブログデモはまたとても簡単なパスワード認証、ブログのポスト、ページの一部のキャッシュ、 atom フィードの生成も実演しています。

source: Login
ja_jp: ログイン

source: Logout
ja_jp: ログアウト
