Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Tutorial.po
Languages: it_it, ja_jp

source: But Seam is not done yet. Seam intercepts the method call and injects the <literal>User</literal> entity from the Seam session context, before allowing the invocation to continue.
it_it: Ma Seam non ha ancora terminato. Seam intercetta la chiamata al metodo e inietta l'entity <literal>User</literal> dal contestosessione di Seam, prima di consentire all'invocazione di continuare.

source: The <literal>register()</literal> method checks if a user with the entered username already exists. If so, an error message is queued with the <literal>FacesMessages</literal> component, and a null outcome is returned, causing a page redisplay. The <literal>FacesMessages</literal> component interpolates the JSF expression embedded in the message string and adds a JSF <literal>FacesMessage</literal> to the view.
it_it: Il metodo <literal>register()</literal> controlla se esiste già un utente lo username inserito. Se è così, viene accodato un errore al componente <literal>FacesMessages</literal>, e viene restituito un esito null, causando la rivisualizzazione della pagina. Il componente <literal>FacesMessages</literal> interpola l'espressione JSF incorporata nella stringadi messaggio e aggiunge un <literal>FacesMessage</literal> JSF alla vista.
ja_jp: <literal>register()</literal> メソッドは入力されたユーザー名が既に存在するかどうかを調べます。 存在した場合、 エラーメッセージは <literal>FacesMessages</literal> コンポーネントでキューイングされ、 null 結果 (outcome) が返されてページが再表示されることになります。 <literal>FacesMessages</literal> コンポーネントはメッセージ文字列に組み込まれた JSF 式を補完し、 ビュー に JSF <literal>FacesMessage</literal> を追加します。

source: If no user with that username exists, the <literal>"/registered.xhtml"</literal> outcome triggers a browser redirect to the <literal>registered.xhtml</literal> page. When JSF comes to render the page, it asks Seam to resolve the variable named <literal>user</literal> and uses property values of the returned <literal>User</literal> entity from Seam's session scope.
it_it: Se non esiste nessun utente con tale username, l'esito di <literal>"/registered.xhtml"</literal> causa un redirect del browser verso la pagina <literal>registered.xhtml</literal>. Quando JSF arriva a generare la pagina, chiede a Seam di risolvere la variabile chiamata <literal>user</literal> ed utilizza il valori di proprietà dell'entity <literal>User</literal> restituito dallo scope di sessione di Seam.
ja_jp: そのユーザー名のユーザーが存在しない場合、<literal>"/registered.xhtml"</literal>" 結果 (outcome) により <literal>registered.xhtml</literal> ページへのブラウザリダイレクトが発生します。 JSF がページのレンダリングに到達すると、 Seam に <literal>user</literal> という名前の変数の解決を要求し、 Seam のセッションスコープから返される <literal>User</literal> エンティティのプロパティ値を使用します。

source: Clickable lists in Seam: the messages example
it_it: Liste cliccabili in Seam: esempio di messaggi
ja_jp: Seam でクリックが可能な一覧: 掲示板サンプル

source: Clickable lists of database search results are such an important part of any online application that Seam provides special functionality on top of JSF to make it easier to query data using EJB-QL or HQL and display it as a clickable list using a JSF <literal>&lt;h:dataTable&gt;</literal>. The messages example demonstrates this functionality.
it_it: Le liste cliccabili dei risultati di ricerca del database sono una parte così importante di qualsiasi applicazione online che Seam fornisce una funzionalità speciale in cima a JSF per rendere più facile l'interrogazione dei dati usando EJB-QL o HQL e la mostra comelista cliccabile usando il JSF <literal>&lt;h:dataTable&gt;</literal>. I messaggi d'esempio mostrano questa funzionalità.
ja_jp: データベースの検索結果をクリック可能一覧とすることは、 多くのオンラインアプリケーションにおいてたいへん重要な部分です。Seam は、EJB-QL またはHQL を使用してデータの問合せを行うことと、 その結果をJSF <literal>&lt;h:dataTable&gt;</literal> を使用してクリック可能な一覧として表示することを容易にするために、 JSF 上に特別な機能を提供します。 この掲示板サンプルは、この機能を実演しています。

source: The message list example has one entity bean, <literal>Message</literal>, one session bean, <literal>MessageListBean</literal> and one JSP.
it_it: L'esempio di lista messaggi ha un entity bean, <literal>Message</literal>, un session bean, <literal>MessageListBean</literal> ed una JSP.
ja_jp: この掲示板サンプルは、 一つのエンティティ Bean である <literal>Message</literal>、 一つのセッション Bean である <literal>MessageListBean</literal>、 そして一つの JSP から構成されています。

source: The entity bean: <literal>Message.java</literal>
it_it: Entity bean: <literal>Message.java</literal>
ja_jp: エンティティ Bean : <literal>Message.java</literal>

source: The <literal>Message</literal> entity defines the title, text, date and time of a message, and a flag indicating whether the message has been read:
it_it: L'entity <literal>Message</literal> definisce il titolo, il testo, la data e l'orario del messaggio e un flag indica se il messaggio è stato letto:
ja_jp: <literal>Message</literal> エンティティ Bean は、 タイトル、テキスト、掲示メッセージの日付と時間、 そして、メッセージが既読か否かを示すフラグを定義しています。

source: The stateful session bean: <literal>MessageManagerBean.java</literal>
it_it: Il bean di sessione stateful: <literal>MessageManagerBean.java</literal>
ja_jp: ステートフルセッション Bean : <literal>MessageManagerBean.java</literal>

source: Just like in the previous example, we have a session bean, <literal>MessageManagerBean</literal>, which defines the action listener methods for the two buttons on our form. One of the buttons selects a message from the list, and displays that message. The other button deletes a message. So far, this is not so different to the previous example.
it_it: Come nel precedente esempio, esiste un session bean, <literal>MessageManagerBean</literal>, che definisce i metodi di action listener per i due bottoni della form. Uno di questi seleziona un messaggio dalla lista, e mostra tale messaggio. L'altro cancella il messaggio. Finora non è molto diverso dal precedente esempio.
ja_jp: 前述のサンプル同様、 一つのセッション Bean <literal>MessageManagerBean</literal> があります。 それは、フォームにある二つのボタンに対応するアクションリスナーメソッドを定義しています。 ボタンの一つは、一覧からメッセージを選択し、 もう一つのボタンは、メッセージを削除します。 この点において、前述のサンプルと大きな違いはありません。

source: But <literal>MessageManagerBean</literal> is also responsible for fetching the list of messages the first time we navigate to the message list page. There are various ways the user could navigate to the page, and not all of them are preceded by a JSF action &#8212; the user might have bookmarked the page, for example. So the job of fetching the message list takes place in a Seam <emphasis>factory method</emphasis>, instead of in an action listener method.
it_it: Ma <literal>MessageManagerBean</literal> è anche responsabile per il recupero della lista dei messaggi la prima volta che si naviga nella pagina della lista messaggi. Ci sono vari modi in cui l'utente può navigare nella pagina, e non tutti sono preceduti da un'azione JSF &#8212; l'utente può avere un memorizzato la pagina, per esempio. Quindi il compito di recuperare la lista messaggi avviene in un <emphasis>metodo factory</emphasis> di Seam, invece che in un metodo action listener.

source: We want to cache the list of messages in memory between server requests, so we will make this a stateful session bean.
it_it: Si vuole memorizzare la lista dei messaggi tra le varie richieste server, e quindi questo session bean diventerà stateful.
ja_jp: メッセージの一覧をサーバ要求にまたがってメモリにキャッシュしたいので、 ステートフルセッション Bean でこれを行います。

source: The <literal>@DataModel</literal> annotation exposes an attibute of type <literal>java.util.List</literal> to the JSF page as an instance of <literal>javax.faces.model.DataModel</literal>. This allows us to use the list in a JSF <literal>&lt;h:dataTable&gt;</literal> with clickable links for each row. In this case, the <literal>DataModel</literal> is made available in a session context variable named <literal>messageList</literal>.
it_it: L'annotazione <literal>@DataModel</literal> espone alla pagina JSF un attributo di tipo <literal>java.util.List</literal> come istanza di <literal>javax.faces.model.DataModel</literal>. Questo permette di usare la lista in un <literal>&lt;h:dataTable&gt;</literal> di JSF con link cliccabili per ogni riga. In questo caso il <literal>DataModel</literal> è reso disponibile in una variabile con contesto sessione chiamata <literal>messageList</literal>.
ja_jp: <literal>@DataModel</literal> アノテーションは、 <literal>java.util.List</literal> タイプの属性を、 <literal>javax.faces.model.DataModel</literal> インスタンスとして JSF ページに公開します。 これは、各行に対してクリック可能なリンクを持つ JSF <literal>&lt;h:dataTable&gt;</literal> 中の一覧を使用可能とします。 このサンプルでは、 <literal>DataModel</literal> は、 <literal>messageList</literal> という名前のセッションコンテキスト中で利用可能になります。

source: The <literal>@DataModelSelection</literal> annotation tells Seam to inject the <literal>List</literal> element that corresponded to the clicked link.
it_it: L'annotazione <literal>@DataModelSelection</literal> dice a Seam di iniettare l'elemento <literal>List</literal> che corrisponde al link cliccato.
ja_jp: <literal>@DataModelSelection</literal> アノテーションは、 Seam にクリックされたリンクと関連した <literal>List</literal> 要素をインジェクトするよう指示しています。

source: The <literal>@Out</literal> annotation then exposes the selected value directly to the page. So every time a row of the clickable list is selected, the <literal>Message</literal> is injected to the attribute of the stateful bean, and the subsequently <emphasis>outjected</emphasis> to the event context variable named <literal>message</literal>.
it_it: L'annotazione <literal>@Out</literal> espone direttamente alla pagina il valore selezionato. Ogni volta che una riga della lista viene selezionata, il <literal>Message</literal> viene iniettato nell'attributo del bean stateful, e in seguito viene fatta <emphasis>l'outjection</emphasis> nella variabile con contesto evento chiamata <literal>message</literal>.

source: This stateful bean has an EJB3 <emphasis>extended persistence context</emphasis>. The messages retrieved in the query remain in the managed state as long as the bean exists, so any subsequent method calls to the stateful bean can update them without needing to make any explicit call to the <literal>EntityManager</literal>.
it_it: Questo bean stateful ha un <emphasis>contesto di persistenza EJB3 esteso</emphasis>. I messaggi recuperati nella query rimangono nello stato gestito finché esiste il bean, quindi ogni chiamata di metodo conseguente al bean può aggiornarli senza il bisogno di chiamare esplicitamente l'<literal>EntityManager</literal>.
ja_jp: このステートフル Bean は、EJB3 <emphasis>拡張永続コンテキスト</emphasis> を持っています。 この Bean が存在する限り、 クエリー検索された messages は、管理された状態に保持されます。 従って、 それに続くステートフル Bean へのメソッド呼び出しは、 明示的に <literal>EntityManager</literal> を呼び出すことなく、 それらの更新が可能です。

source: The first time we navigate to the JSP page, there will be no value in the <literal>messageList</literal> context variable. The <literal>@Factory</literal> annotation tells Seam to create an instance of <literal>MessageManagerBean</literal> and invoke the <literal>findMessages()</literal> method to initialize the value. We call <literal>findMessages()</literal> a <emphasis>factory method</emphasis> for <literal>messages</literal>.
it_it: La prima volta che si naviga in un pagina JSP, non c'è alcun valore nella variabile di contesto <literal>messageList</literal>. L'annotazione <literal>@Factory</literal> dice a Seam di creare un'istanza di <literal>MessageManagerBean</literal> e di invocare il metodo <literal>findMessages()</literal> per inizializzare il valore. <literal>findMessages()</literal> viene chiamato <emphasis>metodo factory</emphasis> di <literal>messages</literal>.
ja_jp: 初めて JSP ページに画面遷移するとき、 <literal>messageList</literal> コンテキスト変数中に値を持っていません。 <literal>@Factory</literal> アノテーションは、Seam に <literal>MessageManagerBean</literal> インスタンスの生成を指示し、 初期値を設定するために <literal>findMessages()</literal> メソッドを呼び出します。 <literal>findMessages()</literal> を <literal>messages</literal> の <emphasis>ファクトリメソッド</emphasis>と呼びます。

source: The <literal>select()</literal> action listener method marks the selected <literal>Message</literal> as read, and updates it in the database.
it_it: Il metodo action listener <literal>select()</literal> marca il <literal>Message</literal> selezionato come letto e lo aggiorna nel database.
ja_jp: <literal>select()</literal> アクションリスナーメソッドは、 選択された <literal>Message</literal>に 既読 マークを付け、 データベース中のそれを更新します。

source: The <literal>delete()</literal> action listener method removes the selected <literal>Message</literal> from the database.
it_it: Il metodo action listener <literal>delete()</literal> rimuove il <literal>Message</literal> dal database.
ja_jp: <literal>delete()</literal> アクションリスナーメソッドは、 選択された <literal>Message</literal> をデータベースから削除します。

source: All stateful session bean Seam components <emphasis>must</emphasis> have a method with no parameters marked <literal>@Remove</literal> that Seam uses to remove the stateful bean when the Seam context ends, and clean up any server-side state.
it_it: Tutti i componenti Seam bean di sessione stateful <emphasis>devono</emphasis> avere un metodo senza parametri marcato <literal>@Remove</literal> che Seam utilizza per rimuovere il bean stateful quando termina il contesto di Seam, e viene pulito tutto lo stato lato server.
ja_jp: すべてのステートフルセッション Bean の Seam コンポーネントは、<literal>@Remove</literal> とマークされたパラメータを持たないメソッドを持つことが<emphasis>必須</emphasis>です。 これによりSeam コンテキストが終わり、サーバサイドの状態をクリーンアップするときに、 Seam はステートフル Bean の削除を行います。

source: Note that this is a session-scoped Seam component. It is associated with the user login session, and all requests from a login session share the same instance of the component. (In Seam applications, we usually use session-scoped components sparingly.)
it_it: Si noti che questo è un componente Seam di sessione. E' associato alla sessione di login dell'utente e tutte le richieste da una login di sessione condividono la stessa istanza del componente. (Nelle applicazioni Seam, solitamente si usano componenti con scope di sessione in maniera contenuta.)
ja_jp: これがセッションスコープの Seam コンポーネントであることに留意してください。 ユーザーログインセッションと関連しログインセッションからのすべての要求は、 同じコンポーネントのインスタンスを共有します。 (Seam アプリケーションでは、セッションスコープのコンポーネントは控えめに使用してください。)

source: The session bean local interface: <literal>MessageManager.java</literal>
it_it: L'interfaccia locale del session bean local: <literal>MessageManager.java</literal>
ja_jp: セッション Bean ローカルインタフェース : <literal>MessageManager.java</literal>

source: All session beans have a business interface, of course.
it_it: Tutti i session bean hanno un'interfaccia di business, naturalmente.
ja_jp: もちろん、すべてのセッション Bean はインタフェースを持ちます。

source: From now on, we won't show local interfaces in our code examples.
it_it: D'ora in poi non verranno mostrate interfacce locali nei codici d'esempio.
ja_jp: ここからは、サンプルコード中のローカルインタフェースの記述を省略します。

source: Let's skip over <literal>components.xml</literal>, <literal>persistence.xml</literal>, <literal>web.xml</literal>, <literal>ejb-jar.xml</literal>, <literal>faces-config.xml</literal> and <literal>application.xml</literal> since they are much the same as the previous example, and go straight to the JSP.
it_it: Saltiamo i file <literal>components.xml</literal>, <literal>persistence.xml</literal>, <literal>web.xml</literal>, <literal>ejb-jar.xml</literal>, <literal>faces-config.xml</literal> e <literal>application.xml</literal> poiché sono praticamente uguali all'esempio precedente e andiamo dritti alla pagina JSP.
ja_jp: <literal>components.xml</literal>、<literal>persistence.xml</literal>、<literal>web.xml</literal>、<literal>ejb-jar.xml</literal>、<literal>faces-config.xml</literal> そして <literal>application.xml</literal> は前述までのサンプルとほぼ同じなので、スキップして JSP に進みましょう。

source: The view: <literal>messages.jsp</literal>
it_it: La vista: <literal>messages.jsp</literal>
ja_jp: ビュー: <literal>messages.jsp</literal>

source: The JSP page is a straightforward use of the JSF <literal>&lt;h:dataTable&gt;</literal> component. Again, nothing specific to Seam.
it_it: La pagina JSP è un semplice utilizzo del componente JSF <literal>&lt;h:dataTable&gt;</literal>. Ancora nulla di specifico di Seam.
ja_jp: このJSPページは JSF <literal>&lt;h:dataTable&gt;</literal> コンポーネントを使用した簡単なものです。 Seam として特別なものはありません。

source: The first time we navigate to the <literal>messages.jsp</literal> page, the page will try to resolve the <literal>messageList</literal> context variable. Since this context variable is not initialized, Seam will call the factory method <literal>findMessages()</literal>, which performs a query against the database and results in a <literal>DataModel</literal> being outjected. This <literal>DataModel</literal> provides the row data needed for rendering the <literal>&lt;h:dataTable&gt;</literal>.
it_it: La prima volta che si naviga nella pagina <literal>messages.jsp</literal>, la pagina proverà a risolvere la variabile di contesto <literal>messageList</literal>. Poiché questa variabile non è inizializzata, Seam chiamerà il metodo factory <literal>findMessages()</literal>, che esegue la query del database e mette i risultati in un <literal>DataModel</literal> di cui verrà fatta l'outjection. Questo <literal>DataModel</literal> fornisce i dati di riga necessari per generare la <literal>&lt;h:dataTable&gt;</literal>.
ja_jp: 最初に <literal>messages.jsp</literal> ページに画面遷移させるとき、ページは <literal>messageList</literal> コンテキスト変数を解決することを試みます。 このコンテキスト変数は初期化されていないため、 Seam はファクトリメソッド <literal>findMessages()</literal>を呼び出します。 それはデータベースにクエリー発行や、 アウトジェクト (outject) された <literal>DataModel</literal> の結果取得を行います。 この <literal>DataModel</literal> は <literal>&lt;h:dataTable&gt;</literal> をレンダリングするために必要な行データを提供します。

source: When the user clicks the <literal>&lt;h:commandLink&gt;</literal>, JSF calls the <literal>select()</literal> action listener. Seam intercepts this call and injects the selected row data into the <literal>message</literal> attribute of the <literal>messageManager</literal> component. The action listener fires, marking the selected <literal>Message</literal> as read. At the end of the call, Seam outjects the selected <literal>Message</literal> to the context variable named <literal>message</literal>. Next, the EJB container commits the transaction, and the change to the <literal>Message</literal> is flushed to the database. Finally, the page is re-rendered, redisplaying the message list, and displaying the selected message below it.
it_it: Quando l'utente clicca il <literal>&lt;h:commandLink&gt;</literal>, JSF chiama l'action listener <literal>select()</literal>. Seam intercetta questa chiamata ed inietta i dati di riga selezionati nell'attributo del componente <literal>messageManager</literal>. L'action listener viene eseguito, marcando come letto il <literal>Message</literal> selezionato. Alla fine della chiamata, Seam esegue l'outjection del <literal>Message</literal> selezionato nella variabile di contesto chiamata <literal>message</literal>. Poi il container EJB committa la transazione ed i cambiamenti a <literal>message</literal> vengono comunicati al database. Infine la pagina vienere rigenerata, rimostrando la lista dei messaggi e mostrando sotto il messaggio selezionato.
ja_jp: ユーザーが <literal>&lt;h:commandLink&gt;</literal> をクリックすると、 JSF は <literal>select()</literal> アクションリスナーを呼び出します。 Seam はこの呼び出しをインタセプトして選択された行データを <literal>messageManager</literal> コンポーネントの <literal>message</literal> 属性にインジェクトします。 アクションリスナーが実行されて、 選択 <literal>Message</literal> に既読マークを付けます。 呼び出しの終わりに、 Seam は、選択 <literal>Message</literal> を <literal>message</literal> という名前のコンテキスト変数にアウトジェクトします。 次に、 EJB コンテナはトランザクションをコミットし、 <literal>Message</literal> に対する変更がデータベースにフラッシュされます。 最後に、 このページが再度レンダリングされてメッセージ一覧を再表示、 その下に選択メッセージが表示されます。

source: If the user clicks the <literal>&lt;h:commandButton&gt;</literal>, JSF calls the <literal>delete()</literal> action listener. Seam intercepts this call and injects the selected row data into the <literal>message</literal> attribute of the <literal>messageList</literal> component. The action listener fires, removing the selected <literal>Message</literal> from the list, and also calling <literal>remove()</literal> on the <literal>EntityManager</literal>. At the end of the call, Seam refreshes the <literal>messageList</literal> context variable and clears the context variable named <literal>message</literal>. The EJB container commits the transaction, and deletes the <literal>Message</literal> from the database. Finally, the page is re-rendered, redisplaying the message list.
it_it: Se l'utente clicca <literal>&lt;h:commandButton&gt;</literal>, JSF chiama l'action listener <literal>delete()</literal>. Seam intercetta questa chiamata ed inietta i dati selezionati nell'attributo <literal>message</literal> del componente <literal>messageList</literal>. L'action listener viene eseguito, rimuovendo dalla lista il <literal>Message</literal>, e chiamando anche il metodo <literal>remove()</literal> dell'<literal>EntityManager</literal>. Alla fine della chiamata, Seam aggiorna la variabile di contesto <literal>messageList</literal> e pulisce la variabile di contesto chiamata <literal>message</literal>. Il container EJB committa la transazione e cancella <literal>Message</literal> dal database. Infine la pagina viene rigenerata, rimostrando la lista dei messaggi.
ja_jp: ユーザーが <literal>&lt;h:commandButton&gt;</literal> をクリックすると、 JSF は、<literal>delete()</literal> アクションリスナーを呼び出します。 Seam はこの呼び出しをインタセプトし、 選択された行データを <literal>messageList</literal> コンポーネントの <literal>message</literal> 属性にインジェクトします。 アクションリスナーが起動し、 選択 <literal>Message</literal> が一覧から削除され、 <literal>EntityManager</literal> の <literal>remove()</literal> が呼び出されます。 呼び出しの終わりに、 Seam は <literal>messageList</literal> コンテキスト変数を更新し、 <literal>message</literal> という名前のコンテキスト変数を消去します。 EJB コ ンテナはトランザクションをコミットし、 データベースから <literal>Message</literal> を削除します。 最後に、 このページが再度レンダリングされ、 メッセージ一覧を再表示します。

source: Seam and jBPM: the todo list example
it_it: Seam e jBPM: esempio di lista todo
ja_jp: Seam と jBPM : TO-DO 一覧サンプル

source: jBPM provides sophisticated functionality for workflow and task management. To get a small taste of how jBPM integrates with Seam, we'll show you a simple "todo list" application. Since managing lists of tasks is such core functionality for jBPM, there is hardly any Java code at all in this example.
it_it: jBPM fornisce una funzionalità sofisticata per il workflow e la gestione dei task. Per provare come jBPM si integra con Seam, viene mostrata l'applicazione "todo list". Poiché gestire liste di task è la funzione base di jBPM, non c'è praticamente alcun codice Java in quest'esempio.
ja_jp: jBPM はワークフローやタスク管理のための優れた機能を提供します。 どのように jBPM が Seam と統合されているかを知るために、 簡単な To-Do 一覧アプリケーションをお見せしましょう。 タスクの一覧を管理することは、jBPM の中核的機能であるため、 このサンプルには Java コードがほとんどありません。

source: The center of this example is the jBPM process definition. There are also two JSPs and two trivial JavaBeans (There was no reason to use session beans, since they do not access the database, or have any other transactional behavior). Let's start with the process definition:
it_it: La parte centrale dell'esempio è la definizione del processo jBPM. Ci sono anche due pagine JSP e due banalissimi JavaBean (Non c'è alcuna ragione per usare session bean, poiché questi non accedono al database, e non hanno un comportamento transazionale). Cominciamo con la definizione del processo:
ja_jp: このサンプルの中心は、jBPM のプロセス定義です。 二つの JSP と二つのちょっとした JavaBean もあります。 (データベースアクセスやトランザクション特性がないので、 セッション Bean を使用する理由はありません。) それではプロセス定義から始めましょう。

source: The <literal>&lt;start-state&gt;</literal> node represents the logical start of the process. When the process starts, it immediately transitions to the <literal>todo</literal> node.
it_it: Il nodo <literal>&lt;start-state&gt;</literal> rappresenta l'inizio logico del processo. Quando il processo inizia, transita subito nel nodo <literal>todo</literal>.
ja_jp: <literal>&lt;start-state&gt;</literal> ノードはプロセスの論理的な開始を表します。 プロセスが開始したとき、 それはすぐに <literal>todo</literal> に遷移します。
