Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Tutorial.po
Languages: it_it, ja_jp

source: The Seam <literal>@Logger</literal> annotation is used to inject the component's <literal>Log</literal> instance.
it_it: L'annotazione <literal>@Logger</literal> di Seam è usata per iniettare l'istanza <literal>Log</literal> del componente.
ja_jp: Seam <literal>@Logger</literal> アノテーションはコンポーネントの <literal>Log</literal> インスタンスをインジェクトするために使用されています。

source: The action listener method uses the standard EJB3 <literal>EntityManager</literal> API to interact with the database, and returns the JSF outcome. Note that, since this is a session bean, a transaction is automatically begun when the <literal>register()</literal> method is called, and committed when it completes.
it_it: Il metodo action listener utilizza l'API EJB3 standard <literal>EntityManager</literal> per interagire con il database, e restituisce l'esito JSF. Notare che, poiché questo è un session bean, si inizia automaticamente una transazione quando viene chiamato il metodo <literal>register()</literal>, e viene eseguito il commit quando questo completa.
ja_jp: アクションリスナーメソッドは、データベースとやり取りするために、 標準 EJB3 <literal>EntityManager</literal> API を使用し、JSF 結果 (outcome) を返します。 これはセッション Bean なので、 <literal>register()</literal> メソッドが呼ばれたときに、 トランザクションは自動的に開始され、終了したときにコミットされることに留意してください。

source: Notice that Seam lets you use a JSF EL expression inside EJB-QL. Under the covers, this results in an ordinary JPA <literal>setParameter()</literal> call on the standard JPA <literal>Query</literal> object. Nice, huh?
it_it: Si noti che Seam consente di utilizzare espressioni JSF EL dentro EJB-QL. Sotto il coperchio, questo proviene da un'ordinaria chiamata JPA <literal>setParameter()</literal> sull'oggetto standard <literal>Query</literal>. Interessante, vero?
ja_jp: Seam では EJB-QL 内で JSF EL 式を使用することができます。 バックグラウンドで行われるため見えませんが、 これにより普通の JPA <literal>setParameter()</literal> が標準 JPA <literal>Query</literal> オブジェクトを呼び出すことになります。 便利でしょう?

source: The <literal>Log</literal> API lets us easily display templated log messages which can also make use of JSF EL expressions.
it_it: L'API <literal>Log</literal> consente facilmente di mostrare i messaggi di log, i quali possono anche impiegare espressioni JSF EL.

source: JSF action listener methods return a string-valued outcome that determines what page will be displayed next. A null outcome (or a void action listener method) redisplays the previous page. In plain JSF, it is normal to always use a JSF <emphasis>navigation rule</emphasis> to determine the JSF view id from the outcome. For complex application this indirection is useful and a good practice. However, for very simple examples like this one, Seam lets you use the JSF view id as the outcome, eliminating the requirement for a navigation rule. <emphasis>Note that when you use a view id as an outcome, Seam always performs a browser redirect.</emphasis>
it_it: I metodi JSF action listener restituiscono un esito di tipo stringa, che determina quale pagina verrà mostrata come successiva. Un estio null (o un metodo action listener di tipo void) regenera la pagina precedente. Nel semplice JSF, è normale impiegare sempre una <emphasis>regola di navigazione</emphasis> JSF per determinare l'id della vista JSF dall'esito. Per applicazioni complesse quest'azione indiretta (indirection) è sia utile sia una buona pratica. Comunque, per ogni esempio semplice come questo, Seam consente di usare l'id della vista JSF come esito, eliminando l'uso della regola di navigazione. <emphasis>Si noti che quando viene usato l'id della vista come esito, Seam esegue sempre un redirect del browser.</emphasis>
ja_jp: JSF アクションリスナーメソッドは、次にどのページを表示するかを決定するストリング値の結果 (outcome) を返します。 null 結果 (outcome) (あるいは、void アクションリスナーメソッド) は、 前のページを再表示します。 普通の JSF では、 結果 (outcome) から JSF ビュー id を決定するために、 常に JSF <emphasis>ナビゲーション規則</emphasis> を使用することが普通です。 複雑なアプリケーションにとって、この間接的方法は、実用的な良い慣行です。 しかし、このようなとても簡単なサンプルのために、 Seam は、結果 (outcome) として JSF ビュー id の使用を可能とし、 ナビゲーション規則の必要性を取り除きました。 <emphasis> 結果 (outcome) としてビュー id を使用する場合、 Seam は、常にブラウザリダイレクトを行うことに留意してください。 </emphasis>

source: Seam provides a number of <emphasis>built-in components</emphasis> to help solve common problems. The <literal>FacesMessages</literal> component makes it easy to display templated error or success messages. (As of Seam 2.1, you can use <literal>StatusMessages</literal> instead to remove the semantic dependency on JSF). Built-in Seam components may be obtained by injection, or by calling the <literal>instance()</literal> method on the class of the built-in component.
it_it: Seam fornisce un numero di <emphasis>componenti predefiniti</emphasis> per aiutare a risolvere problemi comuni. Il componente <literal>FacesMessages</literal> agevola la visualizzazione di messaggi template di errore o di successo. (Da Seam 2.1, si puà impiegare <literal>StatusMessages</literal> invece di rimuovere la dipendenza semantica di JSF.) I componenti Seam predefiniti possono essere ottenuti tramite iniezione, o chiamando il metodo <literal>instance()</literal> sulla classe del componente predefinito.

source: Note that we did not explicitly specify a <literal>@Scope</literal> this time. Each Seam component type has a default scope if not explicitly specified. For stateless session beans, the default scope is the stateless context, which is the only sensible value.
it_it: Si noti che questa volta non si è esplicitamente specificato uno <literal>@Scope</literal>. Ciascun tipo di componente Seam ha uno scope di default se non esplicitamente specificato. Per bean di sessione stateless, lo scope di default è nel contesto stateless, che è l'unico valore sensato.
ja_jp: ここで、<literal>@Scope</literal> を明示的に指定していないことに留意してください。 各 Seam コンポーネントタイプは明示的にスコープが指定されない場合デフォルトのスコープが適用されます。 ステートレスセッション Bean のデフォルトスコープはステートレスコンテキストです。 これは単に理にかなった値です。

source: Our session bean action listener performs the business and persistence logic for our mini-application. In more complex applications, we might need require a separate service layer. This is easy to achieve with Seam, but it's overkill for most web applications. Seam does not force you into any particular strategy for application layering, allowing your application to be as simple, or as complex, as you want.
it_it: L'action listenere del bean di sessioni esegue la logica di persistenza e di business per quest'applicazione. In applicazioni più complesse, può essere opportuno separare il layer di servizio. Questo è facile da farsi in Seam, ma è critico per la maggior parte delle applicazioni web. Seam non forza nell'impiego di una particolare strategia per il layering dell'applicazione, consentendo di rimanere semplici o complessi a proprio piacimento.
ja_jp: このセッション Bean のアクションリスナーは、この小さなアプリケーションのビジネスロジックと永続ロジックを提供しています。 さらに複雑なアプリケーションでは、個別のサービスレイヤが必要かもしれません。 Seamで、これをするのは簡単ですが、 ほとんどの Web アプリケーションでは過剰です。 Seam は、アプリケーションのレイヤ化のために特殊な方法を強要しているのではなく、アプリケーションをより簡単に、また望むならばより複雑にすることを可能にしています。

source: Note that in this simple application, we've actually made it far more complex than it needs to be. If we had used the Seam application framework controllers, we would have eliminated all of our application code. However, then we wouldn't have had much of an application to explain.
it_it: Si noti che in questa semplice applicazione, abbiamo reso le cose di gran lunga più complicate di quanto necessario. Se si fossero impiegati i controllori di Seam, si sarebbe eliminato molto codice dell'applicazione. Comunque non avremmo avuto molto da spiegare.
ja_jp: このアプリケーションについて、私たちはこれまで実際に必要とされるよりはるかに複雑にしてきました。 Seam アプリケーションコントローラを利用していたならば、アプリケーションコードのほとんどを排除できたかもしれない。しかしながら、 当時、説明する多くのアプリケーションがありませんでした。

source: The session bean local interface: <literal>Register.java</literal>
it_it: Interfaccia locale del session bean: <literal>Register.java</literal>
ja_jp: セッション Bean ローカルインタフェース : <literal>Register.java</literal>

source: Naturally, our session bean needs a local interface.
it_it: Certamente il nostro session bean richiede un'interfaccia locale.
ja_jp: 当然、セッション Bean には、ローカルインタフェースが必要です。

source: That's the end of the Java code. Now we'll look at the view.
it_it: Questa è la fine del codice Java. Vediamo ora la vista.
ja_jp: Java コードは以上です。 次は ビューを見ましょう。

source: The view: <literal>register.xhtml</literal> and <literal>registered.xhtml</literal>
it_it: La vista: <literal>register.xhtml</literal> e <literal>registered.xhtml</literal>
ja_jp: ビュー : <literal>register.xhtml</literal> と <literal>registered.xhtml</literal>

source: The view pages for a Seam application could be implemented using any technology that supports JSF. In this example we use Facelets, because we think it's better than JSP.
it_it: Le pagine di vista di per un'applicazione Seam possono essere implementate usando qualsiasi tecnologia supporti JSF. In quest'esempio si usa Facelets, poiché noi pensiamo sia migliore di JSP.
ja_jp: Seam アプリケーションのビューページは、 JSF をサポートする多くの技術を使用して実装されています。 このサンプルでは、JSP より優れていると考えている Facelets を使用しています。

source: The only thing here that is specific to Seam is the <literal>&lt;s:validateAll&gt;</literal> tag. This JSF component tells JSF to validate all the contained input fields against the Hibernate Validator annotations specified on the entity bean.
it_it: L'unica cosa che qua è specifica di Seam è il tag <literal>&lt;s:validateAll&gt;</literal>. Questo componente JSF dice a JSFdi validare tutti i campi d'input contenuti con le annotazioni di Hibernate Validator specificate nell'entity bean.
ja_jp: ここで Seam 固有となるのは <literal>&lt;s:validateAll&gt;</literal> タグのみです。 この JSF コンポーネントは 含まれるすべての入力フィールドをエンティティ Bean で指定される Hibernate Validator アノテーションに対して検証するよう JSF に指示しています。

source: This is a simple Facelets page using some inline EL. There's nothing specific to Seam here.
it_it: Questa è una semplice pagina JSF che utilizza EL. Qua non c'è niente di specifico di Seam.

source: The Seam component deployment descriptor: <literal>components.xml</literal>
it_it: Il descrittore di deploy dei componenti Seam: <literal>components.xml</literal>
ja_jp: Seam コンポーネントデプロイメント記述子 : <literal>components.xml</literal>

source: Since this is the first Seam app we've seen, we'll take a look at the deployment descriptors. Before we get into them, it is worth noting that Seam strongly values minimal configuration. These configuration files will be created for you when you create a Seam application. You'll never need to touch most of these files. We're presenting them now only to help you understand what all the pieces in the example are doing.
it_it: "Poiché questa è la prima applicazione vista, si prenderanno in esame i descrittori di deploy. Ma prima di iniziare, vale la pena di notare che Seam apprezza molto una configurazione minimale. Questi file di configurazione verranno creati al momento della creazione di un'applicazione Seam. Non sarà mai necessario metter mano alla maggior parte di questi file. Qua vengono presentati solo per aiutare a capire tutti pezzi dell'esempio preso in considerazione.
ja_jp: はじめて Seam アプリを見るので、デプロイメント記述子も見てみます。 その話の前に、Seam が最小限の設定であることは注目に値します。 これらの設定ファイルは、Seamアプリケーションが作成されるときに生成されるものです。 あなたはほとんどこれらのファイルに触れる必要はないでしょう。 サンプルにおいてすべての要素が何をしているかを理解すること助けるためだけにこれらを提示しています。

source: If you've used many Java frameworks before, you'll be used to having to declare all your component classes in some kind of XML file that gradually grows more and more unmanageable as your project matures. You'll be relieved to know that Seam does not require that application components be accompanied by XML. Most Seam applications require a very small amount of XML that does not grow very much as the project gets bigger.
it_it: Se in precedenza si sono utilizzati altri framework Java, si è abituati a dichiarare le classi componenti in un qualche file XML che gradualmente cresce sempre più e diventa sempre più ingestibile man mano che il progetto evolve. Si resterà sollevati dal sapere che Seam non richiede che i componenti dell'applicazione siano accompagnati da file XML. La maggior parte delle applicazioni Seam richiede una quantità molto piccola di XML che non aumenta man mano che il progetto cresce.
ja_jp: 既に多くの Java フレームワークを使用した経験がある方なら、 プロジェクトが成熟するにつれ徐々に大きくなり管理し難くなる XML ファイルにコンポーネントクラスをすべてを宣言することにもそのうち慣れていくことでしょう。 Seam ではアプリケーションコンポーネントに XML を付随する必要がないこと知ったら、 きっとほっとすることでしょう。 大部分の Seam アプリケーションは、ほんの少しの XML しか必要としません。 また、 この XMLはプロジェクトが大きくなっていっても、 あまり大きくなりません。

source: Nevertheless, it is often useful to be able to provide for <emphasis>some</emphasis> external configuration of <emphasis>some</emphasis> components (particularly the components built in to Seam). You have a couple of options here, but the most flexible option is to provide this configuration in a file called <literal>components.xml</literal>, located in the <literal>WEB-INF</literal> directory. We'll use the <literal>components.xml</literal> file to tell Seam how to find our EJB components in JNDI:
it_it: Tuttavia è spesso utile fornire una <emphasis>qualche</emphasis> configurazione esterna per <emphasis>qualche</emphasis> componente (particolarmente per i componenti predefiniti di Seam). Ci sono due opzioni, ma l'opzione più flessibile è fornire questa configurazione in un file chiamato <literal>components.xml</literal>, collocato nella directory <literal>WEB-INF</literal>. Si userà il file <literal>components.xml</literal> per dire a Seam dove trovare i componenti EJB in JNDI:
ja_jp: それにもかかわらず、<emphasis>ある</emphasis>コンポーネントの<emphasis>ある</emphasis>外部設定の規定が可能であることは、 多くの場合、有用です (特に、Seam に組み込まれたコンポーネント)。 ここでは二つの選択があります。 しかし、最も柔軟性のある選択は <literal>WEB-INF</literal> ディレクトリに位置する <literal>components.xml</literal> と呼ばれるファイルに設定を規定することです。 Seam に JNDI で EJB コンポーネントの見つけ方を指示するためには <literal>components.xml</literal> ファイルを使用します。

source: This code configures a property named <literal>jndiPattern</literal> of a built-in Seam component named <literal>org.jboss.seam.core.init</literal>. The funny <literal>@</literal> symbols are there because our Ant build script puts the correct JNDI pattern in when we deploy the application, which it reads from the components.properties file. You learn more about how this process works in <xref linkend="xml.descriptor"/>.
it_it: Questo codice configura una proprietà chiamata <literal>jndiPattern</literal> di un componente Seam predefinito chiamato <literal>org.jboss.seam.core.init</literal>. Il divertente simbolo <literal>@</literal> viene impiegato poiché lo script di build Ant vi mette al suo posto il corretto JDNI pattern al momento del deploy dell'applicazione, ricavato dal file components.properties. Maggiori informazioni su questo processo in <xref linkend="xml.descriptor"/>.

source: The web deployment description: <literal>web.xml</literal>
it_it: La descrizione del deploy web: <literal>web.xml</literal>
ja_jp: WEB デプロイメント記述子 : <literal>web.xml</literal>

source: The presentation layer for our mini-application will be deployed in a WAR. So we'll need a web deployment descriptor.
it_it: Il layer di presentazione dell'applicazione verrà deployato in un WAR. Quindi sarà necessario un descrittore di deploy web.
ja_jp: ミニアプリケーションのプレゼンテーションレイヤは WAR にデプロイされます。 したがって、Web デプロイメント記述子が必要です。

source: This <literal>web.xml</literal> file configures Seam and JSF. The configuration you see here is pretty much identical in all Seam applications.
it_it: Il file <literal>web.xml</literal> configura Seam e JSF. La configurazione vista qua è più o meno la stessa in tutte le applicazioni Seam.
ja_jp: この <literal>web.xml</literal> ファイルは Seam と JSF を設定します。 ここで見る設定は Seam アプリケーションではいつも同じです。

source: The JSF configration: <literal>faces-config.xml</literal>
it_it: Configurazione JSF: <literal>faces-config.xml</literal>
ja_jp: JSF 設定 : <literal>faces-config.xml</literal>

source: Most Seam applications use JSF views as the presentation layer. So usually we'll need <literal>faces-config.xml</literal>. In our case, we are going to use Facelets for defining our views, so we need to tell JSF to use Facelets as its templating engine.
it_it: La maggior parte delle applicazioni Seam utilizza le viste JSF come layer di presentazione. Così solitamente si avrà bisogno di <literal>faces-config.xml</literal>. In ogni caso noi utilizzeremo Facelets per definire le nostre viste, così avremo bisogno di dire a JSF di usare Facelets come suo motore di template
ja_jp: ほとんどの Seam アプリケーションはプレゼンテーション層として JSF ビューを使用します。 従って通常 <literal>faces-config.xml</literal> が必要です。 この場合ビュー定義に Facelets を使用しますので、JSF にテンプレートエンジンとして Faceles を使用することを指定する必要があります。

source: Note that we don't need any JSF managed bean declarations! Our managed beans are annotated Seam components. In Seam applications, the <literal>faces-config.xml</literal> is used much less often than in plain JSF. Here, we are simply using it to enable Facelets as the view handler instead of JSP.
it_it: Si noti che non occorre alcuna dichiarazione di managed bean JSF! I managed bean sono componenti Seam annotati. Nelle applicazioni Seam, <literal>faces-config.xml</literal> è usato meno spesso che nel semplice JSF. Qua, viene usato per abilitare Faceltes come gestore di viste al posto di JSP.

source: In fact, once you have all the basic descriptors set up, the <emphasis>only</emphasis> XML you need to write as you add new functionality to a Seam application is orchestration: navigation rules or jBPM process definitions. Seam's stand is that <emphasis>process flow</emphasis> and <emphasis>configuration data</emphasis> are the only things that truly belong in XML.
it_it: Infatti una volta configurati tutti i descrittori base, l'<emphasis>unico</emphasis> XML necessario da scrivere per aggiungere nuove funzionalità ad un'applicazione Seam è quello per l'orchestrazione (orchestration): regole di navigazione o definizione di processi jBPM. Un punto fermo di Seam è che <emphasis>flusso di processo</emphasis> e <emphasis>configurazione dei dati</emphasis> siano le uniche cose che veramente appartengano alla sfera dell'XML.

source: In this simple example, we don't even need a navigation rule, since we decided to embed the view id in our action code.
it_it: Questo semplice esempio non è neppure stato necessario usare una regola di navigazione, poiché si è deciso di incorporare l'id della vista nel codice dell'azione.
ja_jp: この簡単なサンプルでは、 ビュー id をアクションコードに埋め込んだため、 ナビゲーション規則さえ不要です。

source: The EJB deployment descriptor: <literal>ejb-jar.xml</literal>
it_it: Descrittore di deploy EJB: <literal>ejb-jar.xml</literal>
ja_jp: EJB デプロイメント記述子 : <literal>ejb-jar.xml</literal>

source: The <literal>ejb-jar.xml</literal> file integrates Seam with EJB3, by attaching the <literal>SeamInterceptor</literal> to all session beans in the archive.
it_it: Il file <literal>ejb-jar.xml</literal> integra Seam con EJB3, attaccando <literal>SeamInterceptor</literal> a tutti i bean di sessione nell'archivio.
ja_jp: <literal>ejb-jar.xml</literal> ファイルは、 アーカイブ中のすべてのセッション Bean に <literal>SeamInterceptor</literal> を付加することによって EJB3 と統合します。

source: The EJB persistence deployment descriptor: <literal>persistence.xml</literal>
it_it: Descrittore di deploy per la persistenza EJB: <literal>persistence.xml</literal>
ja_jp: EJB 永続デプロイメント記述子 : <literal>persistence.xml</literal>

source: The <literal>persistence.xml</literal> file tells the EJB persistence provider where to find the datasource, and contains some vendor-specific settings. In this case, enables automatic schema export at startup time.
it_it: Il file <literal>persistence.xml</literal> dice all'EJB persistence provider dove trovare il datasource, e contiene alcune impostazioni vendor-specific. In questo caso abilita automaticamente l'esportazione dello schema all'avvio.
ja_jp: <literal>persistence.xml</literal> ファイルは、EJB 永続プロバイダに、 データソースの場所を指示します。また、ベンダー固有の設定を含んでいます。 このサンプルでは起動時に自動スキーマエキスポートを可能としています。

source: The EAR deployment descriptor: <literal>application.xml</literal>
it_it: Descrittore di deploy EAR: <literal>application.xml</literal>
ja_jp: EAR デプロイメント記述子 : <literal>application.xml</literal>

source: Finally, since our application is deployed as an EAR, we need a deployment descriptor there, too.
it_it: Infine poiché l'applicazione viene deployata come EAR, occorre anche un descrittore di deploy.
ja_jp: 最後に、EARとして アプリケーションがデプロイされるため、デプロイメント記述子も必要になります。

source: registration application
it_it: applicazione di registrazione
ja_jp: ユーザー登録アプリケーション

source: This deployment descriptor links modules in the enterprise archive and binds the web application to the context root <literal>/seam-registration</literal>.
it_it: Questo descrittore di deploy punta a moduli nell'archivio enterprise ed associa l'applicazione web al contesto radice <literal>/seam-registration</literal>.
ja_jp: このデプロイメント記述子はエンタープライズアーカイブのモジュールとリンクし、 WEBアプリケーションをコンテキストルート <literal>/seam-registration</literal> にバインドします。

source: We've now seen <emphasis>all</emphasis> the files in the entire application!
it_it: Adesso sono stati analizzati tutti i file dell'intera applicazione!
ja_jp: これで私たちはアプリケーションにある<emphasis>すべて</emphasis>のファイルを見ました！

source: How it works
it_it: Come funziona
ja_jp: 動作内容

source: When the form is submitted, JSF asks Seam to resolve the variable named <literal>user</literal>. Since there is no value already bound to that name (in any Seam context), Seam instantiates the <literal>user</literal> component, and returns the resulting <literal>User</literal> entity bean instance to JSF after storing it in the Seam session context.
it_it: Quando la form viene inviata, JSF chiede a Seam di risolvere la variabile chiamata <literal>user</literal>. Poiché non c'è alcun valore associato a questo nome (in un qualsiasi contesto Seam), Seam istanzia il componente <literal>user</literal> e restituisce a JSF un'istanza dell'entity bean <literal>User</literal> dopo averla memorizzata nel contesto Seam di sessione.
ja_jp: フォームがサブミットされたとき、 JSF は、Seam に <literal>user</literal> という名前の変数を解決するよう要求します。 その名前にバインドされた値が存在しないため (どの Seam コンテキストにも)、 Seam は、<literal>user</literal> コンポーネントをインスタンス化し、 それを Seam セッションコンテキストに保管した後に、 <literal>User</literal> エンティティ Bean インスタンスを JSF に返します。

source: The form input values are now validated against the Hibernate Validator constraints specified on the <literal>User</literal> entity. If the constraints are violated, JSF redisplays the page. Otherwise, JSF binds the form input values to properties of the <literal>User</literal> entity bean.
it_it: I valori di input della form vengono ora validati dai vincoli di Hibernate Validator specificati nell'entity <literal>User</literal>. Se i vincoli vengono violati, JSF rivisualizza la pagina, Altrimenti, JSF associa i valori di input alle proprietà dell'entity bean <literal>User</literal>.
ja_jp: フォームの入力値は、 <literal>User</literal> エンティティで指定された Hibernate Validator 制約に対してデータ整合性検証が行われるようになります。 制約に違反していると JSF はそのページを再表示します。 これ以外は、 フォームの入力値を <literal>User</literal> エンティティ Bean のプロパティにバインドします。

source: Next, JSF asks Seam to resolve the variable named <literal>register</literal>. Seam uses the JNDI pattern mentioned earlier to locate the stateless session bean, wraps it as a Seam component, and returns it. Seam then presents this component to JSF and JSF invokes the <literal>register()</literal> action listener method.
it_it: Successivamente JSF chiede a Seam di risolvere la variabile chiamata <literal>register</literal>. Seam utilizza il pattern JNDI menzionato in precedenza per localizzare il session bean stateless, lo impiega come componente Seam tramite il wrap e lo restituisce. Seam quindi presenta questo componente a JSF e JSF invoca il metodo action listener <literal>register()</literal>.
