Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Tutorial.po
Languages: it_it, ja_jp

source: The first time a JSP page asks for a <literal>numberGuess</literal> component, Seam will create a new one for it, and the <literal>@Create</literal> method will be invoked, allowing the component to initialize itself.
it_it: La prima volta che una pagina JSP richiede un componente <literal>numberGuess</literal>, Seam ne crea uno nuovo, ed il metodo <literal>@Create</literal> viene invocato, consentendo che il componente si inizializzi.
ja_jp: 最初に、JSP ページが <literal>numberGuess</literal> コンポーネントを要求するとき、 Seam は新しいコンポーネントを生成します。 そして、<literal>@Create</literal> メソッドが呼ばれ、 コンポーネント自身の初期化が可能になります。

source: The <literal>pages.xml</literal> file starts a Seam <emphasis>conversation</emphasis> (much more about that later), and specifies the pageflow definition to use for the conversation's page flow.
it_it: Il file <literal>pages.xml</literal> inizia una <emphasis>conversazione</emphasis> Seam (maggiori informazioni più avanti), e specifica la definizione pageflow da usare per il flusso delle pagine della conversazione.
ja_jp: <literal>pages.xml</literal> ファイルは Seam <emphasis>対話 (conversation)</emphasis> を開始し ( 詳細は後述 )、対話のページフローを使用するためのページフロー定義を規定します。

source: As you can see, this Seam component is pure business logic! It doesn't need to know anything at all about the user interaction flow. This makes the component potentially more reuseable.
it_it: Come si può vedere, questo componente Seam è pura logica di business! Non ha bisogno di sapere niente riguardo il flusso delle interazioni utente. Questo rende il componente potenzialmente più riutilizzabile.
ja_jp: 見てわかるように、この Seam コンポーネントは純粋なビジネスロジックです! ユーザーインタラクションのフローについて理解する必要はまったくありません。 これによりコンポーネント再利用性を本当に向上させます。

source: We'll step through basic flow of the application. The game starts with the <literal>numberGuess.jspx</literal> view. When the page is first displayed, the <literal>pages.xml</literal> configuration causes conversation to begin and associates the <literal>numberGuess</literal> pageflow with that conversation. The pageflow starts with a <literal>start-page</literal> tag, which is a wait state, so the <literal>numberGuess.xhtml</literal> is rendered.
it_it: Si analizzerà ora il flusso base dell'applicazione. Il gioco comincia con la vista <literal>numberGuess.jspx</literal>. Quando la pagina viene mostrata la prima volta, la configurazione <literal>pages.xml</literal> porta ad iniziare la conversazione ed associa il pageflow <literal>numberGuess</literal> a tale conversazione. Il pageflow inizia con un tag <literal>start-page</literal> che è uno stato d'attesa, e poi viene visualizzata la pagina <literal>numberGuess.xhtml</literal>.
ja_jp: アプリケーションの基本的なフローを見てみましょう。 ゲームは <literal>numberGuess.jspx</literal> から始まります。 始めてページが表示されたとき、<literal>pages.xml</literal> 設定は対話を開始させ <literal>numberGuess</literal> ページフローを対話と関連付けます。 ページフローは 待機状態である<literal>start-page</literal> から開始されるので <literal>numberGuess.xhtml</literal> が表示されます。

source: The view references the <literal>numberGuess</literal> component, causing a new instance to be created and stored in the conversation. The <literal>@Create</literal> method is called, initializing the state of the game. The view displays an <literal>h:form</literal> that allows the user to edit <literal>#{numberGuess.currentGuess}</literal>.
it_it: La vista fa riferimento al componente <literal>numberGuess</literal>, provocando la creazione di una nuova istanza e la sua memorizzazione all'interno della conversazione. Viene chiamato il metodo <literal>@Create</literal> che inizializza lo stato del gioco. La vista mostra un <literal>h:form</literal> per consentire all'utente di editare <literal>#{numberGuess.currentGuess}</literal>.
ja_jp: ビューは <literal>numberGuess</literal> コンポーネントを参照します。 その結果新しいインスタンスが生成され対話に保管されます。 <literal>@Create</literal> メソッドが呼ばれゲームの状態が初期化されます。 ビューはユーザーが <literal>#{numberGuess.currentGuess}</literal> を編集可能な <literal>h:form</literal> を表示します。

source: The "Guess" button triggers the <literal>guess</literal> action. Seam defers to the pageflow to handle the action, which says that the pageflow should transition to the <literal>evaluateGuess</literal> state, first invoking <literal>#{numberGuess.guess}</literal>, which updates the guess count and highest/lowest suggestions in the <literal>numberGuess</literal> component.
it_it: Il pulsante "Guess" lancia l'azione <literal>guess</literal>. Seam usa il pageflow per gestire l'azione, la quale impone che il pageflow transiti allo stato <literal>evaluateGuess</literal>, innanzitutto invocando <literal>#{numberGuess.guess}</literal> che aggiorna il contatore ed i suggerimenti più alto/più basso nel componente <literal>numberGuess</literal>.
ja_jp: "Guess" ボタンは <literal>guess</literal> アクションを呼び起こします。 Seam はアクションを処理するためにページフローに従います。それはページフローが <literal>evaluateGuess</literal> 状態に遷移することを命じます。 最初の呼び出し <literal>#{numberGuess.guess}</literal> は guess count と <literal>numberGuess</literal> コンポーネント中の highest/lowest suggestions を更新します。

source: The <literal>evaluateGuess</literal> state checks the value of <literal>#{numberGuess.correctGuess}</literal> and transitions either to the <literal>win</literal> or <literal>evaluatingRemainingGuesses</literal> state. We'll assume the number was incorrect, in which case the pageflow transitions to <literal>evaluatingRemainingGuesses</literal>. That is also a decision state, which tests the <literal>#{numberGuess.lastGuess}</literal> state to determine whether or not the user has more guesses. If there are more guesses (<literal>lastGuess</literal> is <literal>false</literal>), we transition back to the original <literal>displayGuess</literal> state. Finally we've reached a page state, so the associated page <literal>/numberGuess.jspx</literal> is displayed. Since the page has a redirect element, Seam sends a redirect to the the user's browser, starting the process over.
it_it: Lo stato <literal>evaluateGuess</literal> controlla il valore di <literal>#{numberGuess.correctGuess}</literal> e le transizioni agli stati <literal>win</literal> o <literal>evaluatingRemainingGuesses</literal>. Si assumache ilnumero sia sbagliato, nel qual caso il pageflow transita verso <literal>evaluatingRemainingGuesses</literal>. Questo è anche uno stato di decisione, che testa lo stato <literal>#{numberGuess.lastGuess}</literal> per determinare se l'utente ha ulteriori tentativi oppure no. Se ne ha (<literal>lastGuess</literal> è <literal>falso</literal>), si torna allo stato originale <literal>displayGuess</literal>. Infine si raggiunge lo stato page, e quindi viene mostrata la pagina associata <literal>/numberGuess.jspx</literal>. Poiché la pagina ha un elemento redirect, Seam invia un redirect al browser dell'utente, ricominciando il processo.
ja_jp: <literal>evaluateGuess</literal> 状態は <literal>#{numberGuess.correctGuess}</literal> の値をチェックし <literal>win</literal> または <literal>evaluatingRemainingGuesses</literal> 状態に遷移させます。 数字が間違っていたとすると、その場合ページフローは <literal>evaluatingRemainingGuesses</literal> に遷移します。 それは decision 状態であり、 ユーザーがまだ数字当てをするか否かを決定するために <literal>#{numberGuess.lastGuess}</literal> をテストします。 まだ数字あてをするならば ( <literal>lastGuess</literal> が <literal>false</literal> )、最初の <literal>displayGuess</literal> 状態に遷移させます。 最後に、page 状態に達し、関連するページ <literal>/numberGuess.jspx</literal> が表示されます。ページは redirect 要素を持っているので、Seam はユーザーのブラウザにリダイレクトを送信しプロセスを再始動させます。

source: We won't follow the state any more except to note that if on a future request either the <literal>win</literal> or the <literal>lose</literal> transition were taken, the user would be taken to either the <literal>/win.jspx</literal> or <literal>/lose.jspx</literal>. Both states specify that Seam should end the conversation, tossing away all the game state and pageflow state, before redirecting the user to the final page.
it_it: Non si analizzerà ulteriormente lo stato, tranne per notare che se in una richiesta futura venisse presa la transizione <literal>win</literal> oppure <literal>lose</literal>, l'utente verrebbe portato a <literal>/win.jspx</literal> oppure <literal>/lose.jspx</literal>. Entrambi gli stati specificano che Seam debba terminare la conversazione, liberandosi dello stato del gioco e di quello del pageflow, prima di reindirizzare l'utente alla pagina finale.
ja_jp: 以降の要求により <literal>win</literal> または <literal>lose</literal> に遷移する状態以外これ以上状態については説明しません。つまりユーザーが <literal>/win.jspx</literal> または <literal>/lose.jspx</literal> を取得することについてです。 両方の状態は Seam が対話を終了し、ユーザーに最終ページをリダイレクトする前に、ゲームの状態やページフローの状態を破棄することを規定しています。

source: The numberguess example also contains Giveup and Cheat buttons. You should be able to trace the pageflow state for both actions relatively easily. Pay particular attention to the <literal>cheat</literal> transition, which loads a sub-process to handle that flow. Although it's overkill for this application, it does demonstrate how complex pageflows can be broken down into smaller parts to make them easier to understand.
it_it: L'esempio indovina-numero contiene anche i pulsanti Giveup (abbandona) e Cheat (imbroglia). Si dovrebbe essere facilmente in grado di tracciare lo stato pageflow per le relative azioni. Si presti attenzione alla transizione <literal>cheat</literal>, che carica un sotto-processo per gestire tale flusso. Sebbene sia superfluo per quest'applicazione, questo dimostra come pageflow complessi possano venire spezzati in parti più piccole per renderle più facili da capire.

source: A complete Seam application: the Hotel Booking example
it_it: Un'applicazione Seam completa: esempio di Prenotazione Hotel
ja_jp: 本格的 Seam アプリケーション: ホテル予約サンプル

source: Introduction
it_it: Introduzione
ja_jp: はじめに

source: The booking application is a complete hotel room reservation system incorporating the following features:
it_it: L'applicazione booking (prenotazione) è un sistema completo per la prenotazione di camere d'hotel, ed incorpora le seguenti funzionalità:
ja_jp: この予約アプリケーションは以下の特徴を持つ本格的なホテルの部屋予約システムです。

source: User registration
it_it: Registrazione utente
ja_jp: ユーザー登録

source: Set password
it_it: Impostazione password
ja_jp: パスワード設定

source: Hotel search
it_it: Ricerca hotel
ja_jp: ホテル検索

source: Hotel selection
it_it: Scelta hotel
ja_jp: ホテル選択

source: Room reservation
it_it: Prenotazione stanza
ja_jp: 部屋予約

source: Reservation confirmation
it_it: Conferma prenotazione
ja_jp: 予約確認

source: Existing reservation list
it_it: Lista di prenotazioni esistenti
ja_jp: 現状の予約一覧

source: Booking example
it_it: Esempio di prenotazione

source: The booking application uses JSF, EJB 3.0 and Seam, together with Facelets for the view. There is also a port of this application to JSF, Facelets, Seam, JavaBeans and Hibernate3.
it_it: L'applicazione booking utilizza JSF, EJB 3.0 e Seam, assieme a Facelets per la vista. C'è anche un port di quest'applicazione con JSF, Facelets, Seam, JavaBeans e Hibernate3.
ja_jp: この予約アプリケーションは JSF、EJB 3.0、Seam とともにビューとして Facelet を使用しています。 JSF、Facelets、Seam、JavaBeans そして、Hibernate3 のアプリケーションの移植版もあります

source: One of the things you'll notice if you play with this application for long enough is that it is extremely <emphasis>robust</emphasis>. You can play with back buttons and browser refresh and opening multiple windows and entering nonsensical data as much as you like and you will find it very difficult to make the application crash. You might think that we spent weeks testing and fixing bugs to achive this. Actually, this is not the case. Seam was designed to make it very straightforward to build robust web applications and a lot of robustness that you are probably used to having to code yourself comes naturally and automatically with Seam.
it_it: Una delle cose che si noteranno utilizzando quest'applicazione per qualche tempo è che questa risulta essere estremamente <emphasis>robusta</emphasis>. Si può giocare con il pulsante indietro ed aggiornare le pagine, aprire più finestre ed inserire dati senza senso quanto si vuole, ma si vedrà che è molto difficile mettere in difficoltà l'applicazione. Si può pensare che siano occorse settimane per testare e risolvere bug prima di raggiungere questo risultato. In verità non è così. Seam è stato progettato per rendere semplice la costruzione di applicazioni web robuste, e molta della robustezza che si è soliti doversi codificare da soli, con Seam viene naturale e automatica.
ja_jp: このアプリケーションをある程度の期間、 いじってわかることの一つはそれがとても<emphasis>堅牢</emphasis>であることです。 戻るボタンを操作してもブラウザの更新をしても複数のウィンドを開いても無意味なデータを好きなだけ入力してもアプリケーションをクラッシュさせることがとても困難であることがわかります。 これを達成するためにテストやバグ取りに何週間も掛かったと思われるかもしれませんが、 実際にはそんなことはありません。 Seam は、堅牢な WEB アプリケーションを簡単に構築できるように設計されています。 そして、これまでコーディングそのものによって得られていた堅牢性は Seam を使用することで自然かつ自動的に得られます。

source: As you browse the sourcecode of the example application, and learn how the application works, observe how the declarative state management and integrated validation has been used to achieve this robustness.
it_it: Quando si sfoglia il codice sorgente delle applicazioni e si impara come questa funziona, si osservi come sono stati usati la gestione dichiarativa dello stato e la validazione integrata per ottenere questa robustezza.
ja_jp: サンプルアプリケーションのコードを見れば、 どのようにアプリケーションが動作しているか習得できます。 そして、この堅牢性の達成するために、 どのように宣言的状態管理や統合されたデータ妥当性検証が使用されているかを見ることができます。

source: Overview of the booking example
it_it: Panoramica sull'esempio di prenotazione
ja_jp: 予約サンプルの概要

source: The project structure is identical to the previous one, to install and deploy this application, please refer to <xref linkend="try-examples"/>. Once you've successfully started the application, you can access it by pointing your browser to <ulink url="http://localhost:8080/seam-booking/"> <literal>http://localhost:8080/seam-booking/</literal> </ulink>
it_it: La struttura del progetto è identica al precedente, per installare e deployare quest'applicazione, si faccia riferimento a <xref linkend="try-examples"/>. Una volta avviata l'applicazione, si può accedere a questa puntando il browser all'indirizzo <ulink url="http://localhost:8080/seam-booking/"> <literal>http://localhost:8080/seam-booking/</literal> </ulink>
ja_jp: プロジェクトの構成はこれまでのものと同じです。 このアプリケーションをインストールするには、<xref linkend="try-examples"/> を参照してください。 うまくアプリケーションが起動したならば、 ブラウザから <ulink url="http://localhost:8080/seam-booking/"> <literal>http://localhost:8080/seam-booking/</literal> </ulink>を指定してアクセス可能です。

source: The application uses six session beans for to implement the business logic for the listed features.
it_it: L'applicazione utilizza sei bean di sessione per implementare la logica di business per le funzionalità nella lista.
ja_jp: このアプリケーションは以下の機能を実装するビジネスロジックのために 6 つのセッション Bean を使用しています。

source: <literal>AuthenticatorAction</literal> provides the login authentication logic.
it_it: <literal>AuthenticatorAction</literal> fornisce la logica per l'autenticazione della login.
ja_jp: <literal>AuthenticatorAction</literal> はログイン認証ロジックを提供します。

source: <literal>BookingListAction</literal> retrieves existing bookings for the currently logged in user.
it_it: <literal>BookingListAction</literal> recupera le prenotazioni esistenti per l'utente attualmente loggato.
ja_jp: <literal>BookingListAction</literal> は、その時のログインユーザーのために現状の予約を取得します。

source: <literal>ChangePasswordAction</literal> updates the password of the currently logged in user.
it_it: <literal>ChangePasswordAction</literal> aggiorna la password per l'utente attualmente loggato.
ja_jp: <literal>ChangePasswordAction</literal> は、その時のログインユーザーのパスワードを変更します。

source: <literal>HotelBookingAction</literal> implements booking and confirmation functionality. This functionality is implemented as a <emphasis>conversation</emphasis>, so this is one of the most interesting classes in the application.
it_it: <literal>HotelBookingAction</literal> implementa le funzionalità di prenotazione e conferma. Questa funzionalità è implementata come <emphasis>conversazione</emphasis>, e quindi è una delle classi più interessanti dell'applicazione.
ja_jp: <literal>HotelBookingAction</literal> は、アプリケーションの中核的機能を実装します。 この機能は <emphasis>対話</emphasis> として実装されるため、 このアプリケーションの中でもっとも興味を引くクラスです。

source: <literal>HotelSearchingAction</literal> implements the hotel search functionality.
it_it: <literal>HotelSearchingAction</literal> implementa la funzionalità di ricerca hotel.
ja_jp: <literal>HotelSearchingAction</literal> はホテル検索を実装しています。

source: <literal>RegisterAction</literal> registers a new system user.
it_it: <literal>RegisterAction</literal> registra un nuovo utente di sistema.
ja_jp: <literal>RegisterAction</literal> は、新しいシステムユーザーを登録します。

source: Three entity beans implement the application's persistent domain model.
it_it: Tre entity bean implementano il modello di dominio di persistenza dell'applicazione.
ja_jp: 三つのエンティティ Bean はアプリケーション永続ドメインモデルを実装しています。

source: <literal>Hotel</literal> is an entity bean that represent a hotel
it_it: <literal>Hotel</literal> è un entity bean che rappresenta un hotel
ja_jp: <literal>Hotel</literal> はホテルを表現するエンティティ Bean です。

source: <literal>Booking</literal> is an entity bean that represents an existing booking
it_it: <literal>Booking</literal> è l'entity bean che rappresenta una prenotazione esistente
ja_jp: <literal>Booking</literal> は、現状の予約を表すエンティティ Bean です。

source: <literal>User</literal> is an entity bean to represents a user who can make hotel bookings
it_it: <literal>User</literal> è un entity bean che rappresenta un utente che può fare una prenotazione
ja_jp: <literal>User</literal> は、ホテル予約ができるユーザーを表すエンティティ Bean です。

source: Understanding Seam conversations
it_it: Capire le conversazioni in Seam
ja_jp: Seam 対話の理解

source: We encourage you browse the sourcecode at your pleasure. In this tutorial we'll concentrate upon one particular piece of functionality: hotel search, selection, booking and confirmation. From the point of view of the user, everything from selecting a hotel to confirming a booking is one continuous unit of work, a <emphasis>conversation</emphasis>. Searching, however, is <emphasis>not</emphasis> part of the conversation. The user can select multiple hotels from the same search results page, in different browser tabs.
it_it: Si incoraggia a guardare il codice sorgente a piacimento. In questo tutorial ci concentreremo su alcune particolari funzionalità: ricerca hotel, selezione, prenotazione e conferma. Dal punto di vista dell'utente, tutto - dalla selezione dell'hotel alla conferma dellaprenotazione - è un'unica continua unità di lavoro, una <emphasis>conversazione</emphasis>. La ricerca, comunque, <emphasis>non</emphasis> è una parte della conversazione. L'utente può selezionare più hotel dalla stessa pagina dei risultati, in diversi tab del browser.
ja_jp: 気が向いたならばソースコードを読まれることをお勧めします。 このチュートリアルでは、特定の機能つまりホテル検索、選択、予約と確認を集中して説明します。 ユーザーの視点から見ると、 ホテルの選択から予約確認までのすべては、一つの連続した仕事の単位、 つまり<emphasis>対話</emphasis>です。 しかし、検索は対話の一部では<emphasis>ありません</emphasis>。 ユーザーは異なるブラウザタブで同じ検索結果のページから複数のホテルを選択可能です。

source: Most web application architectures have no first class construct to represent a conversation. This causes enormous problems managing conversational state. Usually, Java web applications use a combination of several techniques. Some state can be transfered in the URL. What can't is either thrown into the <literal>HttpSession</literal> or flushed to the database after every request, and reconstructed from the database at the beginning of each new request.
it_it: La maggior parte delle architetture delle applicazioni non ha alcun costrutto per rappresentare una conversazione. Questo causa enormi problemi nella gestione dello stato conversazionale. Solitamente le applicazioni web Java usano una combinazione di diverse tecniche. Alcuni stati possono essere trasferiti nell'URL. Ciò che non può è messo o in <literal>HttpSession</literal> o mandato a database dopo ogni richiesta, e ricostruito dal database all'inizio di ogni nuova richiesta.
ja_jp: ほとんどの WEB アプリケーションのアーキテクチャは対話を扱うためのファーストクラスの構造を持っていません。 これは対話の状態を管理するために重大な問題となります。通常、Java WEB アプリケーションは二つの技術を組み合わせて使用します。 ある状態は URL に変換可能です。 不可能なものはすべての要求の後に <literal>HttpSession</literal> に投げられるかあるいはデータベースにフラッシュされます。そしてすべての新しい要求の最初にデータベースから再構築されます。

source: Since the database is the least scalable tier, this often results in an utterly unacceptable lack of scalability. Added latency is also a problem, due to the extra traffic to and from the database on every request. To reduce this redundant traffic, Java applications often introduce a data (second-level) cache that keeps commonly accessed data between requests. This cache is necessarily inefficient, because invalidation is based upon an LRU policy instead of being based upon when the user has finished working with the data. Furthermore, because the cache is shared between many concurrent transactions, we've introduced a whole raft of problem's associated with keeping the cached state consistent with the database.
it_it: Poiché il database è il livello meno scalabile, questo risulta essere spesso ad un livello inaccettabile di scalabilità. La latenza è un ulteriore problema, dovuto al traffico extra verso e dal database ad ogni richiesta. Per ridurre questo traffico ridondante, le applicazioni Java spesso introducono una cache di dati (di secondo livello) che mantiene i dati comunemente acceduti tra le varie richieste. Questa cache è necessariamente inefficiente, poiché l'invalidazione è basato su una policy LRU invece di essere basata su quando l'utente termina di lavorare con i dati. Inoltre, poiché la cache è condivisa da diverse transazioni concorrenti, si è introdotta una schiera di problemi associati al fatto di mantenere lo stato della cache consistente con il database.
ja_jp: データベースは最もスケーラビリティに乏しい層なので、 許容不能なほどスケーラビリティに乏しい結果となることがよくあります。 要求ごとデータベースを行き来する転送量が増加すると、追加される待ち時間も問題となります。この冗長な転送量を減少させるために、Java アプリケーションでは要求間でよくアクセスされるデータを保管するデータキャッシュ (2 次レベル) をしばしば導入します。 このキャッシュは必ずしも効率的ではありません。 なぜならデータが無効かどうかの判断をユーザーがデータの操作を終了したかどうかをもとにして行うのではなく LRU ポリシーをベースとして行うためです。 さらに、 キャッシュは多くの並列トランザクション間で共有されるので、 キャッシュされた状態とデータベース間の一貫性維持に関する多くの問題をも取り入れてしまうことになるためです。
