Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Tutorial.po
Languages: it_it, ja_jp

source: Seam Tutorial
it_it: Tutorial di Seam
ja_jp: Seam チュートリアル

source: Using the Seam examples
it_it: Utilizzo degli esempi di Seam
ja_jp: Seam サンプルを使用する

source: Seam provides a number of example applications demonstrating how to use the various features of Seam. This tutorial will guide you through a few of those examples to help you get started learning Seam. The Seam examples are located in the <filename>examples</filename> subdirectory of the Seam distribution. The registration example, which will be the first example we look at, is in the <filename>examples/registration</filename> directory.
it_it: Seam fornisce un ampio numero di applicazioni d'esempio per mostrare l'uso delle varie funzionalità di Seam. Questo tutorial ti guiderà attraverso alcuni di questi esempi per aiutarti nell'apprendimento di Seam. Gli esempi di Seam sono posizionati nella sottodirectory <filename>examples</filename> della distribuzione Seam. L'esempio di registrazione, che è il primo esempio che vediamo, si trova nella directory <filename>examples/registration</filename>.
ja_jp: Seam は Seam のさまざまな機能の利用方法を実演する多くのサンプルアプリケーションを提供しています。 このチュートリアルはこれらのサンプルを通してあなたが Seam を学び始めるための案内をします。Seam サンプルは Seam ディストリビューションの <filename>examples</filename> サブディレクトリに置かれています。 初めて見るユーザー登録サンプルは、<filename>examples/registration</filename> ディレクトリにあります。

source: Each example has the same directory structure:
it_it: Ciascun esempio ha la medesima struttura di directory:
ja_jp: 各サンプルは同じディレクトリの構造をしています。

source: The <filename>view</filename> directory contains view-related files such as web page templates, images and stylesheets.
it_it: La directory <filename>view</filename> contiene i file relativi alla vista come template di pagine web, immagini e fogli di stile.
ja_jp: The <filename>view</filename> ディレクトリにはWebページテンプレート、イメージ、スタイルシートなどビュー関連のファイルが入っています。

source: The <filename>resources</filename> directory contains deployment descriptors and other configuration files.
it_it: La directory <filename>resources</filename> contiene i descrittori per il deploy ed altri file di configurazione.
ja_jp: <filename>resources</filename> ディレクトリにはデプロイメント記述子やその他の構成ファイルが入っています。

source: The <filename>src</filename> directory contains the application source code.
it_it: La directory <filename>src</filename> contiene il codice sorgente dell'applicazione.
ja_jp: <filename>src</filename> ディレクトリにはアプリケーションソースコードが入っています。

source: The example applications run both on JBoss AS and Tomcat with no additional configuration. The following sections will explain the procedure in both cases. Note that all the examples are built and run from the Ant <filename>build.xml</filename>, so you'll need a recent version of Ant installed before you get started.
it_it: Le applicazioni d'esempio girano sia su JBoss AS sia su Tomcat senza configurazioni aggiuntive. Le sezioni seguenti spiegano la procedura in entrambi i casi. Nota che tutti gli esempi sono costruiti ed eseguiti da <filename>build.xml</filename> di Ant, e quindi ti servirà installata una versione recente di Ant prima di iniziare.
ja_jp: サンプルアプリケーションは追加設定することなく JBoss AS と Tomcat で動作します。 これからの章では両方のケースの手順を説明します。 Ant <filename>build.xml</filename> によりビルドと起動を行いますから、始める前に最新の Ant をインストールする必要があることに留意してください。

source: Running the examples on JBoss AS
it_it: Eseguire gli esempi in JBoss AS
ja_jp: JBoss AS 上でのサンプルの実行

source: The examples are configured for use on JBoss AS 4.2 or 5.0. You'll need to set <literal>jboss.home</literal>, in the shared <literal>build.properties</literal> file in the root folder of your Seam installation, to the location of your JBoss AS installation.
it_it: Gli esempi sono configurati per usare JBoss 4.2 o 5.0. Dovrai impostare la variabile <literal>jboss.home</literal> affinché punti alla locazione dell'installazione di JBoss AS. Questa variabile si trova nel file condiviso <literal>build.properties</literal> nella cartella radice dell'installazione di Seam.

source: Once you've set the location of JBoss AS and started the application server, you can build and deploy any example by typing <literal>ant explode</literal> in the the directory for that example. Any example that is packaged as an EAR deploys to a URL like <literal>/seam-<replaceable>example</replaceable></literal>, where <replaceable>example</replaceable> is the name of the example folder, with one exception. If the example folder begins with seam, the prefix "seam" is ommitted. For instance, if JBoss AS is running on port 8080, the URL for the registration example is <ulink url="http://localhost:8080/seam-registration/"> <literal>http://localhost:8080/seam-registration/</literal></ulink>, whereas the URL for the seamspace example is <ulink url="http://localhost:8080/seam-space/"> <literal>http://localhost:8080/seam-space/</literal></ulink>.
it_it: Una volta impostata la locazione di JBoss AS ed avviato il server, si può eseguire il build ed il deploy degli esempi semplicemente scrivendo <literal>ant explode</literal> nella directory dell'esempio. Ogni esempio che viene impacchettato come EAR viene messo in un URL del tipo <literal>/seam-<replaceable>example</replaceable></literal>, dove <replaceable>example</replaceable> è il nome della cartella dell'esempio, con una eccezione. Se la cartella d'esempio inizia con seam, il prefisso "seam" viene omesso. Per esempio, se JBoss AS gira sulla porta 8080, l'URL per l'esempio registrazione è <ulink url="http://localhost:8080/seam-registration/"> <literal>http://localhost:8080/seam-registration/</literal></ulink>, mentre l'URL per l'esempio seamspace è <ulink url="http://localhost:8080/seam-space/"> <literal>http://localhost:8080/seam-space/</literal></ulink>.

source: If, on the other hand, the example gets packaged as a WAR, then it deploys to a URL like <literal>/jboss-seam-<replaceable>example</replaceable></literal>. Most of the examples can be deployed as a WAR to Tomcat with Embedded JBoss by typing <literal>ant tomcat.deploy</literal>. Several of the examples can only be deployed as a WAR. Those examples are groovybooking, hibernate, jpa, and spring.
it_it: Se, dall'altro lato, l'esempio viene impacchettato come WAR, allora viene messo in un URL del tipo <literal>/jboss-seam-<replaceable>example</replaceable></literal>. La maggior parte degli esempi può essere messa come WAR in Tomcat con JBoss Embedded digitando <literal>ant tomcat.deploy</literal>. Diversi esempi possono venire deployati solo come WAR. Questi esempi sono groovybooking, hibernate, jpa, and spring.

source: Running the examples on Tomcat
it_it: Eseguire gli esempi in Tomcat
ja_jp: Tomcat 上でのサンプル実行

source: The examples are also configured for use on Tomcat 6.0. You will need to follow the instructions in <xref linkend="config.install.embedded"/> for installing JBoss Embedded on Tomcat 6.0. JBoss Embedded is only required to run the Seam demos that use EJB3 components on Tomcat. There are also examples of non-EJB3 applications that can be run on Tomcat without the use of JBoss Embedded.
it_it: Questi esempi sono configurati anche per essere usati in Tomcat 6.0. Occorreràseguire le istruzioni in <xref linkend="config.install.embedded"/> per installare JBoss Embedded in Tomcat 6.0. JBoss Embedded è richiesto per eseguire le demo di Seam che usano componenti EJB3 in Tomcat. Ci sono anche esempio di applicazioni non-EJB3 che possono funzionare in Tomcat senza JBoss Embedded.
ja_jp: サンプルは Tomcat 6.0 用にも構成されています。Tomcat 6.0 組み込み JBossへのインストールは <xref linkend="config.install.embedded"/> のインストラクションに従う必要があります。 組み込み JBoss は Tomcat 上で EJB3コンポーネントを利用する Seam デモを動作させるためだけに必要です。 組み込み JBoss を利用しない Tomcat 上で動作可能な non-EJB3 サンプルもあります。

source: You'll need to set <literal>tomcat.home</literal>, in the shared <literal>build.properties</literal> file in the root folder of your Seam installation, to the location of your Tomcat installation. make sure you set the location of your Tomcat.
it_it: Occorrerà impostare al percorso di Tomcat la variabile <literal>tomcat.home</literal>, la quale si trova nel file condiviso <literal>build.properties</literal> della cartella padre nell'installazione di Seam.
ja_jp: Seam のインストレーションのルートフォルダ内 <literal>build.properties</literal> ファイル中の <literal>tomcat.home</literal> に Tomcat のインストレーションの場所を設定する必要があります。 Tomcat の場所を設定したことを確かめてください。

source: You'll need to use a different Ant target when using Tomcat. Use <literal>ant tomcat.deploy</literal> in example subdirectory to build and deploy any example for Tomcat.
it_it: Dovrai usare un diverso target Ant per utilizzare Tomcat. Usa <literal>ant tomcat.deploy</literal> nella sotto-directory d'esempio per il build ed il deploy in Tomcat.
ja_jp: Tomcat を利用する場合には異なった Ant ターゲットを使用する必要があります。 Tomcat 用のサンプルのビルドとデプロイで example サブディレクトリ内の <literal>ant tomcat.deploy</literal> を使用してください。

source: On Tomcat, the examples deploy to URLs like <literal>/jboss-seam-<replaceable>example</replaceable></literal>, so for the registration example the URL would be <ulink url="http://localhost:8080/jboss-seam-registration/"> <literal>http://localhost:8080/jboss-seam-registration/</literal></ulink>. The same is true for examples that deploy as a WAR, as mentioned in the previous section.
it_it: Con Tomcat gli esempi vengono deployati con URL del tipo <literal>/jboss-seam-<replaceable>example</replaceable></literal>, così per l'esempio di registrazione, l'URL sarebbe <ulink url="http://localhost:8080/jboss-seam-registration/"> <literal>http://localhost:8080/jboss-seam-registration/</literal></ulink>. Lo stesso vale per gli esempi che vengono deployati come WAR, come già detto nella precedente sezione.

source: Running the example tests
it_it: Eseguire i test degli esempi
ja_jp: サンプルのテスト起動

source: Most of the examples come with a suite of TestNG integration tests. The easiest way to run the tests is to run <literal>ant test</literal>. It is also possible to run the tests inside your IDE using the TestNG plugin. Consult the readme.txt in the examples directory of the Seam distribution for more information.
it_it: La maggior parte degli esempi è fornita di una suite di test d'integrazione TestNG. Il modo più semplice per eseguire i test è <literal>ant test</literal>. E' anche possibile eseguire i test all'interno del proprio IDE usandi il plugin di TestNG. Per ulteriori informazioni consultare il file readme.txt nella directory degli esempi nella distribuzione di Seam.

source: Your first Seam application: the registration example
it_it: La prima applicazione di Seam: esempio di registrazione
ja_jp: 初めての Seam アプリケーション: ユーザー登録サンプル

source: The registration example is a simple application that lets a new user store his username, real name and password in the database. The example isn't intended to show off all of the cool functionality of Seam. However, it demonstrates the use of an EJB3 session bean as a JSF action listener, and basic configuration of Seam.
it_it: L'esempio di registrazione è una semplice applicazione per consentire all'utente di memorizzare nel database il proprio username, il nome vero e la password. L'esempio non vuole mostrare tutte le funzionalità di Seam. Comunque mostra l'uso di un EJB3 session bean come JSF action listener e la configurazione base di Seam.
ja_jp: ユーザー登録サンプルはデータベースに新規ユーザーのユーザー名、 実名、 パスワードをデータベースに保存できる簡単なアプリケーションです。 このサンプルでは Seam の高度な機能のすべてを見せることはできませんが、 JSF アクションリスナーとして EJB3 セッション Bean を使用する方法や、 基本的な Seam の設定方法を見せてくれます。

source: We'll go slowly, since we realize you might not yet be familiar with EJB 3.0.
it_it: Andiamo piano, poiché ci rendiamo conto che EJB 3.0 potrebbe non essere familiare.
ja_jp: EJB 3.0 にまだ不慣れな方もいらっしゃるかもしれませんので、 ゆっくり進めていきます。

source: The start page displays a very basic form with three input fields. Try filling them in and then submitting the form. This will save a user object in the database.
it_it: La pagina iniziale mostra una form molto semplice con tre campi d'input. Si provi a riempirli e ad inviare la form. Verrà salvato nel database un oggetto user.
ja_jp: 最初のページは三つの入力フィールドを持つ基本的なフォームを表示します。 試しに、項目を入力してフォームをサブミットしてください。 これでユーザーオブジェクトはデータベースに保存されます。

source: Understanding the code
it_it: Capire il codice
ja_jp: コードの理解

source: The example is implemented with two Facelets templates, one entity bean and one stateless session bean. Let's take a look at the code, starting from the "bottom".
it_it: Questo esempio è implementato con due template Facelets, un entity bean e un session bean stateless. Si guardi ora il codice, partendo dal "basso".
ja_jp: このサンプルは、二つの Facelets テンプレート、一つのエンティティ Bean と、一つのステートレスセッション Bean で実装されています。 "bottom" からコードを見てみましょう。

source: The entity bean: <literal>User.java</literal>
it_it: Entity bean: <literal>User.java</literal>
ja_jp: エンティティ Bean: <literal>User.java</literal>

source: We need an EJB entity bean for user data. This class defines <emphasis>persistence</emphasis> and <emphasis>validation</emphasis> declaratively, via annotations. It also needs some extra annotations that define the class as a Seam component.
it_it: Occorre un entity bean EJB per i dati utente. Questa classe definisce <emphasis>persistenza</emphasis> e <emphasis>validazione</emphasis> in modo dichiarativo tramite le annotazioni. Ha bisogno anche di altre annotazioni per definire la classe come componente Seam.
ja_jp: ユーザーデータのために、EJBエンティティ Beanが必要です。 このクラスでは、アノテーションによって <emphasis>永続性</emphasis> と <emphasis>データ妥当性検証</emphasis> を宣言的に定義しています。 Seam コンポーネントとしてのクラスを定義するために、別にいくつかのアノテーションも必要です。

source: The EJB3 standard <literal>@Entity</literal> annotation indicates that the <literal>User</literal> class is an entity bean.
it_it: L'annotazione EJB3 standard <literal>@Entity</literal> indica che la classe <literal>User</literal> è un entity bean.
ja_jp: EJB3 標準 <literal>@Entity</literal> アノテーションは、 <literal>User</literal> クラスがエンティティ Bean であることを示しています。

source: A Seam component needs a <emphasis>component name</emphasis> specified by the <link linkend="name-annotation"> <literal>@Name</literal> </link> annotation. This name must be unique within the Seam application. When JSF asks Seam to resolve a context variable with a name that is the same as a Seam component name, and the context variable is currently undefined (null), Seam will instantiate that component, and bind the new instance to the context variable. In this case, Seam will instantiate a <literal>User</literal> the first time JSF encounters a variable named <literal>user</literal>.
it_it: Un componente Seam ha bisogno di un <emphasis>nome componente</emphasis> specificato dall'annotazione <link linkend="name-annotation"> <literal>@Name</literal> </link>. Questo nome deve essere unico all'interno dell'applicazione Seam. Quando JSF chiede a Seam di risolvere una variabile di contesto son un nome che corrisponde ad un componente Seam, e la variabile di contesto è indefinita (null), Seam istanzia quel componente e lo associa la nuova istanza alla variabile di contesto. In questo caso Seam istanzierà uno <literal>User</literal> la prima volta che JSF incontrarerà una variabile chiamata <literal>user</literal>.
ja_jp: Seam コンポーネントは <link linkend="name-annotation"> <literal>@Name</literal> </link> アノテーションで指定される <emphasis>コンポーネント名</emphasis> が必要です。 この名前は Seam アプリケーション中でユニークである必要があります。 JSF が Seam に Seam コンポーネント名と同じコンテキスト変数の解決を求める、コンテキスト変数がそのとき未定義 (null) の場合、 Seam はそのコンポーネントをインスタンス化し、その新しいインスタンスをコンテキスト変数にバインドします。 このサンプルでは、 JSF が初めて <literal>user</literal> という変数と出会うときに Seam は <literal>User</literal> をインスタンス化します。

source: Whenever Seam instantiates a component, it binds the new instance to a context variable in the component's <emphasis>default context</emphasis>. The default context is specified using the <link linkend="scope-annotation"> <literal>@Scope</literal> </link> annotation. The <literal>User</literal> bean is a session scoped component.
it_it: Quando Seam istanzia un componente, associa la nuova istanza alla variabile di contesto nel <emphasis>contesto di default</emphasis> del componente. Il contesto di default viene specificato usando l'annotazione <link linkend="scope-annotation"> <literal>@Scope</literal> </link>. Il bean <literal>User</literal> è un componente con scope di sessione.
ja_jp: Seam がコンポーネントをインスタンス化する時には、 必ずコンポーネントの <emphasis>デフォルトコンテキスト</emphasis>にあるコンテキスト変数に新しいインスタンスをバインドします。 デフォルトコンテキストは <link linkend="scope-annotation"> <literal>@Scope</literal> </link> アノテーションを使用して定義されます。 <literal>User</literal> はセッションスコープのコンポーネントです。

source: The EJB standard <literal>@Table</literal> annotation indicates that the <literal>User</literal> class is mapped to the <literal>users</literal> table.
it_it: L'annotazione standard EJB <literal>@Table</literal> indica che la classe <literal>User</literal> è mappata sulla tabella <literal>users</literal>.
ja_jp: EJB 標準 <literal>@Table</literal> アノテーションは、 <literal>User</literal> クラスが <literal>users</literal> テーブルにマッピングされることを示しています。

source: <literal>name</literal>, <literal>password</literal> and <literal>username</literal> are the persistent attributes of the entity bean. All of our persistent attributes define accessor methods. These are needed when this component is used by JSF in the render response and update model values phases.
it_it: <literal>name</literal>, <literal>password</literal> e <literal>username</literal> sono gli attributi di persistenza dell'entity bean. Tutti gli attributi di persistenza definiscono i metodi d'accesso. Questi sono necessari quando il componente viene usato da JSF nelle fasi di generazione risposta (render response) e aggiornamento dei valori del modello (update model values).
ja_jp: <literal>name</literal>、<literal>password</literal>、 <literal>username</literal> は、 エンティティ Bean の永続属性です。 すべての永続属性はアクセスメソッドを定義しています。 応答のレンダリングフェーズおよびモデル値の更新フェーズで JSF によりこのコンポーネントが使用されるときに必要となります。

source: An empty constructor is both required by both the EJB specification and by Seam.
it_it: Un costruttore vuoto è richiesto sia dalla specifica EJB sia da Seam.
ja_jp: 空コンストラクタは、EJB と Seam の両方の仕様から必要となります。

source: The <literal>@NotNull</literal> and <literal>@Length</literal> annotations are part of the Hibernate Validator framework. Seam integrates Hibernate Validator and lets you use it for data validation (even if you are not using Hibernate for persistence).
it_it: Le annotazioni <literal>@NotNull</literal> e <literal>@Length</literal> sono parte del framework Hibernate Validator. Seam integra Hibernate Validator e consente di usarlo per la validazione dei dati (anche se non viene usato Hibernate per la persistenza).
ja_jp: <literal>@NotNull</literal> と <literal>@Length</literal> アノテーションは、 Hibernate Validator フレームワークの一部です。 Seam は Hibernate Validator を統合しているため、 データの妥当性検証にこれを使用することができます (永続性に Hiberenate を使用していない場合でも使用できる)。

source: The EJB standard <literal>@Id</literal> annotation indicates the primary key attribute of the entity bean.
it_it: L'annotazione standard EJB <literal>@Id</literal> indica l'attributo di chiave primaria di un entity bean.
ja_jp: EJB 標準 <literal>@Id</literal> アノテーションは、 エンティティ Bean の主キーであることを示しています。

source: The most important things to notice in this example are the <literal>@Name</literal> and <literal>@Scope</literal> annotations. These annotations establish that this class is a Seam component.
it_it: Le cose più importanti da notare in quest'esempio sono le annotazioni <literal>@Name</literal> e <literal>@Scope</literal>. Queste annotazioni stabiliscono che questa classe è un componente Seam.
ja_jp: このサンプルで、もっとも注目してほしい重要なものは <literal>@Name</literal> と <literal>@Scope</literal> アノテーションです。 このアノテーションは、このクラスが Seam コンポーネントであることを規定しています。

source: We'll see below that the properties of our <literal>User</literal> class are bound directly to JSF components and are populated by JSF during the update model values phase. We don't need any tedious glue code to copy data back and forth between the JSP pages and the entity bean domain model.
it_it: Si vedrà sotto che le proprietà della classe <literal>User</literal> sono legate direttamente ai componenti JSF e sono popolati da JSF durante la fase di aggiornamento dei valori del modello ("update model values"). Non occorre nessun codice colla per copiare i dati avanti ed indietro tra le pagine JSP ed il modello di dominio degli entity bean.
ja_jp: 以下では、<literal>User</literal> クラスのプロパティは 直接 JSF コンポーネントにバインドされ、 モデル値の変更フェーズで JSF によって生成されたことがわかります。 JSP ページとエンティティ Bean ドメインモデル間を行き来するデータコピーの面倒なコードは必要ありません。

source: However, entity beans shouldn't do transaction management or database access. So we can't use this component as a JSF action listener. For that we need a session bean.
it_it: Comunque, gli entity bean non dovrebbero occuparsi della gestione delle transazioni o dell'accesso al database. Quindi non si può usare questo componente come action listener JSF. Per questo occorre un session bean.
ja_jp: しかし、 エンティティ Bean はトランザクション管理やデータベースアクセスを行わないので、 このコンポーネントを JSF のアクションリスナーとしては使用できません。 このため、 セッション Bean が必要となります。

source: The stateless session bean class: <literal>RegisterAction.java</literal>
it_it: Classe del bean di sessione stateless: <literal>RegisterAction.java</literal>
ja_jp: ステートレスセッション Bean クラス: <literal>RegisterAction.java</literal>

source: Most Seam application use session beans as JSF action listeners (you can use JavaBeans instead if you like).
it_it: La maggior parte delle applicazioni Seam utilizza i session bean come action listener JSF (si possono utilizzare JavaBean se si vuole).
ja_jp: ほとんどの Seam アプリケーションは、セッション Bean を JSF アクションリスナーとして使用します。 (好みに応じて JavaBean を使うことも可能)

source: We have exactly one JSF action in our application, and one session bean method attached to it. In this case, we'll use a stateless session bean, since all the state associated with our action is held by the <literal>User</literal> bean.
it_it: C'è esattamente una azione JSF nell'applicazione ed un metodo di session bean attaccato ad essa. In questo caso si utilizzerà un bean di sessione stateless, poiché tutto lo stato associato all'azione è mantenuto dal bean <literal>User</literal>.
ja_jp: アプリケーション内の JSF アクションはちょうど一つだけで、 これにセッションBean メソッドが 一つリンクしています。 このサンプルでは、 アクションに関連する状態はすべて <literal>User</literal> Bean によって保持されるため、 ステートレスセッション Bean を使用しています。

source: This is the only really interesting code in the example!
it_it: Questo è l'unico codice veramente interessante nell'esempio!
ja_jp: サンプルの中で、本当に注意すべきコードは以下のみです。

source: The EJB <literal>@Stateless</literal> annotation marks this class as a stateless session bean.
it_it: L'annotazione EJB <literal>@Stateless</literal> marca questa classe come session bean stateless.
ja_jp: EJB <literal>@Stateless</literal> アノテーションはこのクラスがステートレスセッション Bean であることを示しています。

source: The <link linkend="in-annotation"> <literal>@In</literal> </link> annotation marks an attribute of the bean as injected by Seam. In this case, the attribute is injected from a context variable named <literal>user</literal> (the instance variable name).
it_it: L'annotazione <link linkend="in-annotation"> <literal>@In</literal> </link> marca un attributo del bean come iniettato da Seam. In questo caso, l'attributo viene iniettato da una variabile di contesto chiamata <literal>user</literal> (il nome della variabile istanza).
ja_jp: <link linkend="in-annotation"> <literal>@In</literal> </link> アノテーションは、 Seam によってインジェクトされる Bean の属性としてマークしています。 ここで、この属性は、<literal>user</literal> (インスタンス変数名) という名前のコンテキスト変数からインジェクトされます。

source: The EJB standard <literal>@PersistenceContext</literal> annotation is used to inject the EJB3 entity manager.
it_it: L'annotazione EJB standard <literal>@PersistenceContext</literal> è usata per iniettare l'entity manager EJB3.
ja_jp: EJB 標準 <literal>@PersistenceContext</literal> アノテーションは、 EJB3 エンティティ Entity Manager にインジェクトするために使用されます。
