Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Tutorial.po
Languages: it_it, ja_jp

source: Now consider the state held in the <literal>HttpSession</literal>. The HttpSession is great place for true session data, data that is common to all requests that the user has with the application. However, it's a bad place to store data related to individual series of requests. Using the session of conversational quickly breaks down when dealing with the back button and multiple windows. On top of that, without careful programming, data in the HTTP Session can grow quite large, making the HTTP session difficult to cluster. Developing mechanisms to isolate session state associated with different concurrent conversations, and incorporating failsafes to ensure that conversation state is destroyed when the user aborts one of the conversations by closing a browser window or tab is not for the faint hearted. Fortunately, with Seam, you don't have to worry about that.
it_it: Ora si consideri lo stato mantenuto nella <literal>HttpSession</literal>. HttpSession è un ottimo posto per i veri dati di sessione, cioè dati che sono comuni a tutte le richieste che l'utente fa con l'applicazione. Comunque, non è un posto dove vanno memorizzati i dati riguardanti serie individuali di richieste. L'uso della sessione si complica velocemente quando si ha a che fare con il pulsante indietro e con le finestre multiple. In cima a questo, senza una programmazione attenta, i dati nella sessione HTTP posso crescere parecchio, rendendo la sessione HTTP difficile da tenere assieme. Lo sviluppo di meccanismi per isolare lo stato della session associata a differenti conversazioni concorrenti, e l'aggiunta di meccanismi di sicurezza per assicurare che lo stato della conversazione venga distrutto quando l'utente interrompe una delle conversazioni chiudendo una finestra del browser non è una questione per gente poco coraggiosa. Fortunatamente con Seam non occorre preoccuparsi di queste problematiche.
ja_jp: さて <literal>HttpSession</literal> に保管された状態を考察してみましょう。 HttpSession はセッションデータにとってとても便利な場所です。 つまりユーザーがアプリケーションとして持つすべての要求に共通なデータにとって。 しかし、一連の個別の要求に関するデータを保管する場所としては適しません。 戻るボタンや複数のウィンドウを操作するとき、対話的なセッションの使用はすぐに破たんしてしまいます。 それに加えて、慎重なプログラミングがなければ、HTTP セッションのデータはとても大きくなり、HTTP セッションをクラスタに対応させることが困難になる可能性があります。 異なる同時並行的な対話に関連するセッション状態を分離するメカニズムを開発することや、ブラウザウィンドウまたはタブを閉じることでユーザーが対話の一つを中断するときに対話状態が破棄されることを保証するフェイルセーフを組み込むことは簡単な仕事ではありません。 幸いにも Seam にはそんな心配は無用です。

source: Seam introduces the <emphasis>conversation context</emphasis> as a first class construct. You can safely keep conversational state in this context, and be assured that it will have a well-defined lifecycle. Even better, you won't need to be continually pushing data back and forth between the application server and the database, since the conversation context is a natural cache of data that the user is currently working with.
it_it: Seam introduce il <emphasis>contesto conversazionale</emphasis> come first class construct. Si può mantenere in modo sicuro lo stato conversazionale in questo contesto ed essere certi che avrà un ciclo di vita ben definito. Ancor meglio non servirà mandare continuamente avanti ed indietro i dati tra server e database, poiché il contesto di conversazione è una cache naturale di dati su cui l'utente sta lavorando.
ja_jp: Seam はファーストクラスの構造として<emphasis>対話コンテキスト (conversation context)</emphasis> を導入しています。 このコンテキストで対話状態は安全に維持することが可能で、 また明確なライフサイクルを持つことが保証されます。 さらに良いことに、 対話コンテキストはユーザーが現在作業しているデータの自然なキャッシュとなるため、 アプリケーションサーバーとデータベース間でデータを継続的に行き来させる必要がありません。

source: In this application, we'll use the conversation context to store stateful session beans. There is an ancient canard in the Java community that stateful session beans are a scalability killer. This may have been true in the early days of enterprise Java, but it is no longer true today. Modern application servers have extremely sophisticated mechanisms for stateful session bean state replication. JBoss AS, for example, performs fine-grained replication, replicating only those bean attribute values which actually changed. Note that all the traditional technical arguments for why stateful beans are inefficient apply equally to the <literal>HttpSession</literal>, so the practice of shifting state from business tier stateful session bean components to the web session to try and improve performance is unbelievably misguided. It is certainly possible to write unscalable applications using stateful session beans, by using stateful beans incorrectly, or by using them for the wrong thing. But that doesn't mean you should <emphasis>never</emphasis> use them. If you remain unconvinced, Seam allows the use of POJOs instead of stateful session beans. With Seam, the choice is yours.
it_it: In quest'applicazione si userà il contesto di conversazione per memorizzare i session bean stateful. C'è un'antica credenza nella comunità Java che ritiene che i session bean stateful siano nocivi alla scalabilità. Questo poteva essere vero nei primissimi giorni di Java Enterprise, ma oggi non è più vero. I moderni application server hanno meccanismi estremamente sofisticati per la replicazione dello stato dei session bean stateful. JBoss AS, per esempio, esegue una replicazione a grana fine, replicando solo quei valori degli attributi bean che sono cambiati. Si noti che tutti gli argomenti tecnici tradizionali per cui i bean stateful sono inefficienti si applicano allo stesso modo alla <literal>HttpSession</literal>, e quindi risulta fuorviante la pratica di cambiare stato dai componenti (session bean stateful) del business tier alla sessione web per cercare di migliorare le performance. E' certamente possibile scrivere applicazioni non scalabili usando session bean stateful non in modo corretto, o usandoli per la cosa sbagliata. Ma questo non significa che non si debba <emphasis>mai</emphasis>. Se non si è convinti, Seam consente di usare POJO invece dei session bean statefull. Con Seam la scelta è vostra.
ja_jp: このアプリケーションでは、ステートフルセッション Bean を保管するために対話コンテキストを使用します。 Java コミュニティには、ステートフルセッション Bean はスケーラビリティ殺しだというデマが古くからあります。 初期のエンタープライズ Java では真実であったかもしれませんが、今日ではもはや真実ではありません。 今日のアプリケーションサーバーはステートフルセッション Bean の状態を複製するために極めて洗練されたメカニズムを持っています。 例えば、JBoss AS はきめの細かい複製を行い、 実際に変化した bean 属性値のみの複製を行います。 ステートフル Bean が非効率的かという伝統的技術論はすべて <literal>HttpSession</literal> にも等しく当てはまります。 その結果パフォーマンスを改善するためにビジネス層のステートフルセッション Bean から Web セッションに移行する慣習は驚くほど誤解されていることに留意してください。間違ってステートフル Bean を使用することあるいは間違ったもののためにそれらを使うことによって、スケーラブルでないアプリケーションを書く可能性は確かにあります。 しかしそれは使うべきでないということには<emphasis>なりません</emphasis>。もし納得できなければ、Seam ではセッション Bean の代わりに POJO を使用することも可能です。 Seam では、選択はあなた次第です。

source: The booking example application shows how stateful components with different scopes can collaborate together to achieve complex behaviors. The main page of the booking application allows the user to search for hotels. The search results are kept in the Seam session scope. When the user navigates to one of these hotels, a conversation begins, and a conversation scoped component calls back to the session scoped component to retrieve the selected hotel.
it_it: L'applicazione di esempio prenotazione mostra come i componenti stateful con differenti scope possano collaborare assieme per ottenere comportamenti complessi. La pagina principale dell'applicazione consente all'utente di cercare gli hotel. I risultati di ricerca vengono mantenuti nello scope di sessione di Seam. Quando l'utente naviga in uno di questi hotel, inizia una conversazione ed il componente con scope conversazione chiama il componente con scope sessione per recuperare l'hotel selezionato.
ja_jp: この予約サンプルアプリケーションは、 複雑な振る舞いを実現するために、 異なるスコープを持つステートフルコンポーネントがどのように連携することが可能であるかを示しています。 予約アプリケーションのメインページは、 ユーザーにホテル検索を可能にしています。 検索結果は、Seam セッションスコープに保持されます。 ユーザーがこれらのホテルの一つに遷移するとき、 対話は、開始します。 そして、対話スコープのコンポーネントは、 選択されたホテルを取得するために、 セッションスコープのコンポーネントを呼び返します。

source: The booking example also demonstrates the use of RichFaces Ajax to implement rich client behavior without the use of handwritten JavaScript.
it_it: L'esempio di prenotazione mostra anche l'uso di RichFaces Ajax per implementare un comportamento rich client senza usare Javascript scritto a mano.
ja_jp: 手書きの JavaScript を使用することなくリッチクライアントの振る舞いを実装するためにホテル予約サンプルは RichFaces Ajax の使用を実演しています。

source: The search functionality is implemented using a session-scope stateful session bean, similar to the one we saw in the message list example.
it_it: La funzionalità di ricerca è implementata usando un session bean statefull con scope di sessione, simile a quello usato nell'esempio di lista messaggi.
ja_jp: 検索機能は、セッションスコープのステートフル Bean を使用して実装されます。 それはメッセージ一覧サンプルに見られるものと同様です。

source: The EJB standard <literal>@Stateful</literal> annotation identifies this class as a stateful session bean. Stateful session beans are scoped to the conversation context by default.
it_it: L'annotazione EJB standard <literal>@Stateful</literal> identifica questa classe come un bean di sessione stateful. Bean di sessione stateful hanno di default uno scope legato al contesto di conversazione.
ja_jp: EJB 標準 <literal>@Stateful</literal> アノテーションは、 このクラスがステートフルセッション Bean であることを識別しています。 ステートフルセッション Bean は、 デフォルトで対話コンテキストのスコープを持ちます。

source: The <literal>@Restrict</literal> annotation applies a security restriction to the component. It restricts access to the component allowing only logged-in users. The security chapter explains more about security in Seam.
it_it: L'annotazione <literal>@Restrict</literal> applica al componente una restrizione di sicurezza. Restringe l'accesso al componente consentendolo solo agli utenti loggati. Il capitolo sicurezza spiega con maggior dettaglio la sicurezza in Seam.
ja_jp: <literal>@Restrict</literal> アノテーションはコンポーネントへのセキュリティ制限に適用します。 ログインユーザーだけがコンポーネントにアクセスを許されるように制限します。 セキュリティの章では、Seam におけるセキュリティがさらに詳細に説明されています。

source: The <link linkend="datamodel-annotation"> <literal>@DataModel</literal> </link> annotation exposes a <literal>List</literal> as a JSF <literal>ListDataModel</literal>. This makes it easy to implement clickable lists for search screens. In this case, the list of hotels is exposed to the page as a <literal>ListDataModel</literal> in the conversation variable named <literal>hotels</literal>.
it_it: L'annotazione <link linkend="datamodel-annotation"> <literal>@DataModel</literal> </link> espone una <literal>List</literal> come <literal>ListDataModel</literal> JSF. Questo facilita l'implementazione di liste cliccabili per schermate di ricerca. In questo caso, la lista degli hotel è esposta nella pagina come <literal>ListDataModel</literal> all'interno della variabile di conversazione chiamata <literal>hotels</literal>.
ja_jp: <link linkend="datamodel-annotation"> <literal>@DataModel</literal> </link> アノテーションは JSF <literal>ListDataModel</literal> として <literal>List</literal> を公開します。 これは画面検索のためのクリック可能一覧の実装を容易にします。 この場合、ホテルの一覧は <literal>hotels</literal> という名前の対話変数で <literal>ListDataModel</literal> としてページを公開します。

source: The EJB standard <literal>@Remove</literal> annotation specifies that a stateful session bean should be removed and its state destroyed after invocation of the annotated method. In Seam, all stateful session beans must define a method with no parameters marked <literal>@Remove</literal>. This method will be called when Seam destroys the session context.
it_it: L'annotazione standard EJB <literal>@Remove</literal> specifica che un bean di session stateful deve essere rimosso ed il suo stato distrutto dopo l'invocazione del metodo annotato. In Seam tutti i bean di sessione stateful devono definire un metodo senza parametri marcato con <literal>@Remove</literal>. Questo metodo verrà chiamato quando Seam distrugge il contesto di sessione.
ja_jp: EJB 標準の <literal>@Remove</literal> アノテーションはアノテーションが付けられたメソッドが呼ばれた後ステートフルセッション Bean が取り除かれることを規定しています。 Seam では、すべてのセッション Bean はパラメータなしの <literal>@Remove</literal> メソッドを定義される必要があります。 Seam がセッションコンテキストを破棄するときメソッドは呼び出されます。

source: The main page of the application is a Facelets page. Let's look at the fragment which relates to searching for hotels:
it_it: La pagina principale dell'applicazione è una pagina Facelets. Guardiamo al frammento relativo alla ricerca hotel:
ja_jp: アプリケーションの中心となるページは Facelets ページです。 ホテルを検索に関連する部分を見てみましょう。

source: The RichFaces Ajax <literal>&lt;a:support&gt;</literal> tag allows a JSF action event listener to be called by asynchronous <literal>XMLHttpRequest</literal> when a JavaScript event like <literal>onkeyup</literal> occurs. Even better, the <literal>reRender</literal> attribute lets us render a fragment of the JSF page and perform a partial page update when the asynchronous response is received.
it_it: Il tag RichFaces Ajax <literal>&lt;a:support&gt;</literal> consente ad un event action listener JSF di essere chiamato da <literal>XMLHttpRequest</literal> asincrono quando avviene un evento JavaScript <literal>onkeyup</literal>. Ancor meglio, l'attributo <literal>reRender</literal> consente di rigenerare un frammento di pagina JSF e di eseguire un aggiornamento parziale quando si riceve una risposta asincrona.
ja_jp: RichFaces Ajax <literal>&lt;a:support&gt;</literal> タグは <literal>onkeyup</literal> のような JavaScript イベントが発生するとき JSF アクションイベントリスナーが非同期の <literal>XMLHttpRequest</literal> により呼び出されることを可能にしています。 さらに良いことには、<literal>reRender</literal> 属性は JSF ページの一部分だけのレンダリングを可能とし非同期の応答を受信したときに部分的なページ更新を可能にしています。

source: The RichFaces Ajax <literal>&lt;a:status&gt;</literal> tag lets us display an animated image while we wait for asynchronous requests to return.
it_it: Il tag RichFaces Ajax <literal>&lt;a:status&gt;</literal> consente di mostrare un'immagine animata mentre si attende la restituzione di richieste asincrone.
ja_jp: RichFaces Ajax <literal>&lt;a:status&gt;</literal> タグは非同期の要求が返されるのを待つ間にアニメーションイメージを表示させます。

source: The RichFaces Ajax <literal>&lt;a:outputPanel&gt;</literal> tag defines a region of the page which can be re-rendered by an asynchronous request.
it_it: Il tag RichFaces Ajax <literal>&lt;a:outputPanel&gt;</literal> definisce una regione della pagina che può essere rigenerata da una richiesta asincrona.
ja_jp: RichFaces Ajax <literal>&lt;a:outputPanel&gt;</literal> タグは非同期要求によって再レンダリング可能なページの領域を定義します。

source: The Seam <literal>&lt;s:link&gt;</literal> tag lets us attach a JSF action listener to an ordinary (non-JavaScript) HTML link. The advantage of this over the standard JSF <literal>&lt;h:commandLink&gt;</literal> is that it preserves the operation of "open in new window" and "open in new tab". Also notice that we use a method binding with a parameter: <literal>#{hotelBooking.selectHotel(hot)}</literal>. This is not possible in the standard Unified EL, but Seam provides an extension to the EL that lets you use parameters on any method binding expression.
it_it: Il tag Seam <literal>&lt;s:link&gt;</literal> consente di attaccare un action listener JSF ad un link HTML ordinario (non-JavaScript). Il vantaggio rispetto al JSF <literal>&lt;h:commandLink&gt;</literal> è che mantiene le operazioni "Apri in nuova finestra" and "Apri in nuova scheda". Si noti inoltre che è stato usato un method binding con un parametro: <literal>#{hotelBooking.selectHotel(hot)}</literal>. Questo non è possibile con lo standard Unified EL, ma Seam fornisce un'estensione a EL che consente l'uso dei parametri sul qualsiasi espressione di method binding.
ja_jp: Seam <literal>&lt;s:link&gt;</literal> タグは、 JSF アクションリスナーを普通の (非 JavaScript) HTML リンクに付けることができます。 標準 <literal>&lt;h:commandLink&gt;</literal> と比べてこれが有利なのは、 "新しいウィンドウで開く" や "新しいタブで開く"といった操作を損なわないことです。 パラメータ <literal>#{hotelBooking.selectHotel(hot)}</literal> のメソッドバインディングを利用していることにも留意してください。 これは、標準統一された EL式 では不可能ですが、 Seam は、 すべてのメソッドバインディング表現でパラメータ使用できるよう EL式 を拡張しています。

source: If you're wondering how navigation occurs, you can find all the rules in <literal>WEB-INF/pages.xml</literal>; this is discussed in <xref linkend="events.pageaction.navigation"/>.
it_it: Se ci si chiede come avvenga la navigazione, si possono trovare tutte le regole in <literal>WEB-INF/pages.xml</literal>; questo viene discusso in <xref linkend="events.pageaction.navigation"/>.
ja_jp: どのようにナビゲーションが起こるかと思うならば、<literal>WEB-INF/pages.xml</literal> にすべてのルールが定義されていることを見つけるでしょう。 これについては <xref linkend="events.pageaction.navigation"/> で議論します。

source: This page displays the search results dynamically as we type, and lets us choose a hotel and pass it to the <literal>selectHotel()</literal> method of the <literal>HotelBookingAction</literal>, which is where the <emphasis>really</emphasis> interesting stuff is going to happen.
it_it: Questa pagina mostra i risultati di ricerca in modo dinamico man mano si digita, e consente di scegliere un hotel e passarlo al metodo <literal>selectHotel()</literal> di <literal>HotelBookingAction</literal>, che è il posto in cui <emphasis>veramente</emphasis> succede qualsosa di interessante.
ja_jp: このページは、タイプしたときに検索結果が動的に表示し、 ホテルの選択をさせ、 <literal>HotelBookingAction</literal> の <literal>selectHotel()</literal> メソッドに選択結果を渡します。 そこでは、<emphasis>かなり</emphasis>興味深いことが起こっています。

source: Now let's see how the booking example application uses a conversation-scoped stateful session bean to achieve a natural cache of persistent data related to the conversation. The following code example is pretty long. But if you think of it as a list of scripted actions that implement the various steps of the conversation, it's understandable. Read the class from top to bottom, as if it were a story.
it_it: Vediamo ora come l'applicazione d'esempio usa un bean di sessione stateful con scope di conversazione per ottenere una naturale cache di dati persistenti relativi alla conversazione. Il seguente codice d'esempio è abbastanza lungo. Ma se si pensa a questo come una lista di azioni che implementano vari passi della conversazione, risulta comprensibile. Si legga la classe dalla cima verso il fondo, come se fosse un racconto.
ja_jp: 対話と関連する永続データを自然にキャッシュするために予約サンプルアプリケーションがどのように対話スコープのステートフル Bean を利用するか見てみましょう。 以下のサンプルコードは結構長いですが、対話の各種ステップを実装するスクリプト化された動作の一覧と考えると理解できます。 ストーリーを読むように徹底的に読んでください。

source: This bean uses an EJB3 <emphasis>extended persistence context</emphasis>, so that any entity instances remain managed for the whole lifecycle of the stateful session bean.
it_it: Questo bean utilizza un <emphasis>contesto di persistenza esteso</emphasis> EJB3, e quindi ogni istanza di entity rimane gestita per l'intero ciclo di vita del session bean stateful.
ja_jp: この Bean は、EJB3 <emphasis>拡張永続コンテキスト</emphasis> を使用します。 その結果、エンティティインスタンスは、 ステートフルセッション Bean のライフサイクル全体の管理を維持します。

source: The <link linkend="out-annotation"> <literal>@Out</literal> </link> annotation declares that an attribute value is <emphasis>outjected</emphasis> to a context variable after method invocations. In this case, the context variable named <literal>hotel</literal> will be set to the value of the <literal>hotel</literal> instance variable after every action listener invocation completes.
it_it: L'annotazione <link linkend="out-annotation"> <literal>@Out</literal> </link> dichiara che il valore dell'attributo viene <emphasis>outjected</emphasis> in una variablie di contesto dopo le invocazioni del metodo. In questo caso, la variabile di contesto chiamata <literal>hotel</literal> verrà impostata al valore della variabile d'istanza <literal>hotel</literal> dopo che viene completata ciascuna invocazione dell'action listener.
ja_jp: <link linkend="out-annotation"> <literal>@Out</literal> </link> アノテーションはメソッド呼び出しの後に属性の値がコンテキスト変数に<emphasis>アウトジェクト (outject)</emphasis> されることを宣言しています。 このサンプルではすべてのアクションリスナーの呼び出しが完了した後に <literal>hotel</literal> の名前のコンテキスト変数は <literal>hotel</literal> インスタンス変数の値に設定されます。

source: The <link linkend="begin-annotation"> <literal>@Begin</literal> </link> annotation specifies that the annotated method begins a <emphasis>long-running conversation</emphasis>, so the current conversation context will not be destroyed at the end of the request. Instead, it will be reassociated with every request from the current window, and destroyed either by timeout due to conversation inactivity or invocation of a matching <literal>@End</literal> method.
it_it: L'annotazione <link linkend="begin-annotation"> <literal>@Begin</literal> </link> specifica che il metodo annotato inizi una <emphasis>conversazione long-running</emphasis>, e quindi l'attuale contesto della conversazione non verrà distrutto alla fine della richiesta. Invece verrà riassociato ad ogni richiesta dalla finestra attuale e distrutto o dopo un timeout dovuto all'inattività della conversazione o dopo l'invocazione di un metodo annotato con <literal>@End</literal>.
ja_jp: <link linkend="begin-annotation"> <literal>@Begin</literal> </link> アノテーションは アノテーション付きメソッドが<emphasis>長期対話 (long-running conversation)</emphasis> を開始することを定義しています。 したがって要求の終了で現在の対話コンテキストは破棄されません。 その代わりに、 現在のウインドからのすべての要求に再び関連する、対話の非活動によるタイムアウトあるいは <literal>@End</literal> とマッチするメソッドの呼び出しにより破棄されるでしょう。

source: The <link linkend="end-annotation"> <literal>@End</literal> </link> annotation specifies that the annotated method ends the current long-running conversation, so the current conversation context will be destroyed at the end of the request.
it_it: L'annotazione <link linkend="end-annotation"> <literal>@End</literal> </link> specifica che il metodo annotato finisca l'attuale conversazione long-running, e quindi il contesto della conversazione attuale verrà distrutto alla fine della richiesta.
ja_jp: <link linkend="end-annotation"> <literal>@End</literal> </link> アノテーションはアノテーション付きメソッドが現在の長期対話を終了することを定義しています。 したがって要求の終わりで現在の対話コンテキストは破棄されるでしょう。

source: This EJB remove method will be called when Seam destroys the conversation context. Don't forget to define this method!
it_it: Questo metoto EJB di rimozione verrà chiamato quando Seam distruggerà il contesto della conversazione. Non si dimentichi di definire questo metodo!
ja_jp: Seam は、対話コンテキストを破棄するときこの EJB remove メソッドは呼び出されるでしょう。 このメソッドを定義することを忘れないでください。

source: <literal>HotelBookingAction</literal> contains all the action listener methods that implement selection, booking and booking confirmation, and holds state related to this work in its instance variables. We think you'll agree that this code is much cleaner and simpler than getting and setting <literal>HttpSession</literal> attributes.
it_it: <literal>HotelBookingAction</literal> contiene tutti i metodi action listenet che implementano, selezione, prenotazione e conferma, e mantiene lo stato relativo a questo lavoro nelle variabili di istanza. Pensiamo che questo codice sia molto più pulito e semplice degli attributi get e set in <literal>HttpSession</literal>.
ja_jp: <literal>HotelBookingAction</literal> はホテル選択、予約、予約確認を実装したすべてのアクションリスナーを持っており、 そしてこの操作に関連する状態をインスタンスに保持しています。 このコードが、 <literal>HttpSession</literal> 属性から get/set するものと比較してよりクリーンで簡単なコードであることに同意してもらえると思います。
