Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Tutorial.po
Languages: it_it, ja_jp

source: Even better, a user can have multiple isolated conversations per login session. Try it! Log in, run a search, and navigate to different hotel pages in multiple browser tabs. You'll be able to work on creating two different hotel reservations at the same time. If you leave any one conversation inactive for long enough, Seam will eventually time out that conversation and destroy its state. If, after ending a conversation, you backbutton to a page of that conversation and try to perform an action, Seam will detect that the conversation was already ended, and redirect you to the search page.
it_it: Ancor meglio, un utente può avere conversazioni multiple isolate per ogni sessione di login. Si provi! Loggarsi, eseguire una ricerca e navigare in diverse pagine d'hotel in diverse schede del browser. Si sarà in grado di lavorare e creare due differenti prenotazioni contemporaneamente. Se una conversazione viene lasciata a lungo inattiva, Seam andrà in timeout e distruggerà lo stato di quella conversazione. Se, dopo la chiusura di una conversazione, si premerà il pulsante indietro per tornare alla pagina precedente e si eseguirà un'azione, Seam si accorgerà che la conversazione è già terminata, e rimanderà l'utente alla pagina di ricerca.
ja_jp: さらに良いことに、ユーザーは、ログインセッション毎に複数の分離された対話を持つことが可能です。 試してみてください。 ログインして、検索して、複数のブラウザタブに異なるホテルのページを表示させてください。 同時に二つの異なるホテル予約を作成することが可能です。 対話を長時間放置した場合、 Seam は最終的に対話をタイムアウトし状態を破棄します。 対話が終了した後に、その対話ページに戻るボタンを押し処理実行を試みた場合、 Seam は対話が既に終了したことを検出し検索ページにリダイレクトします。

source: The Seam Debug Page
it_it: La pagina di debug di Seam
ja_jp: Seam デバッグページ

source: The WAR also includes <literal>seam-debug.jar</literal>. The Seam debug page will be available if this jar is deployed in <literal>WEB-INF/lib</literal>, along with the Facelets, and if you set the debug property of the <literal>init</literal> component:
it_it: Il WAR include anche <literal>seam-debug.jar</literal>. La pagina di debug di Seam sarà disponibile se questo jar è deployato in <literal>WEB-INF/lib</literal>, assieme a Facelets e se è stata impostata la proprietà di debug nel componente <literal>init</literal>:
ja_jp: WAR は <literal>seam-debug.jar</literal> も含みます。 Seam デバッグページは <literal>WEB-INF/lib</literal> に Facelets と合わせてこの jar がデプロイされ、<literal>init</literal> コンポーネントの debug プロパティが以下のように設定された場合に有効になります。

source: This page lets you browse and inspect the Seam components in any of the Seam contexts associated with your current login session. Just point your browser at <ulink url="http://localhost:8080/seam-booking/debug.seam"> <literal>http://localhost:8080/seam-booking/debug.seam</literal> </ulink>.
it_it: Questa pagina consentirà di sfogliare ed ispezionare i componenti Seam in ogni contesto Seam associato alla sessione di login corrente. Si punti il browser su <ulink url="http://localhost:8080/seam-booking/debug.seam"> <literal>http://localhost:8080/seam-booking/debug.seam</literal> </ulink>.
ja_jp: このページで現在ログインしているセッションに関連するすべての Seam コンテキスト中の Seam コンポーネントを見たり検査することができます。 使い方は単にブラウザから <ulink url="http://localhost:8080/seam-booking/debug.seam"> <literal>http://localhost:8080/seam-booking/debug.seam</literal> </ulink> を指定するだけです。

source: Nested conversations: extending the Hotel Booking example
it_it: Conversazioni Annidate: estendere l'esempio di Prenotazione Hotel
ja_jp: ネストされた対話 : ホテル予約サンプルの拡張

source: Long-running conversations make it simple to maintain consistency of state in an application even in the face of multi-window operation and back-buttoning. Unfortunately, simply beginning and ending a long-running conversation is not always enough. Depending on the requirements of the application, inconsistencies between what the user's expectations and the reality of the application’s state can still result.
it_it: Le conversazioni long-running rendono semplice mantenere la consistenza dello stato in un'applicazione anche in presenza di operazioni con finestre multiple o con il pulsante indietro. Sfrotunatamente, iniziare e finire una conversazione long-running non è sempre sufficiente. A seconda dei requisiti dell'applicazione, le inconsistenze tra le aspettative dell'utente ed il reale stato dell'applicazione possono comunque sussistere.
ja_jp: 長期対話はマルチウインドウ操作やも戻るボタンに直面してもアプリケーションの状態の一貫性を維持することを容易にします。 残念なことに、長期対話の開始や終了は通常十分ではありません。 アプリケーション要件に応じて、ユーザーの期待するもとのアプリケーションの状態の現実の間の矛盾は結果としてまだ生じます。

source: The nested booking application extends the features of the hotel booking application to incorporate the selection of rooms. Each hotel has available rooms with descriptions for a user to select from. This requires the addition of a room selection page in the hotel reservation flow.
it_it: L'applicazione prenotazione annidata estende le caratteristiche dell'applicazione prenotazione hotel aggiungendo la selezione della stanza. Ogni hotel ha camere disponibili con delle descrizioni che l'utente può scegliere. Questo richiede l'aggiunta di una pagina di selezione camera nel flusso di prenotazione hotel.
ja_jp: ネストされたホテル予約アプリケーションは部屋の選択を関連づけるためホテル予約アプリケーションの機能を拡張しています。 それぞれのホテルはユーザーが選択するために宿泊可能な部屋を説明付きで持っています。 これはホテルの予約の流れにおいて部屋選択ページの機能追加を必要とします。

source: The user now has the option to select any available room to be included in the booking. As with the hotel booking application we saw previously, this can lead to issues with state consistency. As with storing state in the <varname>HTTPSession</varname>, if a conversation variable changes it affects all windows operating within the same conversation context.
it_it: L'utente adesso ha l'opzione di selezionare una camera disponibile da aggiungere alla prenotazione. Come per l'applicazione precedentemente vista, questo porta a problemi di consistenza dello stato. Come per la memorizzazione dello stato in <varname>HTTPSession</varname>, se una variabile di conversazione cambia, questo influenza tutte le finestre che operano dentro lo stesso contesto di conversazione.
ja_jp: ユーザーはその時予約に含まれるべき宿泊可能な部屋のオプションを持っています。 これまで見たホテルの予約アプリケーションと同様に、これは状態の一貫性の問題を引き起こす可能性があります。 <varname>HTTPSession</varname> に状態を保管するように、対話変数が変更すると同じ対話コンテキストの中で動作しているすべてのウィンドウに影響します。

source: To demonstrate this, let’s suppose the user clones the room selection screen in a new window. The user then selects the <emphasis>Wonderful Room</emphasis> and proceeds to the confirmation screen. To see just how much it would cost to live the high-life, the user returns to the original window, selects the <emphasis>Fantastic Suite</emphasis> for booking, and again proceeds to confirmation. After reviewing the total cost, the user decides that practicality wins out and returns to the window showing <emphasis>Wonderful Room</emphasis> to confirm.
it_it: Per dimostrare questo si supponga che l'utente cloni la schermata di selezione delle camera in una nuova finestra. L'utente quindi seleziona la <emphasis>Wonderful Room</emphasis> e procede alla schermata di conferma. Per vedere solamente quando costa vivere alla grande, l'utente ritorna alla finestra originale, seleziona la <emphasis>Fantastic Suite</emphasis> ed procede quindi alla conferma. Dopo aver visto il costo totale, l'utente decide che la praticità vince e ritorna alla finestra della <emphasis>Wonderful Room</emphasis> per procedere alla conferma.
ja_jp: これを実演するために、ユーザーが一つの新しいウィンドウでの中でまったく同じの選択画面を表示させたとします。 そしてユーザーは <emphasis>Wonderful Room</emphasis> を選択して確認画面に進みます。 上流の生活を過ごすのにどれだけかかるかを見るために、ユーザーはもともとの画面を戻して、予約のために <emphasis>Fantastic Suite</emphasis> を選択し、再び確認に進みます。 総費用を見直した後に、ユーザーは実用性を重視して確認のために <emphasis>Wonderful Room</emphasis> を表示するウィンドウに戻ることを決めました。

source: In this scenario, if we simply store all state in the conversation, we are not protected from multi-window operation within the same conversation. Nested conversations allow us to achieve correct behavior even when context can vary within the same conversation.
it_it: In questo scenario, se semplicemente si memorizza lo stato nella conversazione non si è protetti da operazioni a finestre multiple all'interno della stessa conversazione. Le conversazioni innestate consentono di ottenere un comportamento corretto quando il contesto può variare all'interno della stessa conversazione.
ja_jp: このシナリオでは、単純にすべての状態を対話に保管するならば、同じ対話なかにある複数ウィンドウの操作を保護できません。 ネストされた対話は同じ対話中でコンテキストが変更するときでさえユーザーの正しい振る舞いを達成可能にしています。

source: Understanding Nested Conversations
it_it: Capire le Conversazioni Annidate
ja_jp: ネストされた対話の理解

source: Now let's see how the nested booking example extends the behavior of the hotel booking application through use of nested conversations. Again, we can read the class from top to bottom, as if it were a story.
it_it: Si veda ora come l'esempio di prenotazione innestata estenda il comportamento dell'applicazione di prenotazione hotel tramite l'utilizzo di conversazioni innestate. Ancora, si può leggere la classe dalla cima verso il fondo, come un racconto.
ja_jp: さあ、ネストされたホテル予約サンプルがネストされた対話を使用することでどのようにホテル予約アプリケーション機能拡張させているか見てみましょう。 繰り返しになりますが、物語のようにクラスを徹底的に読むことができます。

source: The <varname>hotel</varname> instance is injected from the conversation context. The hotel is loaded through an <emphasis>extended persistence context</emphasis> so that the entity remains managed throughout the conversation. This allows us to lazily load the <varname>availableRooms</varname> through an <varname>@Factory</varname> method by simply walking the association.
it_it: L'istanza <varname>hotel</varname> viene iniettata dal contesto conversazione. L'hotel viene caricato tramite un <emphasis>contesto di persistenza esteso</emphasis> cosicché l'entity rimanga gestito lungo la conversazione. Questo consente di caricare in modo lazy la <varname>availableRooms</varname> tramite il metodo <varname>@Factory</varname> semplicemente seguendo l'associazione.

source: When <link linkend="begin-annotation"> <literal>@Begin(nested=true)</literal> </link> is encountered, a nested conversation is pushed onto the conversation stack. When executing within a nested conversation, components still have access to all outer conversation state, but setting any values in the nested conversation’s state container does not affect the outer conversation. In addition, nested conversations can exist concurrently stacked on the same outer conversation, allowing independent state for each.
it_it: Quando si incontra <link linkend="begin-annotation"> <literal>@Begin(nested=true)</literal> </link>, viene aggiunta una conversazione innestata allo stask delle conversazioni. Dentro una conversazione innestata, i componenti hanno accesso a tutto lo stato della conversazione più esterna, ma il settaggio di valori nel container dello stato delle conversazione innestata non influenza la conversazione più esterna. In aggiunta, le conversazioni esterne possono esistere in modo concorrente sopra la stessa conversazione più esterna, consentendo per ciascuna uno stato indipendente.
ja_jp: <link linkend="begin-annotation"> <literal>@Begin(nested=true)</literal> </link> に出会うとき、ネストされた対話は対話スタックにプッシュされます。 ネストされた対話中で実行するとき、コンポーネントはそれでも対話の外のすべての状態にアクセスできますが、ネストされた対話の状態コンテナに値を設定することは対話の外側には影響しません。 加えて、ネストされた対話は同じ外側の対話に対して同時並行的にスタックされて存在することが可能で、それぞれの状態は独立しています。

source: The <varname>roomSelection</varname> is outjected to the conversation based on the <varname>@DataModelSelection</varname>. Note that because the nested conversation has an independent context, the <varname>roomSelection</varname> is only set into the new nested conversation. Should the user select a different preference in another window or tab a new nested conversation would be started.
it_it: <varname>roomSelection</varname> viene messa in outjection nella conversazione tramite <varname>@DataModelSelection</varname>. Si noti che, poiché la conversazione innestata haun contesto indipendente, <varname>roomSelection</varname> è impostata solo nella nuova conversazione innestata. Dovesse l'utente selezionare un'altra preferenza in un'altra finestra o scheda, una nuova conversazione innestata verrebbe generata.
ja_jp: <varname>roomSelection</varname> は <varname>@DataModelSelection</varname> に基づいた対話にアウトジェクトされます。 ネストされた対話は独立したコンテキストを持つので、<varname>roomSelection</varname> は新たなネストされた対話にのみ設定されることに留意してください。 ユーザーが別のウインドウまたはタブで違う好みを選ぶならば新たなネストされた対話が開始されます。

source: The <link linkend="end-annotation"> <literal>@End</literal> </link> annotation pops the conversation stack and resumes the outer conversation. The <varname>roomSelection</varname> is destroyed along with the conversation context.
it_it: L'annotazione <link linkend="end-annotation"> <literal>@End</literal> </link> rimuove la conversazione dallo stack (pop) e ripristina la conversazione più esterna. <varname>roomSelection</varname> viene distrutta assieme al contesto della conversazione.
ja_jp: <link linkend="end-annotation"> <literal>@End</literal> </link> アノテーションは対話スタックからポップし外側の対話を再開します。 対話コンテキストとともに <varname>roomSelection</varname> は破棄されます。

source: When we begin a nested conversation it is pushed onto the conversation stack. In the <varname>nestedbooking</varname> example, the conversation stack consists of the outer long-running conversation (the booking) and each of the nested conversations (room selections).
it_it: Quando si inizia una conversazione innestata, questa viene messa nello stack delle conversazioni. Nell'esempio <varname>nestedbooking</varname>, lo stack consiste in una conversazione long-running più esterna (la prenotazione) e ciascuna delle conversazioni innestate (selezione camere).

source: When requested from EL, the <varname>#{availableRooms}</varname> are loaded by the <varname>@Factory</varname> method defined in <varname>RoomPreferenceAction</varname>. The <varname>@Factory</varname> method will only be executed once to load the values into the current context as a <link linkend="datamodel-annotation"> <varname>@DataModel</varname> </link> instance.
it_it: Quando richiesto da EL, <varname>#{availableRooms}</varname> viene caricata dal metodo <varname>@Factory</varname> definito in <varname>RoomPreferenceAction</varname>. Il metodo <varname>@Factory</varname> verrà eseguito solo una volta per caricare i valore nel contesto attuale come istanza <link linkend="datamodel-annotation"> <varname>@DataModel</varname> </link>.
ja_jp: EL から要求されるとき、<varname>RoomPreferenceAction</varname> に定義された <varname>@Factory</varname> メソッドにより <varname>#{availableRooms}</varname> がロードされます。 <varname>@Factory</varname> メソッドは <link linkend="datamodel-annotation"> <varname>@DataModel</varname> </link> インスタンスのような現在のコンテキストに値をロードするときに 1 度だけ実行されます。

source: Invoking the <varname>#{roomPreference.selectPreference}</varname> action results in the row being selected and set into the <varname>@DataModelSelection</varname>. This value is then outjected to the nested conversation context.
it_it: L'invocazione dell'azione <varname>#{roomPreference.selectPreference}</varname> ha come risultato la selezione della riga e la sua impostazione in <varname>@DataModelSelection</varname>. Questo valore è quindi messo in outjection nel contesto della conversazione innestata.
ja_jp: <varname>#{roomPreference.selectPreference}</varname> アクションを呼び出すことにより行が選択され <varname>@DataModelSelection</varname> に値が設定されます。 そして値はネストされた対話コンテキストにアウトジェクトされます。

source: Revising the dates simply returns to the <varname>/book.xhtml</varname>. Note that we have not yet nested a conversation (no room preference has been selected), so the current conversation can simply be resumed. The <varname>&lt;s:button></varname> component simply propagates the current conversation when displaying the <varname>/book.xhtml</varname> view.
it_it: Un cambiamento alle date semplicemente riporta a <varname>/book.xhtml</varname>. Si noti che ancora non è stata innestata alcuna conversazione (non è stata selezionata nessuna camera), e quindi la conversazione attuale può essere ristabilita. Il componente <varname>&lt;s:button></varname> semplicemente propaga la conversazione corrente quando viene mostrata la vista <varname>/book.xhtml</varname>.
ja_jp: 日付の変更は単純に <varname>/book.xhtml</varname> に返されます。 まだネストされた対話ではないこと （ room preference は選ばれていない ）、現在の対話は単純にレジューム可能であることに留意してください。 <varname>&lt;s:button></varname> コンポーネントは <varname>/book.xhtml</varname> ビューを表示するときに単純に現在の対話を伝播します。

source: Now that we have seen how to nest a conversation, let's see how we can confirm the booking once a room has been selected. This can be achieved by simply extending the behavior of the <varname>HotelBookingAction</varname>.
it_it: Ora che si è visto come innestare una conversazione, vediamo come si può confermare la prenotazione una volta selezionata la camera. Questo può essere ottenuto semplicemente estendendo il comportamento di <varname>HotelBookingAction</varname>.
ja_jp: 今や対話のネスティングの方法がわかったので、部屋が選ばれたらどのように予約を確認することができるかを見てみましょう。 これは <varname>HotelBookingAction</varname>.の振る舞いを単に拡張することによって達成可能です。

source: Annotating an action with <link linkend="end-annotation"> <varname>@End(root=true)</varname> </link> ends the root conversation which effectively destroys the entire conversation stack. When any conversation is ended, its nested conversations are ended as well. As the root is the conversation that started it all, this is a simple way to destroy and release all state associated with a workspace once the booking is confirmed.
it_it: Annotare un'azione con <link linkend="end-annotation"> <varname>@End(root=true)</varname> </link> termina la conversazione radice che distrugge effettivamente tutto lo stack delle conversazioni. Quando una conversazione termina, terminano anche le sue conversazioni innestate. Poiché la conversazione radice è quella che inizia tutto, questo è un modo semplice per distruggere e rilasciare tutto lo stato associato al workspace una volta confermata la prenotazione.

source: The <varname>roomSelection</varname> is only associated with the <varname>booking</varname> on user confirmation. While outjecting values to the nested conversation context will not impact the outer conversation, any objects injected from the outer conversation are injected by reference. This means that any changing to these objects will be reflected in the parent conversation as well as other concurrent nested conversations.
it_it: <varname>roomSelection</varname> è associata solamente a <varname>booking</varname> su conferma dell'utente. Mentre l'outjection dei valori nel contesto della conversazione innestata non impatta sulla conversazione più esterna, qualsiasi oggetto iniettato dalla conversazione più esterna viene iniettato per referimento. Questo significa che qualsiasi cambiamento degli oggetti si rifletterà nella conversazione padre così come in ogni altra conversazione innestata.
ja_jp: <varname>roomSelection</varname> はユーザー確認において <varname>booking</varname> とだけ関連します。 ネストされた対話に値をアウトジェクトする間にコンテキストは外側の対話に影響を与えません。外側の対話からインジェクトされるオブジェクトは参照によりインジェクトされます。 これはオブジェクトに対する変更は別ののネストされた対話だけでなく親の対話にも反映されることを意味しています。

source: By simply annotating the cancellation action with <link linkend="end-annotation"> <varname>@End(root=true, beforeRedirect=true)</varname> </link> we can easily destroy and release all state associated with the workspace prior to redirecting the user back to the hotel selection view.
it_it: Annotando semplicemente l'azione di cancellazione con <link linkend="end-annotation"> <varname>@End(root=true, beforeRedirect=true)</varname> </link>, è possibile distruggere e rilasciare tutto lo stato associato al workspace prima di redirigere l'utente alla vista della selezione hotel.
ja_jp: <link linkend="end-annotation"> <varname>@End(root=true, beforeRedirect=true)</varname> </link> で簡単にアクションをキャンセルするアノテーションによりユーザーをホテル選択ビューにリダイレクトする前に容易にワークスペースに関連するすべての状態を破棄しリリースすることが可能です。

source: Feel free to deploy the application, open many windows or tabs and attempt combinations of various hotels with various room preferences. Confirming a booking always results in the correct hotel and room preference thanks to the nested conversation model.
it_it: Prova il deploy dell'applicazione, apri più finestre o tab e prova combinzioni di vari hotel con varie opzioni di camera. La conferma risulterà sempre nel giusto hotel e con la corretta opzione grazie al modello di conversazioni innestate.
ja_jp: 気軽にアプリケーションをデプロイし、たくさんのウィンドウやタブを開きさまざまな好みの部屋によるさまざまなホテルの組み合わせを試してみて下さい。 予約確認はネストされた対話モデルのおかげで正しいホテルと好みの部屋をもたらします。

source: A complete application featuring Seam and jBPM: the DVD Store example
it_it: Un'applicazione completa di Seam e jBPM: esempio di Negozio DVD
ja_jp: Seam と jBPM を使った本格的アプリケーション: DVD ストアサンプル

source: The DVD Store demo application shows the practical usage of jBPM for both task management and pageflow.
it_it: L'applicazione demo Negozio DVD mostra un utilizzo pratico di jBPM sia per la gestione task sia per il pageflow.
ja_jp: DVD ストアのデモアプリケーションは、 タスク管理とページフローのための jBPM の実践的な使用法を見せてくれます。

source: The user screens take advantage of a jPDL pageflow to implement searching and shopping cart functionality.
it_it: Le schermate utente sfruttano il pageflow jPDL per implementare la ricerca e la funzionalità di carrello della spesa.
ja_jp: ユーザー画面は、検索やショッピングカート機能の実装のために jPDL ページフローを利用しています。

source: DVD Store example
it_it: Esempio di Negozio DVD

source: The administration screens take use jBPM to manage the approval and shipping cycle for orders. The business process may even be changed dynamically, by selecting a different process definition!
it_it: Le schermate di amministrazione utilizzano jBPM per gestire il ciclo di approvazione e di spedizione degli ordini. Il processo di business può anche essere cambiato dinamicamente, selezionando una diversa definizione di processo!
ja_jp: この管理画面は、オーダの承認やショッピングサイクルを管理するために jBPM を利用します。 ビジネスプロセスは、異なるプロセス定義を選択することにより動的に変更されるかもしれません。

source: The Seam DVD Store demo can be run from <literal>dvdstore</literal> directory, just like the other demo applications.
it_it: La demo Negozio DVD può essere eseguita dalla directory <literal>dvdstore</literal>, così come le altre applicazioni.
ja_jp: Seam DVD ストアデモは他のでもアプリケーション同様に <literal>dvdstore</literal> ディレクトリから起動できます。

source: Bookmarkable URLs with the Blog example
it_it: URL segnalibro con l'esempio Blog
ja_jp: Blog サンプルのブックマーク可能 URL

source: Seam makes it very easy to implement applications which keep state on the server-side. However, server-side state is not always appropriate, especially in for functionality that serves up <emphasis>content</emphasis>. For this kind of problem we often want to keep application state in the URL so that any page can be accessed at any time through a bookmark. The blog example shows how to a implement an application that supports bookmarking throughout, even on the search results page. This example demonstrates how Seam can manage application state in the URL as well as how Seam can rewrite those URLs to be even
it_it: Seam facilita l'implementazione di applicazioni che mantengano lo stato lato server. Comunque lo stato lato server non è sempre appropriato, specialmente per funzionalità che lavorano per il contenuto. Per questo genere di problemi spesso si vuole mantenere lo stato dell'applicazione nell'URL affiché ogni pagina possa essere acceduta in qualsiasi momento attraverso un segnalibro. L'esempio Blog mostra come implementare un'applicazione che supporti i segnalibri, anche nel caso di pagine con risultati di ricerca. Questo esempio mostra come Seam può gestire nell'URL lo stato di un'applicazione, così come Seam può riscrivire questi URL.
ja_jp: Seam はサーバサイドで状態保持するアプリケーションの実装をとても容易にします。 しかし、サーバサイドの状態管理はいつも適切というわけではありません。 (特に、<emphasis>コンテンツ (content) </emphasis> を提供する機能において ) この種の問題のために、ユーザーにページをブックマークさせ、 そして、比較的ステートレスなサーバとする必要がしばしばあります、 その結果、ブックマークを通していつでもどんなページにもアクセス可能になります。 この Blog サンプルは Seam を使用した RESTful アプリケーションの実装方法を見せてくれます。 検索結果ページを含むすべてのアプリケーションのページはブックマークが可能です。

source: Blog example
it_it: Esempio di Blog
