Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Validation.po
Languages: it_it, ja_jp

source: JSF form validation in Seam
it_it: Validazione delle form JSF in Seam
ja_jp: Seam での JSF フォーム検証

source: In plain JSF, validation is defined in the view:
it_it: Nel puro JSF la validazione è definita nella vista:
ja_jp: プレーンな JSF では、 検証はビューで定義されます。

source: In practice, this approach usually violates DRY, since most "validation" actually enforces constraints that are part of the data model, and exist all the way down to the database schema definition. Seam provides support for model-based constraints defined using Hibernate Validator.
it_it: In pratica quest'approccio di norma viola il principio DRY (Don't Repeat Yourself = Non ripeterti), poiché la maggior parte della "validazione" forza i vincoli che sono parte del modello di dati, e che esistono lungo tutta la definizione dello schema di database. Seam fornisce supporto ai vincoli del modello definiti, utilizzando Hibernate Validator.
ja_jp: 実際には、 データモデルの一部であり、 またデータベーススキーマの定義全体にわたって存在する制約をほとんどの「検証」が強制実行するため、 この方法は通常、 DRY に違反してしまいます。 Seam は Hibernate Validator を使って定義されるモデルベースの制約に対するサポートを提供しています。

source: Let's start by defining our constraints, on our <literal>Location</literal> class:
it_it: Si cominci col definire i vincoli sulla classe <literal>Location</literal>:
ja_jp: <literal>Location</literal> クラスで制約を定義するところから始めてみます。

source: Well, that's a decent first cut, but in practice it might be more elegant to use custom constraints instead of the ones built into Hibernate Validator:
it_it: Bene, questa è una prima buona riduzione, ma in pratica è possibile essere più eleganti utilizzando dei vincoli personalizzati invece di quelli interni a Hibernate Validator:
ja_jp: たしかに上記が正当ですが、 実際には Hibernate Validator に組み込みのものを使わずにカスタムな制約を使う方がスマートかもしれません。

source: Whichever route we take, we no longer need to specify the type of validation to be used in the JSF page. Instead, we can use <literal>&lt;s:validate&gt;</literal> to validate against the constraint defined on the model object.
it_it: Qualsiasi strada si prenda non occorre più specificare il tipo di validazione da usare nelle pagine JSF. Invece è possibile usare <literal>&lt;s:validate&gt;</literal> per validare il vincolo definito nell'oggetto modello.
ja_jp: いずれの方法をとるにしても、 JSF ページ内で使用される検証のタイプを指定する必要がなくなります。 代わりに、 <literal>&lt;s:validate&gt;</literal> を使ってモデルオブジェクトで定義される制約に対して検証を行うことができます。

source: <emphasis>Note:</emphasis> specifying <literal>@NotNull</literal> on the model does <emphasis>not</emphasis> eliminate the requirement for <literal>required="true"</literal> to appear on the control! This is due to a limitation of the JSF validation architecture.
it_it: <emphasis>Nota:</emphasis> specificare <literal>@NotNull</literal> nel modello <emphasis>non</emphasis> elimina la necessità di <literal>required="true"</literal> per farlo apparire nel controllo! Questo è dovuto ad una limitazione nell'architettura di validazione in JSF.
ja_jp: <emphasis>注記:</emphasis> このモデルで <literal>@NotNull</literal> を指定してもコントロールに出現させるのに <literal>required="true"</literal> が必要なくなるというわけではありません。これは JSF 検証アーキテクチャの限界によるものです。

source: This approach <emphasis>defines</emphasis> constraints on the model, and <emphasis>presents</emphasis> constraint violations in the view &#8212; a significantly better design.
it_it: Quest'approccio <emphasis>definisce</emphasis> i vincoli sul modello e <emphasis>presenta</emphasis> le violazioni al vincolo nella vista &#8212; di gran lunga un miglior design.

source: However, it is not much less verbose than what we started with, so let's try <literal>&lt;s:validateAll&gt;</literal>:
it_it: Comunque non è molto meno corto di quanto lo era all'inizio, quindi proviamo <literal>&lt;s:validateAll&gt;</literal>:
ja_jp: しかし、 例と比べてそれほど冗長性が軽減されているわけではないので、 <literal>&lt;s:validateAll&gt;</literal> を使ってみます。

source: This tag simply adds an <literal>&lt;s:validate&gt;</literal> to every input in the form. For a large form, it can save a lot of typing!
it_it: Questo tag semplicemente aggiunge un <literal>&lt;s:validate&gt;</literal> ad ogni input nella form. Per form grandi questo fa risparmiare molto!
ja_jp: このタグは単純に <literal>&lt;s:validate&gt;</literal> をフォーム内のすべての入力に追加します。 フォームが大きくなる場合は、 入力の手間をかなり省くことができることになります。

source: Now we need to do something about displaying feedback to the user when validation fails. Currently we are displaying all messages at the top of the form. In order for the user to correlate the message with an input, you need to define a label using the standard <literal>label</literal> attribute on the input component.
it_it: Adesso occorre fare qualcosa per mostrare all'utente un messaggio quando la validazione fallisce. Ora vengono mostrati tutti i messaggi in cima alla form. Per consentire all'utente di associare il messaggio al singolo input, occorre definire un'etichetta e usare l'attributo standard <literal>label</literal> sul componente d'input.
ja_jp: ここで、 検証が失敗した場合にユーザーに対してフィードバックを表示させるために何らかの手を打たなければなりません。 現在、 すべてのメッセージはフォームの冒頭で表示しています。 ユーザーがメッセージと入力を関連付けられるようにするため、 入力コンポーネントで標準の <literal>label</literal> 属性を使いラベルを定義する必要があります。

source: You can then inject this value into the message string using the placeholder {0} (the first and only parameter passed to a JSF message for a Hiberate Validator restriction). See the internationalization section for more information regarding where to define these messages.
it_it: Si può iniettare questo valore nella stringa del messaggio usando il placeholder {0} (il primo ed unico parametro passato al messaggio JSF a causa di una restrizione in Hibernate Validator). Vedere la sezione Internazionalizzazione per ulteriori informazioni sulla definizione dei messaggi.
ja_jp: 次にプレースホルダーの {0} を使ってこの値をメッセージ文字列にインジェクトすることができます (Hiberate Validator の制約用に JSF メッセージに渡される最初で唯一のパラメータ)。 これらのメッセージを定義する場所については国際化 (Internationalization) のセクションをご覧ください。

source: validator.length={0} length must be between {min} and {max}
it_it: validator.length={0} la lunghezza deve essere tra {min} e {max}
ja_jp: validator.length={0} 長さは {min} と {max} の間でなければなりません

source: What we would really like to do, though, is display the message next to the field with the error (this is possible in plain JSF), highlight the field and label (this is not possible) and, for good measure, display some image next to the field (also not possible). We also want to display a little colored asterisk next to the label for each required form field. Using this approach, the identifying label is not necessary.
it_it: Ciò che si vuole fare, tuttavia, è mostrare il messaggio vicino al campo con l'errore (questo è possibile nel semplice JSF), ed evidenziare il campo e l'etichetta (questo non è possibile) ed, eventualmente, mostrare un'immagine vicino al campo (anche questo non è possibile). Si vuole anche mostrare un piccolo asterisco colorato vicino all'etichetta per ciascun campo richiesto. Utilizzando quest'approccio non è più necessario identificare l'etichetta.
ja_jp: 実際に行いたいのは、 エラーを付けてフィールドのとなりにメッセージを表示 (プレーン JSF で可能)、 フィールドとラベルをハイライトさせて (これは不可能)、 ついでにフィールドのとなりに何かイメージを表示させる (これも不可能) ことです。 また、 必須事項の各フィールドにはラベルのとなりに色の付いたアスタリスクを表示させたいとします。 これを行うのにラベルを識別する必要はありません。

source: That's quite a lot of functionality we need for each field of our form. We wouldn't want to have to specify higlighting and the layout of the image, message and input field for every field on the form. So, instead, we'll specify the common layout in a facelets template:
it_it: Si ha quindi bisogno di parecchia funzionalità per ogni singolo campo della form. Ma non si vuole essere costretti a specificare per ogni campo della form come evidenziare, come disporre l'immagine, quale messaggio scrivere e quale è il campo d'input da associare.
ja_jp: フォームの各フィールドに対してかなり多くの機能を必要としています。 フォームにあるすべてのフィールドそれぞれに対してイメージ、メッセージ、入力フィールドのレイアウトやハイライトを指定したいとは思わないでしょうから、 代わりに facelets テンプレートで共通のレイアウトを指定します。

source: We can include this template for each of our form fields using <literal>&lt;s:decorate&gt;</literal>.
it_it: Si può includere questo template per ciascun campo della form utilizzando <literal>&lt;s:decorate&gt;</literal>.
ja_jp: <literal>&lt;s:decorate&gt;</literal> を使って各フォームフィールドにこのテンプレートを含ませることができます。

source: Finally, we can use RichFaces Ajax to display validation messages as the user is navigating around the form:
it_it: Infine è possibile utilizzare RichFaces Ajax per mostrare i messaggi di validazione mentre l'utente naviga nella form:
ja_jp: 最後に、 ユーザーがフォーム内を行ったり来たりするのに応じて RichFaces Ajax を使って検証メッセージを表示させることができます。

source: It's better style to define explicit ids for important controls on the page, especially if you want to do automated testing for the UI, using some toolkit like Selenium. If you don't provide explicit ids, JSF will generate them, but the generated values will change if you change anything on the page.
it_it: E' meglio definire esplicitamente gli id per i controlli importanti all'interno di una pagina, specialmente in caso di un test automatico della UI, utilizzando dei toolkit quale Selenium. Se non vengono forniti gli id in modo esplicito, JSF li genererà, ma i valori generati cambieranno se si cambia qualcosa nella pagina.
ja_jp: ページ上の重要なコントロールに明示的な ID を定義することは好ましいスタイルです。 特に UI 用の自動テストを Selenium などのツールキットを使用して行いたい場合に適しています。 明示的な ID を与えないと、 JSF はそれらを生成しますがページ上で変更があると生成された値が変化します。

source: And what if you want to specify a different message to be displayed when validation fails? You can use the Seam message bundle (and all it's goodies like el expressions inside the message, and per-view message bundles) with the Hibernate Validator:
it_it: E se si vuole specificare un messaggio diverso quando la validazione fallisce? Si può utilizzare il message bundle di Seam con Hibernate Validator (e tutte le altre finezze come le espressioni EL dentro il messaggio ed i message bundle per ogni singola vista).
ja_jp: 検証が失敗したときに表示させるメッセージを変えたい場合はどうでしょう。 Seam メッセージバンドル (およびメッセージ中の EL 式やビューごとのメッセージバンドルなど優れたものすべて) を Hibernate Validator で使用することができます。

source: location.zipCode.invalid = The zip code is not valid for #{location.name}
it_it: location.zipCode.invalid = Codice ZIP non valido per #{location.name}
ja_jp: location.zipCode.invalid = #{location.name} に対する有効な郵便番号ではありません
