Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Weblogic.po
Languages: it_it, ja_jp

source: Seam on BEA's Weblogic
it_it: Seam su Weblogic di BEA
ja_jp: BEA Weblogic における Seam

source: Weblogic 10.3 is BEA's latest stable JEE5 server offering. Seam applications can be deployed and developed on Weblogic servers, and this chapter will show you how. There are some known issues with the Weblogic servers that will need to be worked around, and configuration changes that are needed specific to Weblogic.
it_it: Weblogic 10.3 è l'ultimo server JEE5 stabile proposto da BEA. Le applicazioni Seam possono essere sviluppate e installate sui server Weblogic, e questo capitolo vi mostrerà in che modo. Ci sono alcuni problemi noti da aggirare relativi ai server Weblogic e alcune modifiche alle configurazioni che sono specifiche di Weblogic.
ja_jp: WebLogic 10.3 はBEAが提供している最新版の安定したJ2EEサーバです。SeamアプリケーションはWebLogicサーバ上でデプロイと開発が可能であり、この章ではその方法を示します。WebLogicサーバでは動作上いくつかの既知の問題があり、WebLogicの仕様上、設定の変更が必要となります。

source: First step is to get Weblogic downloaded, installed and running. Then we'll talk about Seam's JEE5 example and the hurdles to getting it running. After that, the JPA example will be deployed to the server. Then finally we will create a <literal>seam-gen</literal> application and get it up and running to provide a jump start to your own application.
it_it: Innanzitutto bisogna scaricare Weblogic, installarlo e avviarlo. Quindi passeremo a parlare dell'esempio JEE5 di Seam e deigli ostacoli da superare per farlo funzionare. Dopo di ché, installeremo l'esempio JPA. Infine creeremo un'applicazione <literal>seam-gen</literal> e la faremo girare per fornire un punto di partenza alla vostra applicazione.
ja_jp: 最初にWebLogicをダウンロード、インストールそして実行します。次にSeamのJEE5のサンプルを操作して実行させます。その後JPAのサンプルがサーバにデプロイされます。そして最後に <literal>seam-gen</literal> アプリケーションを作成し、独自のアプリケーションを開始するためにその作成したアプリケーションを起動します。

source: Installation and operation of Weblogic
it_it: Installazione e operatività di Weblogic
ja_jp: WebLogicのインストールと操作

source: First things first we need to get the server installed. There are some outstanding issues that were not addressed in 10.3, but it does solve some of the issues discussed below without the need for BEA patches. The previous release 10.0.MP1 is also available, but requires some BEA patches to function correctly.
it_it: Prima di tutto bisogna installare il server. Ci sono alcuni problemi non trascurabili che non sono stati affrontati nella 10.3, che tuttavia risolve alcuni di quelli discussi sotto senza dover installare le patch di BEA. E' disponibile anche il precedente rilascio, 10.0.MP1, che, tuttavia, richiede le patch di BEA per funzionare correttamente.
ja_jp: まず最初にサーバをインストールする必要があります。いくつか際立った問題がありますが、それは10.3には該当しません。その問題のいくつかはBEAのパッチなしで解決できます。しかし、一つ前のリリースである10.0.MP1も利用可能ですが、正常動作のためにはBEAのパッチを必要とします。

source: <literal>Weblogic 10.0.MP1</literal> &#8212; <ulink url="http://www.oracle.com/technology/software/products/ias/htdocs/wls_main.html"> Download page </ulink>
it_it: <literal>Weblogic 10.0.MP1</literal> &#8212; <ulink url="http://www.oracle.com/technology/software/products/ias/htdocs/wls_main.html"> Pagina di download </ulink>
ja_jp: <literal>Weblogic 10.0.MP1</literal> &#8212; <ulink url="http://www.oracle.com/technology/software/products/ias/htdocs/wls_main.html"> ダウンロード ページ </ulink>

source: 10.0.MP1 has some known issues with EJBs that use <literal>varargs</literal> in their methods (it confuses them as <literal>transient</literal> ), as well as some others. See <xref linkend="weblogic-ejb-issues"/> for full details on the issues and the work around.
it_it: La versione 10.0.MP1 ha alcuni problemi noti con gli EJBs che usano <literal>varargs</literal> nei propri metodi (li confonde con <literal>transient</literal> ), e non sono gli unici. Si veda <xref linkend="weblogic-ejb-issues"/> per tutti i dettagli su tali problemi e per le relative soluzioni.
ja_jp: 10.0.MP1は、EJBで使用しているメソッドで問題がいくつか知られています。その問題とは他のものと同じようにこれらのメソッドにある<literal>varargs</literal>（これらの可変引数を<literal>transient</literal>として混乱させる）を使用することによって生じます。問題と動作のすべての詳細は次を参照してください。<xref linkend="weblogic-ejb-issues"/>

source: <literal>Weblogic 10.3</literal> &#8212; <ulink url="http://www.oracle.com/technology/software/products/ias/htdocs/wls_main.html"> Download page </ulink>
it_it: <literal>Weblogic 10.3</literal> &#8212; <ulink url="http://www.oracle.com/technology/software/products/ias/htdocs/wls_main.html"> Pagina di download </ulink>
ja_jp: <literal>Weblogic 10.3</literal> &#8212; <ulink url="http://www.oracle.com/technology/software/products/ias/htdocs/wls_main.html"> ダウンロードページ </ulink>

source: This is the latest stable release of the Weblogic server, and the one that will be used with the examples below. This version has addressed some of the issues with EJBs that were in 10.0.MP1. However one of the changes did not make it into this release. See <xref linkend="weblogic-ejb-issues"/> for the details, but because of this we still need to use the special Weblogic seam jar discussed below.
it_it: Questa è l'ultima versione stabile del server Weblogic, e quello che sarà usato negli esempi sottostanti. Questa versione ha sistemato alcuni dei malfunzionamenti relativi agli EJB che esistevano nella versione 10.0.MP1. Comunque una delle modifiche non è stata inserita in questa versione. Si veda <xref linkend="weblogic-ejb-issues"/> per i dettagli, e perciò bisogna ancora usare lo speciale jar di Seam di Weblogic discusso di seguito.
ja_jp: これはWebLogicの最新の安定リリースで、そしてその一つは下記においてそのサンプルと共に使用されています。このバージョンは10.0.MP1に含まれていたEJBのいくつかの問題に取り組んできました。しかしながらた、変更のなかの一つはこのリリースではうまくいきませんでした。 詳細は次を参照してください。<xref linkend="weblogic-ejb-issues"/> しかしながらこの問題のために使用する特別なWebLogic用のjarファイルについては下記で議論します。

source: Special <literal>jboss-seam.jar</literal> for Weblogic EJB Support
it_it: Il jar speciale <literal>jboss-seam.jar</literal> per il supporto EJB in Weblogic
ja_jp: Weblogic EJB サポート用の特別な <literal>jboss-seam.jar</literal>

source: Starting with Seam 2.0.2.CR2 a special Weblogic specific jar has been created that does not contain the <literal>TimerServiceDispatcher </literal>. This is the EJB that uses <literal>varargs</literal> and exposes the second EJB issue. We will be using this jar for the <literal>jee5/booking</literal> example, as it avoids the known BEA issues.
it_it: A partire da Seam 2.0.2.CR2 per Weblogic è stato creato un jar speciale che non contiene il <literal>TimerServiceDispatcher </literal>. Questo è l'EJB che usa <literal>varargs</literal> e presenta il secondo problema relativo agli EJB. Ci troveremo ad usare questo jar per l'esempio <literal>jee5/booking</literal>, poiché evita i noti problemi di BEA.
ja_jp: Seam 2.0.2.CR2 を起動すると、特殊なWebLogicの仕様のjarファイルが作成されますが、それには<literal>TimerServiceDispatcher </literal>は含まれていません。これはEJBが可変引数を使用していることがEJBの第2の問題を露呈させています。このBEAの既知の問題をさけるために<literal>jee5/booking</literal> のサンプルでは、このjarファイルを使用することにします。

source: Installing 10.3
it_it: Installare la versione 10.3
ja_jp: 10.3のインストール

source: Here are the quick steps to installing Weblogic 10.3. For more details or if you are having any issues please check with the BEA docs at the <ulink url="http://edocs.bea.com/wls/docs103/"> Weblogic 10.3 Doc Center </ulink> . Here we install the RHEL 5 version using the graphical installer:
it_it: Ecco velocemente i passi necessari ad installare Weblogic 10.3. Per maggiori dettagli e nel caso si presentino dei problemi, consultare i documenti BEA all'indirizzo <ulink url="http://edocs.bea.com/wls/docs103/"> Weblogic 10.3 Doc Center </ulink> . Qui verrà installata la versione RHEL 5 usando l'installazione grafica:
ja_jp: ここにはWeblogic 10.3をインストールするために簡単な手順があります。詳細を知りたい場合や問題を抱えた場合は、BEAのドキュメントを参照してください。<ulink url="http://edocs.bea.com/wls/docs103/"> Weblogic 10.3 ドキュメントセンタ </ulink> . ここで、グラフィカルインストーラーを用いて RHEL バージョン5 をインストールします。

source: Follow the link given above for 10.3 and download the correct version for your environment. You will need to sign up for an account with Oracle in order to do this.
it_it: Si segua il link alla 10.3 indicato sopra e si scarichi la versione adatta al proprio ambiente. Sarà necessario creare un account Oracle per portare a termine l'operazione.
ja_jp: 10.3 用の上のリンクにしたがってあなたの環境に正しいバージョンをインストールしてください。これを使用するためにはオラクルのアカウントを使用してサインアップする必要があります。

source: You may need to change the the <literal>server103_XX.bin</literal> file to be executable:
it_it: Può essere necessario rendere eseguibile il file <literal>server103_XX.bin</literal>:
ja_jp: 実行形式の<literal>server103_XX.bin</literal> ファイルを変更する必要があるかもしれません。

source: Execute the install:
it_it: Eseguite l'installazione:
ja_jp: インストールを実行します。

source: When the graphical install loads, you need to set the BEA home location. This is where all BEA applications are installed. This location will be known as <literal>$BEA_HOME</literal> in this document e.g.:
it_it: Quando l'installazione grafica è caricata, bisogna impostare il percorso della home directory di BEA. Questo è il punto dove sono installate tutte le applicazioni BEA. In questo documento tale punto sarà identificato con <literal>$BEA_HOME</literal>, ad esempio:
ja_jp: グラフィカルインストールをロードしたら、BEAのホームロケーションに設定する必要があります。このロケーションはBEAのアプリケーションがインストールされている場所です。このロケーションはこのドキュメント上では、 <literal>$BEA_HOME</literal> として知られています。

source: Select <literal>Complete</literal> as the installation type. You do not need all the extras of the complete install (such as struts and beehive libraries), but it will not hurt.
it_it: Come tipo di installazione bisogna selezionare <literal>Complete</literal>. Non c'è bisogno di tutti gli extra dell'installazione competa (come le librerie struts e beehive), ma non farà alcun male.
ja_jp: インストールタイプとして、<literal>Complete</literal>を選択してください。完全インストールのすべてのオプションは必要ありません（strutsやbeehiveのライブラリのように）が、入れても害はありません。

source: You can leave the defaults for the component installation locations on the next page.
it_it: Nella pagina successiva è possibile lasciare i valori predefiniti delle posizioni di installazione dei componenti.
ja_jp: 次のページにあるコンポーネントのインストールはデフォルトのままにしてください。

source: Creating your Weblogic domain
it_it: Creazione del dominio Weblogic
ja_jp: Weblogicのドメインを作成する。

source: A Weblogic domain is similar to a JBoss server configuration - it is a self contained server instance. The Weblogic server you just installed has some example domains, but we are going to create one just for the seam examples. You can use the existing domains if you wish (modify the instructions as needed).
it_it: Un dominio Weblogic è simile ad una configurazione del server JBoss - è un'istanza autosufficiente del server. Il server Weblogic appena installato ha alcuni domini di esempio, ma noi ne creeremo uno apposito per gli esempi di Seam. Se si vuole, è possibile usare i domini esistenti (modificando le istruzioni opportunamente).
ja_jp: WebLogicのドメインはJBossサーバの設定と類似しています。それは、サーバ（アプリケーション）のインスタンス自体がサーバ（管理プログラム）に入っているということです。インストールしたばかりのWebLogicサーバは、いくつかのサンプルドメインを保持していますが、Seamのサンプル用には一つだけ作成します。しようと思えば既にあるドメインを使用することもできます（必要に応じて設定を変更します）。

source: Start up the Weblogic configuration wizard:
it_it: Avviare il wizard di configurazione di Weblogic:
ja_jp: Weblogic設定画面を起動します。

source: Choose to create a new domain, configured to support <literal>Weblogic Server</literal>. Note that this is the default domain option.
it_it: Si scelga di creare un nuovo dominio, configurato per supportare <literal>Weblogic Server</literal>. Tenete presente che questa è l'opzione predefinita per il dominio.
ja_jp: 作成する新しいドメイン（そのドメインは<literal>Weblogic Server</literal>をサポートするために設定されたものです）を選択してください。これはデフォルトのドメインオプションであることに注意してください。

source: Set a username and password for this domain.
it_it: Impostate un utente ed una password per questo dominio.
ja_jp: ユーザー名とパスワードをこのドメインに対して設定してください。

source: Next choose <literal>Development Mode</literal> and the default JDK when given the option.
it_it: Quindi si scelga <literal>Development Mode</literal> e il JDK predefinito quando richiesto.
ja_jp: 次に、オプションが表示されるので、<literal>Development Mode</literal>とデフォルトのJDKを選択してください。

source: The next screen asks if you want to customize any setting. Select <literal>No</literal>.
it_it: La schermata successiva chiede se si vuole personalizzare qualche proprietà. Bisogna selezionare <literal>No</literal>.
ja_jp: 次のスクリーンでなにか設定をカスタマイズしたいか聞いてきます。 <literal>No</literal>を選択してください。

source: Finally set the name of the domain to <literal>seam_examples</literal> and leave the default domain location.
it_it: Infine bisogna indicare <literal>seam_examples</literal> come nome del dominio e lasciare la sua posizione predefinita.
ja_jp: 最後にドメイン名を<literal>seam_examples</literal> に設定してください、デフォルトのドメインの場所のままにしてください。

source: How to Start/Stop/Access your domain
it_it: Come avviare/arrestare/accedere il dominio
ja_jp: ドメインの 起動/停止/アクセス 方法

source: Now that the server is installed and the domain is created you need to know how to start and stop it, plus how to access its configuration console.
it_it: Ora che si è installato il server e creato il dominio, bisogna imparare ad avviarlo ed arrestarlo, oltre ad accedere alla console di configurazione.
ja_jp: 既にサーバはインストールされドメインは作成されたので、それを起動、停止、加えて設定コンソールにアクセスする方法を知る必要があります。

source: Starting the domain:
it_it: Avviare il dominio:
ja_jp: ドメインの起動

source: This is the easy part - go to the <literal> $BEA_HOME/user_projects/domains/seam_examples/bin </literal> directory and run the <literal>./startWeblogic.sh</literal> script.
it_it: Questa è la parte facile - entrate nella directory <literal> $BEA_HOME/user_projects/domains/seam_examples/bin </literal> e lanciate lo script <literal>./startWeblogic.sh</literal>
ja_jp: ここは簡単な箇所です。<literal> $BEA_HOME/user_projects/domains/seam_examples/bin </literal> ディレクトリに行き <literal>./startWeblogic.sh</literal>スクリプトを実行してください。

source: Accessing the configuration console:
it_it: Accedere alla console di configurazione:
ja_jp: 設定コンソールへアクセス

source: Launch <literal>http://127.0.0.1:7001/console</literal> in your web browser. It will ask for your username and password that you entered before. We won't get into this much now, but this is the starting point for a lot of the various configurations that are needed later.
it_it: Col browser andate all'indirizzo <literal>http://127.0.0.1:7001/console</literal>. Vi saranno richiesti l'utente e la password inseriti in precedenza. Non ci addentreremo molto in questa questione, ma questo è il punto di partenza per molte delle diverse configurazioni di cui avremo bisogno più tardi.
ja_jp: ウェブブラウザで、<literal>http://127.0.0.1:7001/console</literal>を開いてください。設定時に入力したユーザー名とパスワードを聞かれます。このページは今はあまり開きませんが、ここは後々必要になる多くの設定の最初のページです。

source: Stopping the domain:
it_it: Arrestare il dominio:
ja_jp: ドメインの停止

source: There are a couple of options here:
it_it: In questo caso ci sono un paio di opzioni:
ja_jp: ここには2、3のオプションがあります。

source: The recommended way is through the configuration console:
it_it: Il modo raccomandato si basa sulla console di configurazione:
ja_jp: お薦めの方法は、設定コンソール上で行う方法です。

source: Select <literal>seam_examples</literal> on the left hand side of the console.
it_it: Selezionate <literal>seam_examples</literal> sul lato sinistro della console.
ja_jp: コンソールの左側にある<literal>seam_examples</literal>を選択してください。

source: Choose the <literal>Control</literal> tab in the middle of the page.
it_it: Clicacte sulla linguetta <literal>Control</literal> nel mezzo della pagina.
ja_jp: ページの真ん中にある<literal>seam_examples</literal>タブを選択してください。

source: Select the check box <literal>AdminServer</literal> in the table.
it_it: Nella tabella selezionate la casella di spunta <literal>AdminServer</literal>.
ja_jp: テーブルのなかにある<literal>AdminServer</literal>チェックボックスを選択してください。

source: Choose <literal>Shutdown</literal> just above the table, and select either <literal>When work completes</literal> or <literal>Force shutdown now</literal> as appropriate.
it_it: Scegliete <literal>Shutdown</literal> appena sopra la tabella, e selezionate l'opzione appropriata tra <literal>When work completes</literal> e <literal>Force shutdown now</literal>.
ja_jp: テーブルのちょうど上にある <literal>Shutdown</literal>を選択してください。そして適切に <literal>When work completes</literal> か<literal>Force shutdown now</literal>を選択してくさい。

source: Hitting <literal>Ctrl-C</literal> in the terminal where you started the domain.
it_it: Premere <literal>Ctrl-C</literal> nel terminale in cui è stato avviato il dominio.
ja_jp: 起動ドメインのターミナルでの<literal>Ctrl-C</literal>コマンド

source: No negative effects have been seen, but we would not recommend doing this while in the middle of configuration changes in the console.
it_it: Non si sono visti effetti negativi, but non raccomanderemmo di effettuare questa operazione mentre si stanno apportando delle modifiche alla configurazione nella console.
ja_jp: なにも問題はありませんが、コンソールでの設定変更中におけるこのコマンドは推奨しません。

source: A note on Weblogic classloading
it_it: Una nota sul classloading di Weblogic
ja_jp: Weblogicのクラスロードにおける注意点

source: When using the <literal>/autodeploy</literal> directory as described in this chapter you may see <literal>NoClassDefFound</literal> exceptions during redeployment's. If you see this try restarting the Weblogic server. If you still see it remove the auto-deployed EAR/WAR files, restart the server, and redeploy. We could not find a specific reason for this, but others seem to be having this issue as well.
it_it: Quando si utilizza la directory <literal>/autodeploy</literal> come descritto in questo capitolo, è possibile vedere delle eccezioni <literal>NoClassDefFound</literal> durante il re-deploy delle applicazioni. Se le vedete, provate a riavviare il server. Se continuate a vederle, eliminate i file EAR/WAR autoinstallati, riavviate il server e rifate il deploy. Non abbiamo trovato la ragione specifica di questo comportamento, tuttavia sembra che anche altri abbiano avuto questo genere di problema.
ja_jp: この章で記述されているように<literal>/autodeploy</literal> 直接を使用している場合、再デプロイ中に<literal>NoClassDefFound</literal>例外を見るかもしれません。もしこの事象が起こったらWeblogicサーバの再起動を試みてください。削除したauto-deployed EAR/WAR filesをまだ見るようだったら、サーバを再起動して再デプロイしてください。この問題の仕様面での理由は分かりませんが、しかしその点を除けばこの問題はよくなるようです。

source: Setting up Weblogic's JSF Support
it_it: Impostazione del supporto JSF in Weblogic
ja_jp: WeblogicのJSFサポートの設定

source: These are the instructions to deploy and configure Weblogic's JSF 1.2 libraries. Out of the box Weblogic does not come with its own JSF libraries active. For complete details see <ulink url="http://edocs.bea.com/wls/docs103/webapp/configurejsfandjtsl.html"> Weblogic 10.3 Configuring JSF and JSTL Libraries </ulink>
it_it: Queste sono le istruzioni per installare e configurare le librerie JSF 1.2 di Weblogic. Weblogic non viene distribuito con le librerie JSF preinstallate. Per i dettagli completi si veda <ulink url="http://edocs.bea.com/wls/docs103/webapp/configurejsfandjtsl.html"> Weblogic 10.3 Configuring JSF and JSTL Libraries </ulink>
ja_jp: これらの使用説明は（以降参照）はWeblogicのJSF 1.2ライブラリをデプロイそして設定するためのものです。そのままの状態ではWeblogicに入っているJSFライブラリはアクティブになりません。詳細は、 <ulink url="http://edocs.bea.com/wls/docs103/webapp/configurejsfandjtsl.html"> Weblogic 10.3 Configuring JSF and JSTL Libraries </ulink>を参照してください。

source: In the administration console navigate to the <literal>Deployments</literal> page using the left hand menu.
it_it: Nella console di amministrazione navigate alla pagina <literal>Deployments</literal> usando il menù sul lato sinistro.
ja_jp: 管理コンソールでは、左側のメニューを使用して、<literal>Deployments</literal> ページに進みます。

source: Then select the <literal>Install</literal> button at the top of the deployments table
it_it: A questo punto prenmete il pulsante <literal>Install</literal> in cima alla tabella dei deployment
ja_jp: デプロイメントテーブルにの一番上にある<literal>Install</literal>ボタンを選択したら

source: Using the directory browser navigate to the <literal>$BEA_HOME/wlserver_10.3/common/deployable-libraries </literal> directory. Then select the <literal>jsf-1.2.war</literal> archive, and click the <literal>Next</literal> button.
it_it: Usando il browser delle directory navigate alla directory <literal>$BEA_HOME/wlserver_10.3/common/deployable-libraries </literal>. Selezionate l'archivio <literal>jsf-1.2.war</literal>, e cliccate il pulsante <literal>Next</literal>.
ja_jp: ディレクトリブラウザを使って<literal>$BEA_HOME/wlserver_10.3/common/deployable-libraries </literal> ディレクトリに進みます。 <literal>jsf-1.2.war</literal>アーカイブを選択したら<literal>Next</literal> ボタンをクリックします。

source: Make sure that the <literal>Install this deployment as a library</literal> is selected. Click the <literal> Next </literal> button on the <literal>Install Application Assistant</literal> page.
it_it: Accertatevi che sia selezionata l'opzione <literal>Install this deployment as a library</literal>. Cliccate il pulsante <literal> Next </literal> della pagina <literal>Install Application Assistant</literal>.
ja_jp: <literal>Install this deployment as a library</literal> が選択されていることを確認してください。<literal>Install Application Assistant</literal> ページにある<literal> Next </literal>ボタンをクリックしてください。

source: Click the <literal>Next</literal> button on the <literal> Optional Settings</literal> page.
it_it: Premete il pulsante <literal>Next</literal> della pagina <literal> Optional Settings</literal>.
ja_jp: <literal> Optional Settings</literal>ページにある<literal>Next</literal>ボタンをクリックしてください。

source: Make sure that the <literal>Yes, take me to the deployment's configuration screen.</literal> is selected. Click the <literal>Finish</literal> button on the <literal> Review your choices and click Finish</literal> page.
it_it: Accertatevi che sia selezionata l'opzione <literal>Yes, take me to the deployment's configuration screen.</literal>. Cliccate il pulsante <literal>Finish</literal> della pagina <literal> Review your choices and click Finish</literal>.
ja_jp: <literal>Yes, take me to the deployment's configuration screen.</literal>が選択されていることを確認してください。<literal> Review your choices and click Finish</literal>ページにある <literal>Finish</literal>ボタンをクリックしてください。

source: On the <literal>Settings for jsf(1.2,1.2.3.1)</literal> page set the <literal>Deployment Order</literal> to <literal>99</literal> so that it is deployed prior to auto deployed applications. Then click the <literal> Save</literal> button.
it_it: Nella pagina <literal>Impostazioni per jsf(1.2,1.2.3.1)</literal> impostate <literal>Deployment Order</literal> a <literal>99</literal> in modo che il supporto JSF venga installato prima delle applicazioni sottoposte ad autodeploy. Poi cliccate sul bottone <literal>Save</literal>.
ja_jp: 自動的にデプロイされているアプリケーションより優先的にデプロイされるために<literal>Settings for jsf(1.2,1.2.3.1)</literal>ページで <literal>Deployment Order</literal>に <literal>99</literal>を設定してください。それから、<literal> Save</literal> ボタンをクリックしてください。

source: There is another step that is needed for this to work. For some reason, even with the steps above classes in the <literal> jsf-api.jar</literal> are not found during application deployment. The only way for this to work is to put the <literal> javax.jsf_1.2.0.0.jar</literal> (the jsf-api.jar) from <literal>jsf-1.2.war</literal> in the domains shared library. This requires a restart of the server.
it_it: Bisogna eseguire un altro passo per far funzionare il tutto. Per qualche motivo, anche eseguendo le operazioni precedenti, durante il deploy dell'applicazione non vengono trovate delle classi di <literal> jsf-api.jar</literal>. L'unico modo per ovviare al problema è di spostare <literal> javax.jsf_1.2.0.0.jar</literal> (il jsf-api.jar) da <literal>jsf-1.2.war</literal> nelle librerie condivise dei domini. Questo richiede il riavvio del server.
ja_jp: JSFを動かすために必要なもう一つのステップがあります。いくつかの理由のために、そのステップで<literal> jsf-api.jar</literal> の中にあるクラスが、アプリケーションのデプロイメントの間に見つからないことさえあります。動かすための唯一の方法は、ドメインの中にある共有ライブラリにある<literal>jsf-1.2.war</literal>から<literal> javax.jsf_1.2.0.0.jar</literal> (jsf-api.jar)を置くことです。このことはサーバの再起動を必要とします。

source: The <literal>jee5/booking</literal> Example
it_it: L'esempio <literal>jee5/booking</literal>
ja_jp: <literal>jee5/booking</literal>サンプル
