Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Weblogic.po
Languages: it_it, ja_jp

source: Do you want to run Seam using EJB's on Weblogic? If so there are some obstacles that you will have to avoid, or some patches that are needed from BEA. This section describes those obstacles and what changes are needed to the <literal>jee5/booking</literal> example to get it deployed and functioning.
it_it: Si vuole usare Seam con gli EJB su Weblogic? In questo caso ci sono alcuni ostacoli da evitare o alcune patch di BEA ad installare. Questa sezione descrive questi ostacoli e quali modifiche apportare all'esempio <literal>jee5/booking</literal> per installarlo correttamente e farlo funzionare.
ja_jp: WeblogicのEJBを用いてSeamを動かしたいのなら、避けなければならないいくつか障害があります。さもないとBEAからのいくつかのパッチが必要となります。この節では、これらの障害と<literal>jee5/booking</literal>サンプルをデプロイおよび機能させるのに必要な変さらについて記述します。

source: EJB3 Issues with Weblogic
it_it: I problemi di Weblogic con EJB3
ja_jp: Weblogic上のEJB3の問題

source: For several releases of Weblogic there has been an issue with how Weblogic generates stubs and compiles EJB's that use variable arguments in their methods. This is confirmed in the Weblogic 9.X and 10.0.MP1 versions. Unfortunately the 10.3 version only partially addresses the issue as detailed below.
it_it: Per molte versione successive di Weblogic c'è stato un problema relativo a come Weblogic genera gli stub e a come compila gli EJB che usano argomenti variabili nei propri metodi. Problema confermato nelle versioni 9.X e 10.0.MP1. Purtroppo la versione 10.3 lo affronta solo parzialmente come dettagliato di seguito.
ja_jp: Weblogicのいくつかのリリースにおいて、いかにしてWeblogicがメソッド中の可変引数使うスタブを生成したり、EJBをコンパイルしたりするかという問題がありました。このことはWeblogic 9.Xと10.0.MP1のバージョンで確認されています。残念ながら10.3バージョンは下記の詳細にあるように部分的にこの問題に取り組んでいます。

source: The <literal>varargs</literal> Issue
it_it: Il problema con i <literal>varargs</literal>
ja_jp: <literal>varargs</literal>の問題

source: The basic explanation of the issue is that the Weblogic EJB compiler mistakes methods that use <literal>varargs</literal> as having the <literal>transient</literal> modifier. When BEA generates its own stub class from those classes during deployment it fails and the deployment does not succeed. Seam uses variable arguments in one of its internal EJB's ( <literal>TimerServiceDispatcher</literal>). If you see exceptions like below during deployment you are running an unpatched version of 10.0.MP1.
it_it: La spiegazione base del problema è che il compilatore EJB di Weblogic confonde i metodi che usano <literal>varargs</literal> con i metodi col modificatore <literal>transient</literal>. Quando BEA genera le proprie classi stub da quelle classi durante il deploy, esso non ha successo. Seam usa argomenti variabili in uno dei suoi EJB interni ( <literal>TimerServiceDispatcher</literal>). Se durante il deply si vedono eccezioni come quella riportata sotto, la versione corrente è la 10.0.MP1 senza patch.
ja_jp: 問題の基本は、WeblogicのEJBコンパイラが<literal>transient</literal>修飾子を持っている<literal>varargs</literal>を使用しているメソッドについて過ちを犯していると説明できます。BEAがデプロイ中にそれらのクラスから独自のスタブクラスを作成すると、それは失敗し、デプロイは成功しません。SeamはEJB( <literal>TimerServiceDispatcher</literal>)の内部では可変引数を使用しています。デプロイ中に下記のような例外を発見した場合は、10.0.MP1のパッチされていないバージョンを起動しています。

source: This issue has been fixed in Weblogic 10.3, and BEA has created a patch for Weblogic 10.0.MP1 ( <literal>CR327275</literal> ) for this issue that can be requested from their support.
it_it: Questo problema è stato risolto con Weblogic 10.3 e BEA ha rilasciato una patch per Weblogic 10.0.MP1 ( <literal>CR327275</literal> ) che può essere richiesta al loro supporto.
ja_jp: この問題は、Weblogic 10.3では解決されました。また、BEAはこの問題に対するパッチをWeblogic 10.0.MP1用に作成しました( <literal>CR327275</literal> )。このパッチはBEAのサポートから取得可能です。

source: Unfortunately a second issue has been reported and verified by BEA.
it_it: Purtroppo BEA ha verificato e annunciato un secondo problema.
ja_jp: 残念ながら次の問題がBEAから報告され検証されました。

source: Missing EJB Methods Issue
it_it: Il problema dei metodi EJB mancanti
ja_jp: 見逃しているEJBメソッドの問題

source: This issue was only found once the <literal>CR327275</literal> patch had been applied to 10.0.MP1. This new issue has been confirmed by BEA and they created a patch for 10.0.MP1 that addresses this issue. This patch has been referred to as both <literal>CR370259</literal> and <literal>CR363182</literal>. As with the other patch this can be requested through the BEA support.
it_it: Questo problema è comparso una volta applicata la patch <literal>CR327275</literal> alla 10.0.MP1. Questo nuovo errore è stato confermato da BEA che ha creato una patch apposita per la 10.0.MP1. Questa patch viene identificata sia come <literal>CR370259</literal> che come <literal>CR363182</literal>. Come l'altra, anche questa può essere richiesta al supporto BEA.
ja_jp: この問題は10.0.MP1に摘要された<literal>CR327275</literal>パッチの中で一度だけ発見されました。この新しい問題はBEAによって確認され、BEAは10.0.MP1用にこの問題に対するパッチを作成しました。このパッチについては、<literal>CR370259</literal>と<literal>CR363182</literal>の両方を参照してください。他のパッチと同じようにこのパッチはBEAのサポートから取得可能です。

source: This issue causes certain EJB methods to be incorrectly left out of Weblogic's generated internal stub classes. This results in the following error messages during deployment.
it_it: Questo difetto fa in modo che certi metodi EJB erroneamente non vengano inseriti nelle classi stub interne di Weblogic. Questo da luogo ai seguenti messaggi di errore durante il deploy.
ja_jp: この問題はWeblogicが内部的に生成したスタブクラスが不適切に残したEJBのあるメソッドが原因なのです。この結果、次のエラーメッセージがデプロイ中に表示されます。

source: It appears that when Weblogic 10.3 was released the neglected to include this fix!! This means that Weblogic 10.0.MP1 with patches will function correctly, but 10.3 will still require the special Seam jar described below. Not all users have seen this and there may be certain combinations of OS/JRE that do not see this, however is has been seen many times. Hopefully Oracle/BEA will release an updated patch for this issue on 10.3. When they do we will update this reference guide as needed.
it_it: Sembra che, quando Weblogic 10.3 è stato rilasciato, si siano dimenticati di includere questa correzione!! Ciò significa che Weblogic 10.0.MP1 con le patch funzionerà correttamente, ma che la 10.3 richiederà ancora il jar speciale di Seam descritto sotto. Non tutti gli utenti si sono imbattuti in questo problema, e vi possono essere delle combinazioni OS/JRE in cui non si verifica, comunque è stato avvistato molte volte. Si spera che Oracle/BEA rilasceranno una patch aggiornata per questo difetto per la 10.3. Quando lo faranno aggiorneremo queste istruzioni come necessario.
ja_jp: このフィックスを含まないでWeblogic 10.3がリリースされたのでこの問題が現れました。このことはパッチされたWeblogic 10.0.MP1は正しく機能しますが、10.3は、依然として特別なSeamのjarファイルを必要とするということが以下に記述されています。すべてのユーザーがこれを見るわけではないし、たぶんあるOSとJREの組み合わせによるとこの問題を見なくてすみます。しかしながらこの問題は頻発します。10.3のこの問題についてOracle/BEAが最新のパッチをリリースすることを切に願います。そうしてくれればこのリファレンスを私たちJBossは必要に応じて最新にします。

source: So that Seam's users can deploy an EJB application to Weblogic a special Weblogic specific jar has been created, starting with Seam 2.0.2.CR2. It is located in the <literal>$SEAM/lib/interop</literal> directory and is called <literal>jboss-seam-wls-compatible.jar</literal> . The only difference between this jar and the <literal>jboss-seam.jar</literal> is that it does not contain the <literal>TimerServiceDispatcher</literal> EJB. To use this jar simply rename the <literal>jboss-seam-wls-compatible.jar</literal> to <literal>jboss-seam.jar</literal> and replace the original in your applications <literal>EAR</literal> file. The <literal>jee5/booking</literal> example demonstrates this. Obviously with this jar you will not be able to use the <literal>TimerServiceDispatcher</literal> functionality.
it_it: In modo che gli utilizzatori di Seam possano fare il deploy di un'applicazione EJB su Weblogic, a partire da Seam 2.0.2.CR2, è stato creato un jar speciale apposta per Weblogic. Si trova nella directory <literal>$SEAM/lib/interop</literal> e si chiama <literal>jboss-seam-wls-compatible.jar</literal>. L'unica differenza tra questo jar e <literal>jboss-seam.jar</literal> è che il primo non contiene l'EJB <literal>TimerServiceDispatcher</literal>. Per usarlo basta cambiarne il nome in <literal>jboss-seam.jar</literal> e sostituire il <literal>jboss-seam.jar</literal> originale nel file <literal>EAR</literal> dell'applicazione. L'esempio <literal>jee5/booking</literal> ne fornisce una dimostrazione. Ovviamente con questo jar non sarà possibile usare le funzionalità di <literal>TimerServiceDispatcher</literal>.
ja_jp: Seam 2.0.2.CR2を開始するときに、SeamのユーザーがEJBアプリケーションをWeblogicにデプロイすると、特別なWeblogicのjarファイルは作成されます。そのjarファイルの場所は<literal>$SEAM/lib/interop</literal>ディレクトリです。そのjarファイルは<literal>jboss-seam-wls-compatible.jar</literal>と呼ばれています。このjarファイルと<literal>jboss-seam.jar</literal>の唯一の違いは<literal>TimerServiceDispatcher</literal> EJBを含むか否かです。このjarファイルを使うためには単に名前を<literal>jboss-seam-wls-compatible.jar</literal>を <literal>jboss-seam.jar</literal>に変更して元のアプリケーションの中のファイルを置き換えてください。<literal>jee5/booking</literal>サンプルはこのデモンストレーションです。言うまでもなく、このjarファイルは<literal>TimerServiceDispatcher</literal>の機能を使用することはできません。

source: Getting the <literal>jee5/booking</literal> Working
it_it: Far funzionare l'esempio <literal>jee5/booking</literal>
ja_jp: <literal>jee5/booking</literal> の動作

source: In this section we will go over the steps needed to get the <literal>jee5/booking</literal> example to up and running.
it_it: In questa sezione passeremo in rassegna i passi necessari a preparare e far funzionare l'esempio <literal>jee5/booking</literal>.
ja_jp: この節では、 <literal>jee5/booking</literal>をサーバにアップし起動する手順について記述します。

source: Setting up the hsql datasource
it_it: Configurare il datasource hsql
ja_jp: hsqlのデータソースの設定

source: This example uses the in memory hypersonic database, and the correct data source needs to be set up. The admin console uses a wizard like set of pages to configure it.
it_it: Questo esempio usa il database hypersonic residente in memoria, e bisogna allestire il datasource in modo corretto. Per configurarlo la console di amministrazione si basa su un insieme di pagine in stile wizard.
ja_jp: このサンプルではメモリ内にある高速データベースを使用します。そして的確にデータソースを設定します。管理コンソールでウィザードを用いてこのページを設定してください。

source: Copy <literal>hsqldb.jar</literal> to the Weblogic domain's shared library directory: <literal> cp $SEAM_HOME/lib/hsqldb.jar $BEA_HOME/user_projects/domains/seam_examples/lib </literal>
it_it: Bisogna copiare <literal>hsqldb.jar</literal> nella directory delle librerie condivise del dominio Weblogic: <literal> cp $SEAM_HOME/lib/hsqldb.jar $BEA_HOME/user_projects/domains/seam_examples/lib </literal>
ja_jp: Weblogicドメインの共有ディレクトリに<literal>hsqldb.jar</literal>ファイルをコピーしてください。<literal> cp $SEAM_HOME/lib/hsqldb.jar $BEA_HOME/user_projects/domains/seam_examples/lib </literal>

source: Start up the server and navigate to the administration console following
it_it: Avviate il server e navigate alla console amministrativa seguendo
ja_jp: 管理コンソールの誘導にしたがってサーバを起動してください。

source: On the left side tree navigate <literal>seam_examples - Services- JDBC - Data Sources</literal>.
it_it: Nell'albero di sinistra navigate a <literal>seam_examples - Services- JDBC - Data Sources</literal>.
ja_jp: 左側のツリーにある<literal>seam_examples - Services- JDBC - Data Sources</literal>に進んでください。

source: Then select the <literal>New</literal> button at the top of the data source table
it_it: Poi selezionate il bottone <literal>New</literal> in cima alla tabella dei data source
ja_jp: データソーステーブルの一番上にある<literal>New</literal>ボタンを選択してください。

source: Fill in the following:
it_it: Compilate come segue:
ja_jp: 下記に従って入力してください。

source: Database Type and Driver: <literal>other</literal>
it_it: Database Type and Driver (Tipo di database e driver): <literal>other</literal>

source: Select <literal>Next</literal> button
it_it: Premete il pulsante <literal>Next</literal>
ja_jp: <literal>Next</literal> ボタンを選択してください。

source: Select <literal>Next</literal> button on the <literal>Transaction Options</literal> page
it_it: Cliccate il pulsante <literal>Next</literal> della pagina <literal>Transaction Options</literal>
ja_jp: <literal>Transaction Options</literal> ページにある<literal>Next</literal>ボタンを選択してください。

source: Fill in the following on the <literal>Connection Properties</literal> page:
it_it: Compilate i campi seguenti della pagina <literal>Connection Properties</literal> (Proprietà di connessione):
ja_jp: <literal>Connection Properties</literal> ページに従って入力してください。

source: Username: <literal>sa</literal> will empty password fields.
it_it: Username: <literal>sa</literal> saranno campi password vuoti.
ja_jp: Username:<literal>sa</literal> パスワードは未入力にしてください。

source: Password: leave empty.
it_it: Password: lasciare vuoto.
ja_jp: Password: 未入力

source: Leave the rest of the fields as is.
it_it: Lasciare il resto dei campi come sono.
ja_jp: 残りのフィールドはそのままにしておいてください。

source: Choose the target domain for the data source in our case the only one <literal>AdminServer</literal>. Click <literal>Next</literal>.
it_it: Scegliete il dominio di pertinenza del data source, nel nostro caso l'unico esistente <literal>AdminServer</literal>. Premete <literal>Next</literal>.
ja_jp: ただ一つの<literal>AdminServer</literal>の中にあるデータソース用に目的のドメインを選択してください。

source: Configuration and Build changes
it_it: Configurazione e modifiche alla procedura di Build
ja_jp: 設定とビルドの変更

source: OK - now we are ready to finally begin adjusting the seam application for deployment to the Weblogic server.
it_it: Bene - ora siamo finalmente pronti a cominciare a sistemare l'applicazione Seam per essere installata sul server Weblogic.
ja_jp: では、WeblogicサーバにデプロイするためにSeamアプリケーションの調整を始める最後の準備ができました。

source: Change the <literal>jta-data-source</literal> to what you entered above :
it_it: Modificate la proprietà <literal>jta-data-source</literal> in quello che avete inserito sopra:
ja_jp: <literal>jta-data-source</literal>をあなたが入力したものに変更してください。

source: Then comment out the glassfish properties.
it_it: Poi commentate le proprietà di glassfish.
ja_jp: それからglassfish（サンのオープンソース）の設定をコメントアウトします。

source: Then add these two properties for weblogic support.
it_it: Poi aggiungete queste due proprietà per il supporto di Weblogic.
ja_jp: weblogicのサポート用にこれらの二つのプロパティを追加します。

source: This file needs to be created and should contain the following:
it_it: Questo file deve essere creato e deve contenere ciò che segue:
ja_jp: 次の内容のファイルが作成される必要があります。

source: These changes do two two different things. The first element <literal>library-ref</literal> tells weblogic that this application will be using the deployed JSF libraries. The second element <literal> prefer-application-packages </literal> tells weblogic that the <literal>antlr</literal> jars take precedence. This avoids a conflict with hibernate.
it_it: Queste modifiche fanno due cose differenti. Il primo elemento <literal>library-ref</literal> dice a weblogic che questa applicazione userà le librerie JSF installate. Il secondo elemento <literal> prefer-application-packages </literal> dice a weblogic che i jar <literal>antlr</literal> hanno la precedenza. Questo evita conflitti con hibernate.
ja_jp: これらの変更は二つの異なったこと示しています。最初の要素 <literal>library-ref</literal>はweblogicがこのアプリケーションがJSFライブラリがデプロイされたものを使用しているということを示しています。次の要素 <literal> prefer-application-packages </literal> weblogicが<literal>antlr</literal>のjarファイルを優先することを示しています。これでhibernateとの競合を避けることができます。

source: The changes described here work around an issue where Weblogic is only using a single instance of the <literal>sessionBeanInterceptor</literal> for all session beans. Seam's interceptor caches and stores some component specific attributes, so when a call comes in - the interceptor is primed for a different component and an error is seen. To solve this problem you must define a separate interceptor binding for each EJB you wish to use. When you do this Weblogic will use a separate instance for each EJB.
it_it: Le modifiche qui descritte aggirano un problema per cui Weblogic usa una sola istanza di <literal>sessionBeanInterceptor</literal> per tutti i session bean. L'interceptor di Seam tiene in memoria alcuni attributi specifici del componente, così che quando arriva una chiamata - l'interceptor è predisposto per un diverso componente e compare un errore. Per risolvere questo difetto, per ogni EJB, bisogna definire una apposita associazione con un diverso interceptor (interceptor binding). Così facendo Weblogic userà un'istanza separata per ciascun EJB.
ja_jp: ここで記述した変更は、Weblogicがただ一つの<literal>sessionBeanInterceptor</literal>インスタンスをすべてのセッションBeanに対して使用している問題の箇所で動作します。Seamのインタセプタはキャッシュを行い、コンポーネント上の固有の属性を格納します。そしてそれらを呼び出したとき、そのインタセプタは違うコンポーネントで使われてエラーが起こるのです。この問題を解決するために使用しようとするそれぞれのEJBについてそのインタセプタを分ける定義をしなければなりません。これを行うとWeblogicはそれぞれのEJBに対して分割されたインスタンスを使用するでしょう。

source: Modify the <literal>assembly-descriptor</literal> element to look like this:
it_it: Bisogna modificare l'elemento <literal>assembly-descriptor</literal> in modo che appaia così:
ja_jp: <literal>assembly-descriptor</literal> 要素をこのように修正してください。

source: This file and the element <literal>library-ref</literal> tells Weblogic that this application will using the deployed JSF libraries. This is needed in both this file and the <literal> weblogic-application.xml </literal> file because both applications require access.
it_it: Questo file e l'elemento <literal>library-ref</literal> dicono a Weblogic che questa applicazione userà le librerie JSF installate. Ciò è necessario sia in questo file che che nel file <literal> weblogic-application.xml </literal> poiché entrambe le applicazioni devono accedervi.
ja_jp: このファイルにある<literal>library-ref</literal> 要素の意味は、Weblogic上で、このアプリケーションがデプロイされたJSFライブラリを使用するということです。このファイルと<literal> weblogic-application.xml </literal>ファイルは両方とも必要とされます。なぜなら両方のアプリケーションがアクセスを必要とするからです。

source: Building and Deploying the Application
it_it: Fare il build e il deploy dell'applicazione
ja_jp: アプリケーションのビルドとデプロイ

source: There are some changes needed to the build script and the <literal>jboss-seam.jar</literal> then we can deploy the app.
it_it: Bisogna fare alcune modifiche allo script di build e al jar <literal>jboss-seam.jar</literal>, poi è possibile fare il deploy dell'applicazione.
ja_jp: ビルドファイルをいくつか修正する必要があります。そうすれば、<literal>jboss-seam.jar</literal>をアプリケーションにデプロイすることができます。

source: We need to add the follow so that the <literal> weblogic-application.xml </literal> will be packaged.
it_it: Per inserire nel pacchetto <literal>weblogic-application.xml</literal> dobbiamo aggiungere ciò che segue.
ja_jp: 次に従って、<literal> weblogic-application.xml </literal>に追加する必要があります。

source: This is the change discussed above in <xref linkend="weblogic-ejb-issues"/> . There are really two options.
it_it: Questa è la modifica discussa sopra in <xref linkend="weblogic-ejb-issues"/> . In realtà ci sono due opzioni.
ja_jp: <xref linkend="weblogic-ejb-issues"/> で議論された変さらには二つの方法があります。

source: Rename this jar and replace the original <literal> $SEAM/lib/jboss-seam.jar </literal> file. This approach does not require any changes to the packaged <literal>EAR</literal> archive, but overwrites the original <literal>jboss-seam.jar</literal>
it_it: Rinominate questo e jar e sostituitelo al file originale <literal> $SEAM/lib/jboss-seam.jar </literal>. Questo approccio non richiede modifiche dell'archivio <literal>EAR</literal>, ma sovrascrive il <literal>jboss-seam.jar</literal> originale.
ja_jp: このjarファイルの名前を変更して、オリジナルの<literal> $SEAM/lib/jboss-seam.jar </literal> ファイルと置き換えてください。このアプローチはパッケージの<literal>EAR</literal>アーカイブに一切の変更を必要としませんが、オリジナルの<literal>jboss-seam.jar</literal>ファイルには変更を必要とします。

source: The other option is the modify the packaged <literal>EAR</literal> archive and replace the <literal>jboss-seam.jar</literal> in the archive manually. This leaves the original jar alone, but requires a manual step when ever the archive is packaged.
it_it: L'altra opzione consiste nel modificare l'archivio <literal>EAR</literal> e nel sostituire il file <literal>jboss-seam.jar</literal> dell'archivio manualmente. Questo lascia il jar originale intatto, ma richiede un passaggio manuale ogni volta che si crea l'archivio.
ja_jp: もう一つの方法はパッケージの<literal>EAR</literal>アーカイブを修正して <literal>jboss-seam.jar</literal>の中にあるアーカイブと手動で置き換えることです。これはオリジナルのjarファイルはそのままにしますが、アーカイブがパッケージされている場合必ず手動で置き換えることが必要となります。

source: Assuming that you choose the first option for handling the <literal>jboss-seam-wls-compatible.jar</literal> we can build the application by running <literal>ant archive</literal> at the base of the <literal>jee5/booking</literal> example directory.
it_it: Supponendo di scegliere la prima opzione per gestire il <literal>jboss-seam-wls-compatible.jar</literal> possiamo fare il build dell'applicazione lanciando <literal>ant archive</literal> nella directory di base dell'esempio <literal>jee5/booking</literal>.
ja_jp: <literal>jboss-seam-wls-compatible.jar</literal>をハンドリングするために最初の方法を選択した場合、 <literal>jee5/booking</literal>サンプルのベースディレクトリで<literal>ant archive</literal>でアプリケーションをビルドすることができます。

source: Because we chose to create our Weblogic domain in development mode we can deploy the application by putting the EAR file in the domains autodeploy directory.
it_it: Poichè si è scelto di creare il nostro dominio Weblogic in modalità sviluppo, è possibile fare il deploy dell'applicazione mettendo il file EAR nella directory degli autodeply dei domini.
ja_jp: デプロイモードでWeblogicドメインを作成することを選択したから、ドメインにある自動デプロイディレクトリにEARファイルを置くだけで、アプリケーションをデプロイできるのです。

source: Check out the application at <literal>http://localhost:7001/seam-jee5/</literal>
it_it: Verifichiamo il funzionamento dell'applicazione all'indirizzo <literal>http://localhost:7001/seam-jee5/</literal>
ja_jp: <literal>http://localhost:7001/seam-jee5/</literal>でアプリケーションをチェックアウトしてください。

source: The <literal>jpa</literal> booking example
it_it: L'esempio booking con <literal>jpa</literal>
ja_jp: <literal>jpa</literal> 予約サンプル

source: This is the Hotel Booking example implemented with Seam POJOs and Hibernate JPA and does not require EJB3 support to run. The example already has a breakout of configurations and build scripts for many of the common containers including Weblogic 10.X
it_it: Questo è l'esempio Hotel Booking implementato con i POJO di Seam con la JPA di Hibernate e non richiede il supporto EJB3 per funzionare. L'esempio ha già un insieme predisposto di configurazioni e script di build per molti dei container più comuni, incluso quelli di Weblogic 10.X
ja_jp: これは、Seam POJOとHibernate JPAで実装されたホテルの予約するアプリケーションのサンプルです。そしてこのサンプルはEJB3のサポートを起動するのに必要としません。Weblogic 10.Xを含むたくさんの共有コンテナーについて、このサンプルは既に設定ファイルやビルドファイルに登場してきました。

source: First we'll build the example for Weblogic 10.x and do the needed steps to deploy. Then we'll talk about what is different between the Weblogic versions, and with the JBoss AS version.
it_it: Innanzitutto faremo il build dell'esempio per Weblogic 10.x e completeremo i passi necessari a farne il deploy. Poi parleremo delle differenze tra le diverse versioni di Weblogic, e con la versione per JBoss.
ja_jp: 最初にサンプルをWeblogic 10.x用についてビルドます。デプロイするためにいくつかステップを踏みます。それからWeblogicのバージョンの違いについてJBoss ASと共に説明します。

source: Note that this example assumes that Weblogic's JSF libraries have been configured as described in <xref linkend="weblogic-jsf-deploy"/>.
it_it: Sinoti che questo esempio assume che le librerie JSF di Weblogic siano state configurate come descritto in <xref linkend="weblogic-jsf-deploy"/>.
ja_jp: このサンプルはWeblogicのJSFライブラリが<xref linkend="weblogic-jsf-deploy"/>で設定されていることを想定していることに注意してください。

source: Building and deploying <literal>jpa</literal> booking example
it_it: Build e deploy dell'esempio booking con <literal>jpa</literal>
ja_jp: <literal>jpa</literal> 予約サンプルのビルドとデプロイ
