Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Weblogic.po
Languages: it_it, ja_jp

source: Step one setup the datasource, step two build the app, step three deploy.
it_it: Nel primo passo si allestisce il datasource, nel secondo si fa il build dell'applicazione e nel terzo si fa il deploy.
ja_jp: 最初にデータソースを設定して、次にアプリケーションをビルドして、最後にデプロイしてくさい。

source: Setting up the datasource
it_it: Predisporre il datasource
ja_jp: データソースの設定

source: The Weblogic 10.X version of the example will use the in memory hsql database instead of the built in PointBase database. If you wish to use the PointBase database you must setup a PointBase datasource, and adjust the hibernate setting in <literal>persistence.xml</literal> to use the PointBase dialect. For reference the <literal>jpa/weblogic92</literal> example uses PointBase.
it_it: Le versioni 10.X dell'esempio useranno il database hsql residente in memoria invece del database preconfigurato PointBase. Se si vuole usare PointBase bisogna predisporre un datasource per PointBase, e sistemare l'impostazione relativa al dialetto di hibernate in <literal>persistence.xml</literal> in modo da utilizzare quello di PointBase. Come riferimento, l'esempio <literal>jpa/weblogic92</literal> usa PointBase.
ja_jp: サンプルで使用するWeblogic 10.X バージョンは、PointBaseデーターソースを使用する代わりにメモリ上のhsqlデータソースを使用します。PointBaseデーターソースを使用したい場合は、PointBaseデーターソースを設定しなければなりません。そして、<literal>persistence.xml</literal> でhibernateの設定を PointBaseを使用するように調整しなければなりません。<literal>jpa/weblogic92</literal>サンプルで、PointBaseを使用しているので参照してください。

source: Configuring the datasource is very similar to the jee5 <xref linkend="weblogic-hsql-jee5-ds"/> . Follow the steps in that section, but use the following entries where needed.
it_it: La configurazione del datasource è molto simile a quanto descritto per j2ee5 in <xref linkend="weblogic-hsql-jee5-ds"/> . Seguite i passi di quella sezione, ma usate le seguenti impostazioni dove necessario.
ja_jp: データソースの設定はjee5 <xref linkend="weblogic-hsql-jee5-ds"/>にとてもよく似ています。そのセクションの手順に従ってください、ただし必要な箇所では入力してください。

source: Building the example
it_it: Build dell'esempio
ja_jp: サンプルのビルド

source: Building it only requires running the correct ant command: <programlisting>ant weblogic10</programlisting> This will create a container specific distribution and exploded archive directories.
it_it: Il build dell'esempio richiede di lanciare il comando ant corretto: <programlisting>ant weblogic10</programlisting>. Questo creerà una distribuzione e una struttura di directory d'archivio specifici per il container.

source: Deploying the example
it_it: Deploy dell'esempio
ja_jp: サンプルのデプロイ

source: When we installed Weblogic following <xref linkend="weblogic-domain"/> we chose to have the domain in development mode. This means to deploy the application all we need to do is copy it into the autodeploy directory.
it_it: Quando Weblogic è stato installato seguendo <xref linkend="weblogic-domain"/>, abbiamo scelto di far operare il dominio in modalità sviluppo. Ciò significa che per fare il deploy basta copiare l'applicazione nella directory di autodeploy.
ja_jp: <xref linkend="weblogic-domain"/>に従ってWeblogicをインストールするときは、開発モードにあるドメインを選択します。このことは、アプリケーションをデプロイするのに、自動デプロイディレクトリにただそのアプリケーションをコピーさえすればよいことを示しています。

source: Check out the application at the following <literal>http://localhost:7001/jboss-seam-jpa/</literal> .
it_it: Verifichiamo il funzionamento all'indirizzo <literal>http://localhost:7001/jboss-seam-jpa/</literal> .
ja_jp: <literal>http://localhost:7001/jboss-seam-jpa/</literal>に従って、アプリケーションをチェックアウトしてください。

source: What's different with Weblogic 10.x
it_it: Differenze con Weblogic 10.x
ja_jp: Weblogic 10.xでの違い

source: Between the the Weblogic 10.x and 9.2 examples there are several differences:
it_it: Tra gli esempi per Weblogic 10.x e quelli per Weblogic 9.2 ci sono parecchie differenze:
ja_jp: Weblogicの10.xと9.2のサンプルの間にはいくつかの違いがあります。

source: <literal>META-INF/persistence.xml</literal> &#8212; The 9.2 version is configured to use the <literal>PointBase</literal> database and a pre-installed datasource. The 10.x version uses the <literal>hsql</literal> database and a custom datasource.
it_it: <literal>META-INF/persistence.xml</literal> &#8212; La versione 9.2 è configurata per usare il database <literal>PointBase</literal> e un datasource preinstallato. La versione 10.x usa il database <literal>hsql</literal> e un datasource personalizzato.
ja_jp: <literal>META-INF/persistence.xml</literal> &#8212; 9.2のバージョンは<literal>PointBase</literal>のデータベースを使用するように設定されていて事前にデータソースがインストールされています。10.xのバージョンは<literal>hsql</literal>のデータベースとカスタマイズしたデータソースを使用しています。

source: <literal>WEB-INF/weblogic.xml</literal> &#8212; This file and its contents solve an issue with an older version of the <literal>ANTLR</literal> libraries that Weblogic 10.x uses internally. OC4J have the same issue as well. It also configures the application to use the shared JSF libraries that were installed above.
it_it: <literal>WEB-INF/weblogic.xml</literal> &#8212; Questo file e il suo contenuto risolvono un difetto di una vecchia versione delle librerie <literal>ANTLR</literal> che Weblogic 10.x usa internamente. Anche OC4J ha lo stesso difetto. Inoltre configura l'applicazione per usare le librerie JSF condivise installate e configurate sopra.
ja_jp: <literal>WEB-INF/weblogic.xml</literal> &#8212; このファイルはWeblogic 10.xが内部で使用している<literal>ANTLR</literal>ライブラリの古いバージョンの問題を解決するためのものです。OC4J には同じような問題があります。このことはまた、上記でインストールした共有ライブラリ使用してアプリケーションを設定します。

source: This make Weblogic use classes and libraries in the web application before other libraries in the classpath. Without this change hibernate is required to use a older, slower query factory by setting the following property in the <literal>META-INF/persistence.xml</literal> file.
it_it: Questo fa sì che Weblogic usi classi e librerie dell'applicazione web prima delle classi e librerie del classpath. Senza questa modifica hibernate è costretto ad usare una query factory più vecchia e più lenta impostando la seguente proprietà del file <literal>META-INF/persistence.xml</literal>.
ja_jp: これで、Weblogicは、他のライブラリをクラスパスで使用する前にWebアプリケーションにあるクラスとライブラリを使用するようになります。この変更がないとhibernateが、<literal>META-INF/persistence.xml</literal>ファイルでのプロパティに従って設定された、古くて、遅いクエリーを使うことを要求されます。

source: <literal>WEB-INF/components.xml</literal> &#8212; In the Weblogic 10.x version JPA entity transactions is enabled by adding:
it_it: <literal>WEB-INF/components.xml</literal> &#8212; In Weblogic 10.x le transazioni JPA per gli entity vengono abilitate aggiungendo:
ja_jp: <literal>WEB-INF/components.xml</literal> &#8212; Weblogic 10.xバージョンでJPAエントリのトランザクションが次の追加によって使用可能になります。

source: <literal>WEB-INF/web.xml</literal> &#8212; Because the <literal>jsf-impl.jar</literal> is not in the <literal>WAR</literal> this listener need to be configured :
it_it: <literal>WEB-INF/web.xml</literal> &#8212; Poiché il file <literal>jsf-impl.jar</literal> non si trova nel <literal>WAR</literal> bisogna configurare questo listener:
ja_jp: <literal>WEB-INF/web.xml</literal> &#8212; <literal>jsf-impl.jar</literal>は <literal>WAR</literal>ではないので、このリスナーは設定変更する必要があります。

source: Between the Weblogic 10.x version and the JBoss version there are more changes. Here is the rundown:
it_it: Tra la versione per Weblogic 10.x e la versione per JBoss ci sono ulteriori modifiche. Eccole di seguito:
ja_jp: Weblogicの10.xバージョンとJBossのバージョンの間にはたくさんの変更があります。ここに要約があります。

source: <literal>META-INF/persistence.xml</literal> &#8212; Except for datasource name the Weblogic version sets:
it_it: <literal>META-INF/persistence.xml</literal> &#8212; Tranne che per il nome del datasource la versione Weblogic è come segue:
ja_jp: <literal>META-INF/persistence.xml</literal> &#8212; データーソース名を除いてWeblogicのバージョンを設定します。

source: <literal>WEB-INF/lib</literal> &#8212; The Weblogic version requires several library packages because they are not included as they are with JBoss AS. These are primarily for hibernate, and its dependencies.
it_it: <literal>WEB-INF/lib</literal> &#8212; La versione Weblogic richiede parecchie librerie poiché esse non sono già incluse come avviene con JBoss. Si tratta innanzitutto di quelle per hibernate e le sue dipendenze.
ja_jp: <literal>WEB-INF/lib</literal> &#8212; Weblogicのバージョンではいくつかのライブラリを必要とします。なぜならJBoss ASに含まれているそのライブラリはないからです。第一にhibernate用のもとその依存関係があります。

source: To use Hibernate as your JPA provider you need the following jars:
it_it: Per usare Hibernate come provider JPA servono i jar seguenti:
ja_jp: JPAプロバイダのようにHibernateを使うには、次のjarファイルが必要です。

source: Various third party jars that Weblogic needs:
it_it: Ecco diversi jar di terze parti di cui Weblogic ha bisogno:
ja_jp: さまざまなサードパーティのjarファイルがWeblogicでは必要です。

source: Deploying an application created using <literal>seam-gen</literal> on Weblogic 10.x
it_it: Deploy di un'applicazione creata con <literal>seam-gen</literal> su Weblogic 10.x
ja_jp: Weblogic 10.x に<literal>seam-gen</literal>を使用して作成したアプリケーションをデプロイ

source: <literal>seam-gen</literal> is a very useful tool for developers to quickly get an application up and running, and provides a foundation to add your own functionality. Out of box <literal>seam-gen</literal> will produce applications configured to run on JBoss AS. These instructions will show the steps needed to get it to run on Weblogic.
it_it: <literal>seam-gen</literal> è uno strumento molto utile agli sviluppatori per creare e far funzionare velocemente un'applicazione e fornisce le fondamenta cui aggiungere le proprie funzionalità. Di default <literal>seam-gen</literal> produrrà applicazioni configurate per essere eseguite su JBoss AS. Queste istruzioni mostreranno i passi necessari a farlo funzionare su Weblogic
ja_jp: <literal>seam-gen</literal> はとても役に立つツールです。というのも開発者がすばやくアプリケーションを立ち上げたり、そして独自の機能を追加する土台を提供してくれます。<literal>seam-gen</literal>はそのままで、JBoss ASで動作するように調整されたアプリケーションを提供します。

source: <literal>seam-gen</literal> was build for simplicity so, as you can imagine, deploying an application generated by <literal>seam-gen</literal> to Weblogic 10.x is not too hard. Basically it consists of updating or removing some configuration files, and adding dependent jars that Weblogic 10.x does not ship with.
it_it: <literal>seam-gen</literal> è stato realizzato per essere semplice così, come si può immaginare, il deploy di un'applicazione generata da <literal>seam-gen</literal> in Weblogic 10.x non è troppo difficile. Sostanzialmente consiste nell'aggiornamento o nell'eliminazione di alcuni file di configurazione e nell'aggiunta dei jar delle dipendenze di cui Weblogic 10.x non è dotata.
ja_jp: <literal>seam-gen</literal>は単純にビルドされていますので、ご想像のとおり<literal>seam-gen</literal>で生成されたアプリケーションを Weblogic 10.xにデプロイすることは簡単です。基本的にはいくつかの設定ファイルを更新したり削除したりWeblogic 10.x にはない依存ライブラリのjarファイルを追加したりします。

source: This example will cover the basic <literal>seam-gen WAR</literal> deployment. This will demonstrate Seam POJO components, Hibernate JPA, Facelets, Drools security, RichFaces, and a configurable dataSource.
it_it: Questo esempio illustrerà il deploy <literal>seam-gen WAR</literal> di base. Mostrerà i componenti POJO di Seam, la JPA di Hibernate, i Facelets, la sicurezza di Drools, le RichFaces, e un datasource configurabile.
ja_jp: このサンプルは基本的な<literal>seam-gen WAR</literal>のデプロイについて記述します。ここではSeam POJOコンポーネント、Hibernate JPA, Facelets, Drools security, RichFaces, そして設定変更可能なデータソースのデモンストレーションを行います。

source: Running <literal>seam-gen</literal> setup
it_it: Eseguire il setup di <literal>seam-gen</literal>
ja_jp: <literal>seam-gen</literal>をp起動するための設定

source: The first thing we need to do it tell <literal>seam-gen</literal> about the project we want to make. This is done by running <literal>./seam setup</literal> in the base directory of the Seam distribution. Note the paths here are my own, feel free to change for you environment.
it_it: La prima cosa da fare è dare a <literal>seam-gen</literal> le informazioni riguardanti il progetto da creare. A questo scopo occorre eseguire <literal>./seam setup</literal> nella directory di base della distribuzione di Seam. Si noti che qui i percorsi sono i nostri e devono essere liberamente adattati al vostro ambiente.
ja_jp: 最初にしなければならないことは、 作成したいプロジェクトについて<literal>seam-gen</literal>を生成することです。これはSeamディストリビューションのベースディレクトリにある<literal>./seam setup</literal>を起動することによってなされます。ここで使用しているパスは一例であり、環境に応じて変更してください。

source: Type <literal>./seam new-project</literal> to create your project and <literal>cd /home/jbalunas/workspace/weblogic_example</literal> to see the newly created project.
it_it: Digitate <literal>./seam new-project</literal> per creare il progetto e <literal>cd /home/jbalunas/workspace/weblogic_example</literal> per vedere il progetto appena creato.
ja_jp: <literal>./seam new-project</literal>と打つと、プロジェクトが作成されます。 <literal>cd /home/jbalunas/workspace/weblogic_example</literal>と打って新しいプロジェクトを参照してください。

source: What to change for Weblogic 10.X
it_it: Cosa cambiare per Weblogic 10.X
ja_jp: Weblogic 10.Xについての変更

source: First we change and delete some configuration files, then we update the libraries that are deployed with the application.
it_it: Innanzitutto bisogna modificare ed eliminare dei file di configurazione, poi bisogna aggiornare le librerie che sono installate insieme all'applicazione.
ja_jp: 最初にいくつかの設定ファイルを変更したり削除したりします。それからアプリケーションとともにデプロイされているライブラリを更新します。

source: Configuration file changes
it_it: Modiche dei file di configurazione
ja_jp: 設定ファイルの変更

source: Change the default target to <literal>archive</literal>.
it_it: Modificate il target di default in <literal>archive</literal>.
ja_jp: デフォルトのターゲットを<literal>archive</literal>に変更してください。

source: Alter the <literal>jta-data-source</literal> to be <literal>seam-gen-ds</literal> (and use this as the <literal>jndi-name</literal> when creating the data source in Weblogic's admin console)
it_it: Cambiate <literal>jta-data-source</literal> in <literal>seam-gen-ds</literal> (e usatelo come <literal>jndi-name</literal> all'atto della creazione del datasource nella console amministrativa di Weblogic)
ja_jp: <literal>jta-data-source</literal>を<literal>seam-gen-ds</literal>に変更してください（Weblogicの管理コンソールでデータソースを作成したときはこれを<literal>jndi-name</literal>として使用してください）。

source: Change the transaction type to <literal>RESOURCE_LOCAL</literal> so that we can use JPA transactions.
it_it: Modificate il tipo di transazione in <literal>RESOURCE_LOCAL</literal> in modo da poter usare le transazioni JPA.
ja_jp: JPAトランザクションを使えるように、トランザクションの型を<literal>RESOURCE_LOCAL</literal>に変更してください。

source: Add/modify the properties below for Weblogic support:
it_it: Per il supporto di Weblogic bisogna aggiungere/modificare le seguenti proprietà:
ja_jp: Weblogicをサポートするために下記のプロパティを追加／修正してください。

source: You'll need to alter <literal>persistence-prod.xml</literal> as well if you want to deploy to Weblogic using the prod profile.
it_it: Bisognerà anche aggiornare <literal>persistence-prod.xml</literal> se si vuole fare il deploy in Weblogic usando il profilo prod (profilo di produzione).
ja_jp: 本番環境用のプロファイルを使用してWeblogicにデプロイしたい場合、<literal>persistence-prod.xml</literal> を変更する必要があります。

source: You will need to create this file and populate it following <xref linkend="weblogic.xml"/>.
it_it: Bisogna creare questo file e popolarlo come in <xref linkend="weblogic.xml"/>.
ja_jp: このファイルを作成して <xref linkend="weblogic.xml"/>に従い変更する必要があるでしょう。

source: We want to use JPA transactions so we need to add the following to let Seam know.
it_it: Vogliamo usare le transazioni JPA, quindi dobbiamo aggiungere quanto segue in modo che Seam ne sia informato.
ja_jp: JPAトランザクションを使いたいので、Seamに通知するために以下を追加する必要があります。

source: You will also need to add the transaction namespace and schema location to the top of the document.
it_it: Bisogna aggiungere anche il namespace delle transazioni e la posizione dello schema in cima al documento.
ja_jp: また、トランザクションの名前空間とスキーマの場所をドキュメントの一番上に追加する必要があります。

source: You can delete this file as we aren't deploying to JBoss AS ( <literal>jboss-app.xml</literal> is used to enable classloading isolation in JBoss AS)
it_it: E' possibile eliminare questo file dal momento che non si sta per fare il deploy su JBoss AS ( <literal>jboss-app.xml</literal> è usato per abilitare l'isolamento del classloading in JBoss AS)
ja_jp: JBoss ASにデプロイするのでなければ、このファイルは削除することができます（<literal>jboss-app.xml</literal>はJBoss ASは独立してクラスロードを可能にするために使用します）。

source: You can delete these files as we aren't deploying to JBoss AS. These files define datasources in JBoss AS, in Weblogic we will use the administration console.
it_it: E' possibile eliminare questi file poiché non si sta per fare il deploy in JBoss AS. Questi file definiscono i datasource di JBoss, mentre per Weblogic useremo la console amministrativa.
ja_jp: JBoss ASにデプロイしないとき、これらのファイルを削除することができます。これらのファイルはJBoss ASでデータソースを定義するファイルであり、Weblogicでは管理コンソールを使用します。

source: Library changes
it_it: Modifiche delle librerie
ja_jp: ライブラリの変更

source: The <literal>seam-gen</literal> application has very similar library dependencies as the <literal>jpa</literal> example above. See <xref linkend="weblogic-jpa-diff"/>. Below is the changes that are needed to get them in this application.
it_it: L'applicazione <literal>seam-gen</literal> ha dipendendenze delle librerie molto simili a quelle dell'esempio <literal>jpa</literal> visto sopra. Si veda <xref linkend="weblogic-jpa-diff"/>. Sotto sono riportati i cambiamenti necessari a realizzare tali dipendenze in questa applicazione.
ja_jp: <literal>seam-gen</literal>アプリケーションは、上記の<literal>jpa</literal>サンプルと非常によく似たライブラリの依存関係を持っています。<xref linkend="weblogic-jpa-diff"/>を参照してください。下記はその依存関係を取得するためにアプリケーション内で必要になる変更です。

source: build.xml &#8212; Now we need to adjust the <literal>build.xml</literal>. Find the target <literal>war</literal> and add the following to the end of the target.
it_it: build.xml &#8212; Ora dobbiamo sistemare il file <literal>build.xml</literal>. Trovate il target <literal>war</literal> e aggiungete quanto segue in fondo al target.
ja_jp: build.xml &#8212; 今ここで<literal>build.xml</literal>を調整する必要があります。<literal>war</literal>ターゲットを見つけて、その最後に以下を追加してください。

source: Building and Deploying your application
it_it: Build e deploy dell'applicazione
ja_jp: アプリケーションのビルドとデプロイ

source: All that's left is deploying the application. This involves setting up a data source, building the app, and deploying it.
it_it: Rimane solo il deploy dell'applicazione. Questo equivale a preparare il datasource e fare il build e il deploy dell'applicazione.
ja_jp: あと残っているのはアプリケーションのデプロイです。データソースの設定を行い、アプリケーションをビルドしてデプロイしてください。

source: Setting up the data source
it_it: Allestire il datasource
ja_jp: データソースの設定

source: Configuring the datasource is very similar to the jee5 <xref linkend="weblogic-hsql-jee5-ds"/>. Except for what is listed here follow that instruction from the link.
it_it: La configurazione del datasource è molto simile a quella jee5 di <xref linkend="weblogic-hsql-jee5-ds"/>. Tranne per quanto qui indicato seguite le istruzioni del link.
ja_jp: データソースを設定は、jee5 <xref linkend="weblogic-hsql-jee5-ds"/>とほぼ同じです。ここにあるリストを除いて、リンクの指示に従ってください。

source: Building the application
it_it: Build dell'applicazione
ja_jp: アプリケーションのビルド

source: This is as easy as typing <literal>ant</literal> in the projects base directory.
it_it: Questo è facile quanto digitare <literal>ant</literal> nella directory di base dei progetti.
ja_jp: プロジェクトのベースディレクトリで、<literal>ant</literal>と打つことによって簡単にできます。

source: Check out the application at the following <literal>http://localhost:7001/weblogic_example/</literal>. .
it_it: Verificate il funzionamento dell'applicazione all'indirizzo <literal>http://localhost:7001/weblogic_example/</literal>.
ja_jp: <literal>http://localhost:7001/weblogic_example/</literal>に従ってアプリケーションをチェックアウトしてください。

source: chmod a+x server103_XX.bin
ja_jp: chmod a+x server103_XX.bin（パーミッションの変更）
