Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Webservices.po
Languages: it_it

source: An instance of <literal>customerResource</literal> is now handled by Seam when a request hits the server. This is a Seam JavaBean component that is <literal>EVENT</literal>-scoped, hence no different than the default JAX-RS lifecycle. You get full Seam injection and interception support, and all other Seam components and contexts are available to you. Currently also supported are <literal>APPLICATION</literal> and <literal>STATELESS</literal> resource Seam components. These three scopes allow you to create an effectively stateless Seam middle-tier HTTP request-processing application.
it_it: Quando una richiesta raggiunge il server, un'istanza di <literal>customerResource</literal> viene ora gestita da Seam. Si tratta di un componente JavaBean di Seam con scope <literal>EVENT</literal>, quindi in nulla diverso dal ciclo di vita del JAX-RS di default. Si ottiene il completo supporto di Seam per la bijection e tutti gli altri componenti e contesti di Seam sono disponibili. Attualmente sono supportati anche i componenti Seam che sono risorse di tipo <literal>APPLICATION</literal> e <literal>STATELESS</literal>. Questi tre scope permettono di creare un'applicazione Seam middle-tier che processa le richieste HTTP in modo stateless.

source: You can annotate an interface and keep the implementation free from JAX-RS annotations:
it_it: Si può annotare un'interfaccia e mantenere l'implementazione libera da annotazioni JAX-RS:

source: You can use <literal>SESSION</literal>-scoped Seam components. By default, the session will however be shortened to a single request. In other words, when an HTTP request is being processed by the RESTEasy integration code, an HTTP session will be created so that Seam components can utilize that context. When the request has been processed, Seam will look at the session and decide if the session was created only to serve that single request (no session identifier has been provided with the request, or no session existed for the request). If the session has been created only to serve this request, the session will be destroyed after the request!
it_it: E' possibile utilizzare componenti Seam con scope <literal>SESSION</literal>. Di default, la sessione sarà comunque ridotta ad una singola richiesta. In altre parole, mentre una richiesta HTTP viene processata dal codice di integrazione RESTEasy, viene creata una sessione HTTP in modo che i componenti Seam possano utilizzare tale contesto. Dopo che la richiesta è stata processata, Seam esamina la sessione e decide se è stata creata soltanto per servire quella singola richiesta (nessun identificatore di sessione è stato fornito con la richiesta o nessuna sessione esiste per la richiesta). Se la sessione è stata creata solo per servire la richiesta corrente, essa sarà distrutta al termine della richiesta!

source: Assuming that your Seam application only uses event, application, or stateless components, this procedure prevents exhaustion of available HTTP sessions on the server. The RESTEasy integration with Seam assumes by default that sessions are not used, hence anemic sessions would add up as every REST request would start a session that will only be removed when timed out.
it_it: Assumendo che l'applicazione Seam usi solo componenti evento, applicazione o stateless, questa procedura previene l'esaurimento delle sessioni HTTP sul server. L'integrazione RESTEasy di Seam assume di default che le sessioni non siano usate, poiché si aggiungerebbero sessioni anemiche all'avvio di una sessione da parte di ciascuna richiesta REST, sessione che sarà rimossa solo alla scadenza.

source: If your RESTful Seam application has to preserve session state across REST HTTP requests, disable this behavior in your configuration file:
it_it: Se l'applicazione RESTful di Seam deve preservare lo stato della sessione fra richieste HTTP REST, occorre disabilitare questo comportamento nel file di configurazione:

source: Every REST HTTP request will now create a new session that will only be removed by timeout or explicit invalidation in your code through <literal>Session.instance().invalidate()</literal>. It is your responsibility to pass a valid session identifier along with your HTTP requests, if you want to utilize the session context across requests.
it_it: Tutte le richieste HTTP RESTful creeranno ora una nuova sessione che sarà rimossa soltanto alla sua scadenza o per invalidazione esplicita da parte del codice dell'applicazione usando <literal>Session.instance().invalidate()</literal>. E' responsabilità dello sviluppatore passare un identificatore di sessione valido insieme a ciascuna richiesta HTTP, se si vuole utilizzare il contesto di sessione tra una richiesta e l'altra.

source: <literal>CONVERSATION</literal>-scoped resource components and mapping of conversations to temporary HTTP resources and paths is planned but currently not supported.
it_it: Risorse che siano componenti con scope <literal>CONVERSATION</literal> e la mappatura delle conversazioni su risorse e percorsi HTTP temporanei è nei piani ma non ancora supportato.

source: EJB Seam components are supported. Always annotate the local business interface, not the EJB implementation class, with JAX-RS annotations. The EJB has to be <literal>STATELESS</literal>.
it_it: Sono supportati i componenti EJB Seam. Si annoti sempre l'interfaccia locale di business, non la classe di implementazione EJB, con le annotazioni JAX-RS. L'EJB deve essere <literal>STATELESS</literal>.

source: Provider classes can also be Seam components, only <literal>APPLICATION</literal>-scoped provider components are supported. You can annotate the bean interface or implementation with JAX-RS annotations. EJB Seam components as providers are currently <emphasis>NOT</emphasis> supported, only POJOs!
it_it: Le classi del provider possono essere componenti Seam, vengono supportati solo i componenti provider con scope <literal>APPLICATION</literal>. Si può annotare l'interfaccia bean o l'implementazione con le annotazioni JAX-RS. I componenti EJB Seam come provider <emphasis>NON</emphasis> sono attualmente supportati, solo i POJO!

source: Securing resources
it_it: Sicurezza della risorse

source: You can enable the Seam authentication filter for HTTP Basic and Digest authentication in <literal>components.xml</literal>:
it_it: Si può abilitare il filtro di autenticazione per l'autenticazione HTTP Basic e Digest in <literal>components.xml</literal>:

source: See the Seam security chapter on how to write an authentication routine.
it_it: Si veda il capitolo sulla sicurezza di Seam per sapere come scrivere la routine di autenticazione.

source: After successful authentication, authorization rules with the common <literal>@Restrict</literal> and <literal>@PermissionCheck</literal> annotations are in effect. You can also access the client <literal>Identity</literal>, work with permission mapping, and so on. All regular Seam security features for authorization are available.
it_it: Dopo che l'autenticazione ha avuto successo, hanno effetto le regole di autorizzazione con le annotazioni <literal>@Restrict</literal> e <literal>@PermissionCheck</literal>. Si può anche accedere <literal>Identity</literal> del client, lavorare con la mappatura dei permessi, e così via. Sono disponibili tutte le caratteristiche di sicurezza di Seam per l'autorizzazione.

source: Mapping exceptions to HTTP responses
it_it: Mappare eccezioni e risposte HTTP

source: Section 3.3.4 of the JAX-RS specification defines how checked or unchecked exceptions are handled by the JAX RS implementation. In addition to using an exception mapping provider as defined by JAX-RS, the integration of RESTEasy with Seam allows you to map exceptions to HTTP response codes within Seam's <literal>pages.xml</literal> facility. If you are already using <literal>pages.xml</literal> declarations, this is easier to maintain than potentially many JAX RS exception mapper classes.
it_it: La sezione 3.3.4 delle specifiche JAX-RS definisce come le eccezioni di tipo checked o unchecked debbano essere trattate dall'implementazione JAX-RS. Oltre all'utilizzo di un provider della mappatura delle eccezioni come definito dalle JAX-RS, l'integrazione di RESTEasy con Seam permette di mappare le eccezioni con i codici di risposta HTTP all'interno del file <literal>pages.xml</literal> di Seam. Se si stanno già utilizzando dichiarazioni di <literal>pages.xml</literal>, ciò è più semplice da manutenetere delle numerose potenziali classi JAX RS di mappatura delle eccezioni.

source: Exception handling within Seam requires that the Seam filter is executed for your HTTP request. Ensure that you do filter <emphasis>all</emphasis> requests in your <literal>web.xml</literal>, not - as some Seam examples might show - a request URI pattern that doesn't cover your REST request paths. The following example intercepts <emphasis>all</emphasis> HTTP requests and enables Seam exception handling:
it_it: In Seam la gestione delle eccezioni richiede che il filtro di Seam intercetti le richieste HTTP. Assicuratevi di filtrare <emphasis>tutte</emphasis> le richieste nel file <literal>web.xml</literal>, e non - come mostrato in alcuni esempi di Seam - quelle corrispondenti ad URI di richiesta che non coprono i percorsi delle richieste REST. L'esempio seguente intercetta <emphasis>tutte</emphasis> le richieste HTTP e abilita la gestione delle eccezioni di Seam:

source: To convert the unchecked <literal>UnsupportedOperationException</literal> thrown by your resource methods to a <literal>501 Not Implemented</literal> HTTP status response, add the following to your <literal>pages.xml</literal> descriptor:
it_it: Per convertire l'eccezione unchecked <literal>UnsupportedOperationException</literal> lanciata dai metodi delle risorse nel codice di riposta HTTP <literal>501 Not Implemented</literal> , occorre aggiungere ciò che segue al descrittore <literal>pages.xml</literal>:

source: Custom or checked exceptions are handled the same:
it_it: Le eccezioni di tipo custom e di tipo checked sono gestite allo stesso modo:

source: You do not have to send an HTTP error to the client if an exception occurs. Seam allows you to map the exception as a redirect to a view of your Seam application. As this feature is typically used for human clients (web browsers) and not for REST API remote clients, you should pay extra attention to conflicting exception mappings in <literal>pages.xml</literal>.
it_it: Se si verifica un'eccezione, non è necessario inviare al client un codice di errore HTTP. Seam permette di mappare l'eccezione con la redirezione ad una vista dell'applicazione Seam . Poichè questa caratteristica è tipicamente usata per i client umani (browser web) e non per i client remoti dell'API REST, occorre prestare un'attenzione particolare a mappature di eccezioni in conflitto fra loro in <literal>pages.xml</literal>.

source: Note that the HTTP response still passes through the servlet container, so an additional mapping might apply if you have <literal>&lt;error-page&gt;</literal> mappings in your <literal>web.xml</literal> configuration. The HTTP status code would then be mapped to a rendered HTML error page with status <literal>200 OK</literal>!
it_it: Si noti che la risposta HTTP continua a passare attraverso il servlet container, così che è possibile apportare una mappatura aggiuntiva se nel file <literal>web.xml</literal> vi sono delle mappature <literal>&lt;error-page&gt;</literal>. Il codice di risposta HHTP sarebbe in questo caso mappato con una pagina HTML di errore con codice <literal>200 OK</literal>!

source: Testing resources and providers
it_it: Test delle risorse e dei provider

source: Seam includes an extended unit testing superclass that helps you in creating unit tests for a RESTful architecture. Extend the <literal>ResourceSeamTest</literal> class to emulate HTTP requests/response cycles:
it_it: Seam include una superclasse estesa per l'unit testing che agevola la creazione di test d'unità per un architettura RESTful. Si estenda la classe <literal>ResourceSeamTest</literal> per emulare i cicli richiesta/risposta HTTP:

source: This test only executes local calls, it does not communicate with the <literal>SeamResourceServlet</literal> through TCP. The mock request is passed through the Seam servlet and filters and the response is then available for test assertions. Overriding the <literal>getDefaultHeaders()</literal> method allows you to set request headers for every test method in the test class.
it_it: Questo test esegue soltanto chiamate locali, non comunica con <literal>SeamResourceServlet</literal> attraverso TCP. La richiesta mock viene passata attraverso il servlet ed i filtri Seam e la risposta è poi disponibile per asserzioni di test. L'override del metodo <literal>getDefaultHeaders()</literal> consente di impostare gli header di richiesta per ogni metodo di test nella classe di test.

source: Note that a <literal>ResourceRequest</literal> has to be executed in a <literal>@Test</literal> method or in a <literal>@BeforeMethod</literal> callback. You can and should not execute it in any other callback, such as <literal>@BeforeClass</literal>. (This is an implementation limitation we will remove in a future update.)
it_it: Si noti che <literal>ResourceRequest</literal> deve essere eseguita in un metodo <literal>@Test</literal> o in una callback <literal>@BeforeMethod</literal>. Si può, ma non si dovrebbe eseguirla in altre callback, come <literal>@BeforeClass</literal>. (Questa è una limitazione che verrà rimossa in futuro.)

source: Also note that the imported mock objects are not the same as the mock objects you use in other Seam unit tests, which are in the package <literal>org.jboss.seam.mock</literal>. The <literal>org.jboss.seam.resteasy.testfwk</literal> variations mimic real requests and responses much more closely.
it_it: Si noti anche che gli oggetti mock importati non sono gli stessi degli oggetti mock usati in altri unit test che sono nel pacchetto <literal>org.jboss.seam.mock</literal>. <literal>org.jboss.seam.resteasy.testfwk</literal> simula richieste e risposte in modo molto preciso.
