Repository: stefanotravelli/seam-2.2
Catalog: doc/Seam_Reference_Guide/*/Webservices.po
Languages: it_it

source: Web Services
it_it: Web Service

source: Seam integrates with JBossWS to allow standard JEE web services to take full advantage of Seam's contextual framework, including support for conversational web services. This chapter walks through the steps required to allow web services to run within a Seam environment.
it_it: Seam si integra con JBossWS per consentire allo standard JEE web service di sfruttrare pienamente il framework contestuale di Seam, includendo il supporto ai web service conversazionali. Questo capitolo passa in rassegna tutti i passi richiesti per consentire ai web service di funzionare in ambiente Seam.

source: Configuration and Packaging
it_it: Configurazione ed impacchettamento

source: To allow Seam to intercept web service requests so that the necessary Seam contexts can be created for the request, a special SOAP handler must be configured; <literal>org.jboss.seam.webservice.SOAPRequestHandler</literal> is a <literal>SOAPHandler</literal> implementation that does the work of managing Seam's lifecycle during the scope of a web service request.
it_it: Per consentire a Seam di intercettare le richieste web service in modo tale da creare i contesti Seam necessari per la richiesta, deve essere configurato uno speciale handler SOAP; <literal>org.jboss.seam.webservice.SOAPRequestHandler</literal> è un'implementazione <literal>SOAPHandler</literal> che esegue il lavoro di gestione del ciclo di vita di Seam durante lo scope di una richiesta web service.

source: A special configuration file, <literal>standard-jaxws-endpoint-config.xml</literal> should be placed into the <literal>META-INF</literal> directory of the <literal>jar</literal> file that contains the web service classes. This file contains the following SOAP handler configuration:
it_it: Uno speciale file di configurazione, <literal>standard-jaxws-endpoint-config.xml</literal>, deve essere collocato nella directory <literal>META-INF</literal> del file <literal>jar</literal> che contiene le classi web service. Questo file contiene la seguente configurazione handler SOAP:

source: Conversational Web Services
it_it: Web Service conversazionali

source: So how are conversations propagated between web service requests? Seam uses a SOAP header element present in both the SOAP request and response messages to carry the conversation ID from the consumer to the service, and back again. Here's an example of a web service request that contains a conversation ID:
it_it: Quindi come vengono propagate le conversazioni tra le richieste web service? Seam usa un elemento di intestazione SOAP presente in entrambi i messaggi di richiesta e di risposta SOAP per portare l'ID della conversazione dal consumatore al servizio, e viceversa. Ecco un esempio di richiesta web service che contiene un ID di conversazione:

source: As you can see in the above SOAP message, there is a <literal>conversationId</literal> element within the SOAP header that contains the conversation ID for the request, in this case <literal>2</literal>. Unfortunately, because web services may be consumed by a variety of web service clients written in a variety of languages, it is up to the developer to implement conversation ID propagation between individual web services that are intended to be used within the scope of a single conversation.
it_it: Come si può vedere nel messaggio SOAP sovrastante, dentro l'header SOAP c'è un elemento <literal>conversationId</literal> che contiene l'ID della conversazione di appartenenza della richiesta, in questo caso <literal>2</literal>. Purtroppo, poiché i web services possono essere utilizzati da una varietà di client scritti in diversi linguaggi, spetta allo sviluppatore implementare la propagazione dell'ID della conversazione tra i distinti web service che si intende usare nell'ambito di una singola conversazione.

source: An important thing to note is that the <literal>conversationId</literal> header element must be qualified with a namespace of <literal>http://www.jboss.org/seam/webservice</literal>, otherwise Seam will not be able to read the conversation ID from the request. Here's an example of a response to the above request message:
it_it: E' importante notare che l'elemento <literal>conversationId</literal> dell'header deve essere qualificato con il namespace <literal>http://www.jboss.org/seam/webservice</literal>, altrimenti Seam non sarà in grado di leggere l'ID della conversazione dalla richiesta. Ecco un esempio di una risposta al messagio della richiesta di cui sopra:

source: As you can see, the response message contains the same <literal>conversationId</literal> element as the request.
it_it: Come si può vedere, il messaggio di risposta contiene lo stesso elemento <literal>conversationId</literal> della richiesta.

source: A Recommended Strategy
it_it: Una strategia raccomandata

source: As web services must be implemented as either a stateless session bean or POJO, it is recommended that for conversational web services, the web service acts as a facade to a conversational Seam component.
it_it: Dal momento che i web service devono essere implementati come stateless session bean oppure come POJO, per web service conversazionali si raccomanda che fungano da facade ad un componente Seam conversazionale.

source: If the web service is written as a stateless session bean, then it is also possible to make it a Seam component by giving it a <literal>@Name</literal>. Doing this allows Seam's bijection (and other) features to be used in the web service class itself.
it_it: Se il web service è scritto come session bean stateless, allora è pure possibile farlo diventare un componente Seam dandogli un nome, <literal>@Name</literal>. Ciò abilita la bijection di Seam ed altre caratteristiche che possono essere utilizzate nella classe stessa del web service.

source: An example web service
it_it: Esempio di web service

source: Let's walk through an example web service. The code in this section all comes from the seamBay example application in Seam's <literal>/examples</literal> directory, and follows the recommended strategy as described in the previous section. Let's first take a look at the web service class and one of its web service methods:
it_it: Esaminiamo un web service di esempio. Il codice di questa sezione proviene tutto dall'applicazione di esempio seamBay nella directory <literal>/examples</literal> di Seam, e segue la strategia raccomandata nella precedente sezione. Diamo innanzitutto un'occhiata alla classe del web service e a uno dei suoi metodi esposti come web service:

source: As you can see, our web service is a stateless session bean, and is annotated using the JWS annotations from the <literal>javax.jws</literal> package, as defined by JSR-181. The <literal>@WebService</literal> annotation tells the container that this class implements a web service, and the <literal>@WebMethod</literal> annotation on the <literal>login()</literal> method identifies the method as a web service method. The <literal>name</literal> and <literal>serviceName</literal> attributes in the <literal>@WebService</literal> annotation are optional.
it_it: Come si può notare, il nostro web service è un session bean stateless, ed è annotato usando l'annotazione JWS del package <literal>javax.jws</literal>, come specificato dalla JSR-181. L'annotazione <literal>@WebService</literal> comunica al container che questa classe implementa un web service, e l'annotazione <literal>@WebMethod</literal> sul metodo <literal>login()</literal> lo identifica come metodo di tipo web service. Gli attributi <literal>name</literal> e <literal>serviceName</literal> dell'annotazione <literal>@WebService</literal> sono opzionali.

source: As is required by the specification, each method that is to be exposed as a web service method must also be declared in the remote interface of the web service class (when the web service is a stateless session bean). In the above example, the <literal>AuctionServiceRemote</literal> interface must declare the <literal>login()</literal> method as it is annotated as a <literal>@WebMethod</literal>.
it_it: Come richiesto dalle specifiche, ogni metodo che deve essere esposto come web service deve essere dichiarato anche nell'interfaccia remota della classe del web service (quando il web service è un session bean stateless). Nell'esempio suddetto, l'interfaccia <literal>AuctionServiceRemote</literal> deve dichiarare il metodo <literal>login()</literal> poiché esso è annotato come <literal>@WebMethod</literal>.

source: As you can see in the above code, the web service implements a <literal>login()</literal> method that delegates to Seam's built-in <literal>Identity</literal> component. In keeping with our recommended strategy, the web service is written as a simple facade, passing off the real work to a Seam component. This allows for the greatest reuse of business logic between web services and other clients.
it_it: Come si può notare nel codice sovrastante, il web service implementa un metodo <literal>login()</literal> che delega l'esecuzione al componente <literal>Identity</literal> di Seam. Attenendoci alla strategia da noi raccomandata, il web service è scritto come un semplice facade, che inoltra il lavoro vero e proprio ad un componente Seam. Questo permette il massimo riutilizzo di business logic tra web service e altri clients.

source: Let's look at another example. This web service method begins a new conversation by delegating to the <literal>AuctionAction.createAuction()</literal> method:
it_it: Vediamo un altro esempio. Questo metodo web service inizia una nuova conversazione delelgando l'esecuzione al metodo <literal>AuctionAction.createAuction()</literal>:

source: And here's the code from <literal>AuctionAction</literal>:
it_it: Ed ecco il codice di <literal>AuctionAction</literal>:

source: From this we can see how web services can participate in long running conversations, by acting as a facade and delegating the real work to a conversational Seam component.
it_it: Da ciò si può notare come i web service possano partecipare a conversazioni long running, svolgendo il ruolo di facade e delegando il vero lavoro a un componente Seam conversazionale.

source: RESTful HTTP webservices with RESTEasy
it_it: Webservice RESTful HTTP con RESTEasy

source: Seam integrates the RESTEasy implementation of the JAX-RS specification (JSR 311). You can decide how "deep" the integration into your Seam application is going to be:
it_it: Seam integra l'implementazone RESTEasy delle specifiche JAX-RS (JSR 311). E' possibile decidere quanto l'integrazione alla vostra applicazione debba spingersi in profondità:

source: Seamless integration of RESTEasy bootstrap and configuration, automatic detection of resources and providers.
it_it: Integrazione trasparente della configurazione e del bootstrap RESTEasy, rilevamento automatico di risorse e providers.

source: Serving HTTP/REST requests with the SeamResourceServlet, no external servlet or configuration in web.xml required.
it_it: Gestione di richieste HTTP/REST con SeamResourceServlet, senza richiedere alcuna configurazione del servlet esterna o nel file web.xml.

source: Writing resources as Seam components, with full Seam lifecycle management and interception (bijection).
it_it: Scrivere risorse come componenti Seam, con gestione completa del ciclo di vita e della interception (biJection) di Seam.

source: RESTEasy configuration and request serving
it_it: Configurazione RESTEasy e gestione delle richieste

source: First, get the RESTEasy libraries and the <literal>jaxrs-api.jar</literal>, deploy them with the other libraries of your application. Also deploy the integration library, <literal>jboss-seam-resteasy.jar</literal>.
it_it: Innanzitutto, si prendano le librerie RESTEasy e <literal>jaxrs-api.jar</literal>, e le si installi con le altre librerie della vostra applicazione. Si installi anche la libreria di integrazione, <literal>jboss-seam-resteasy.jar</literal>.

source: On startup, all classes annotated <literal>@javax.ws.rs.Path</literal> will be discovered automatically and registered as HTTP resources. Seam automatically accepts and serves HTTP requests with its built-in <literal>SeamResourceServlet</literal>. The URI of a resource is build as follows:
it_it: All'avvio, saranno automaticamente individuate e registrate come risorse HTTP tutte le classi annotate con <literal>@javax.ws.rs.Path</literal>. Seam accetta e gestisce automaticamente richieste HTTP col proprio componente <literal>SeamResourceServlet</literal>. L'URI di una risorsa è costruito come segue:

source: The URI starts with the pattern mapped in <literal>web.xml</literal> for the <literal>SeamResourceServlet</literal>, e.g <literal>/seam/resource</literal> if you follow the common examples. Change this setting to expose your RESTful resources under a different base. Note that this is a global change and other Seam resources (e.g. <literal>s:graphicImage</literal>) are then also served under that base path.
it_it: L'URI inizia con il pattern mappato in <literal>web.xml</literal> per il servlet <literal>SeamResourceServlet</literal>, ad esempio <literal>/seam/resource</literal>, se si seguono gli esempi comuni. Modificate questa impostazione per esporre le risorse RESTful con un diverso percorso di base. Si noti che questo cambiamento è globale e anche altre risorse Seam (ad esempio <literal>s:graphicImage</literal>) saranno servite sotto questo percorso di base.

source: The RESTEasy integration for Seam then appends a configurable string to the base path, by default this is <literal>/rest</literal>. Hence, the full base path of your resources would e.g. be <literal>/seam/resource/rest</literal>. We recommend that you change this string in your application, you could for example add a version number to prepare for a future REST API upgrade of your services (old clients would keep the old URI base): <literal>/seam/resource/restv1</literal>.
it_it: L'integratzione RESTEasy di Seam appende allora una stringa configurabile al percorso base, di default <literal>/rest</literal>. Quindi, il percorso completo delle risorse sarebbe, ad esempio, <literal>/seam/resource/rest</literal>. Si raccomanda di modificare questa stringa nella vostra applicazione. Ad esempio, si potrebbe aggiungere un numero di versione per prepararsi a futuri aggiornamenti di versione delle API REST dei vostri servizi (i vecchi client manterrebbero il vecchio URI di base): <literal>/seam/resource/restv1</literal>.

source: Finally, the actual resource is available under the defined <literal>@Path</literal>, e.g. a resource mapped with <literal>@Path("/customer")</literal> would be available under <literal>/seam/resource/rest/customer</literal>.
it_it: Infine, la risorsa vera e propria è disponibile sotto il<literal>@Path</literal> definito, ad esempio una risorsa mappata con <literal>@Path("/customer")</literal> sarebbe raggiungibile sotto <literal>/seam/resource/rest/customer</literal>.

source: As an example, the following resource definition would return a plaintext representation for any GET requests using the URI <literal>http://your.hostname/seam/resource/rest/customer/123</literal>:
it_it: Come esempio, la seguente definizione di risorsa restituirebbe una rappresentazione puramente testuale for ogni richiesta GET diretta all'URI <literal>http://your.hostname/seam/resource/rest/customer/123</literal>:

source: No additional configuration is required, you do not have to edit <literal>web.xml</literal> or any other setting if these defauls are acceptable. However, you can configure RESTEasy in your Seam application. First import the <literal>resteasy</literal> namespace into your XML configuration file header:
it_it: Non è richiesta alcuna configurazione addizionale, non è necessario editare il file <literal>web.xml</literal> o nessun altra configurazione se questi valori di default sono accettabili. Comunque, è possibile procedere alla configurazione RESTEasy in un'applicazione Seam. Innanzitutto, occorre importare il namespace <literal>resteasy</literal> nell'header del file di configurazione XML:

source: You can then change the <literal>/rest</literal> prefix as mentioned earlier:
it_it: Allora è possibile modificare il prefisso <literal>/rest</literal> come accennato in precedenza:

source: The full base path to your resources is now <literal>/seam/resource/restv1/{resource}</literal> - note that your <literal>@Path</literal> definitions and mappings do NOT change. This is an application-wide switch usually used for versioning of the HTTP API.
it_it: Il percorso completo alle risorse è ora <literal>/seam/resource/restv1/{resource}</literal> - si noti che che le definizioni e le mappature di tipo path <literal>@Path</literal> NON cambiano. Questo è uno "switch" a livello di applicazione di solito usato per la gestione delle versioni delle API HTTP.

source: You can disable stripping of the base path if you'd like to map the full path in your resources:
it_it: E' possibile disabilitare il troncamento del percorso base, qualora nelle risorse si voglia mappare il percorso completo:

source: The path of a resource is now mapped with e.g. <literal>@Path("/seam/resource/rest/customer")</literal>. We do not recommend disabling this feature, as your resource class mappings are then bound to a particular deployment scenario.
it_it: Il percorso di una risorsa è ora mappato, per esempio, con <literal>@Path("/seam/resource/rest/customer")</literal>. Non è raccomandabile disabilitare questa caratteristica, poiché le mappature delle classi delle risorse risultano allora legate al particolare scenario di deploy.

source: Seam will scan your classpath for any deployed <literal>@javax.ws.rs.Path</literal> resources and any <literal>@javax.ws.rs.ext.Provider</literal> classes. You can disable scanning and configure these classes manually:
it_it: Seam scandaglierà il classpath alla ricerca delle risorsa <literal>@javax.ws.rs.Path</literal> e di ogni classe <literal>@javax.ws.rs.ext.Provider</literal>. E' possibile disabilitare la ricerca e configurare queste classi manualmente:

source: The <literal>use-built-in-providers</literal> switch enables (default) or disables the RESTEasy built-in providers. We recommend you leave them enabled, as they provide plaintext, JSON, and JAXB marshalling out of the box.
it_it: L'interruttore <literal>use-built-in-providers</literal> abilita (default) o disabilita i provider RESTEasy precostituiti. Si raccomanda di lasciarli abilitati, poiché essi forniscono automaticamente la gestione del "marshalling" testuale, JSON, e JAXB.

source: RESTEasy supports plain EJBs (EJBs that are not Seam components) as resources. Instead of configuring the JNDI names in a non-portable fashion in <literal>web.xml</literal> (see RESTEasy documentation), you can simply list the EJB implementation classes, not the business interfaces, in <literal>components.xml</literal> as shown above. Note that you have to annotate the <literal>@Local</literal> interface of the EJB with <literal>@Path</literal>, <literal>@GET</literal>, and so on - not the bean implementation class. This allows you to keep your application deployment-portable with the global Seam <literal>jndi-pattern</literal> switch on <literal>&lt;core:init/&gt;</literal>. Note that EJB resources will not be found even if scanning of resources is enabled, you always have to list them manually. Again, this is only relevant for EJB resources that are not also Seam components and that do not have a <literal>@Name</literal> annotation.
it_it: RESTEasy supporta gli EJB semplici (EJB che non sono componenti Seam) alla stregua di risorse. Invece di configurare i nomi JNDI in modo non portabile nel file<literal>web.xml</literal> (si veda la documentazione RESTEasy), è possibile elencare semplicemente le classi di implementazione degli EJB, non le interfacce di business, nel file <literal>components.xml</literal>, come mostrato sopra. Si noti che si deve annotare l'interfaccia <literal>@Local</literal> dell'EJB con <literal>@Path</literal>, <literal>@GET</literal>, e così via - non la classe di implementazionedel bean. Ciò permette di mantenere l'applicazione portabile rispetto al tipo di deploy con lo switch globale di Seam <literal>jndi-pattern</literal> su <literal>&lt;core:init/&gt;</literal>. Si noti che le risorse EJB non verrano trovate anche se la ricerca delle risorse è abilitata, bisogna sempre elencarle manualmente. Di nuovo, ciò è rilevante solo per risorse EJB che non sono anche componenti Seam e che non hanno l'annotazione <literal>@Name</literal>.

source: Finally, you can configure media type and language URI extensions:
it_it: Infine, è possibile configurare le estensioni degli URI dei tipi di media e dei linguaggi:

source: This definition would map the URI suffix of <literal>.txt.deutsch</literal> to additional <literal>Accept</literal> and <literal>Accept-Language</literal> header values <literal>text/plain</literal> and <literal>de-DE</literal>.
it_it: Questa definizione mapperebbe il suffisso dell'URI di <literal>.txt.deutsch</literal> sui valori aggiuntivi <literal>text/plain</literal> and <literal>de-DE</literal> ripettivamente degli header <literal>Accept</literal> e <literal>Accept-Language</literal>.

source: Resources and providers as Seam components
it_it: Risorse e provider come componenti Seam

source: Any resource and provider instances are managed by RESTEasy by default. That means a resource class will be instantiated by RESTEasy and serve a single request, after which it will be destroyed. This is the default JAX-RS lifecycle. Providers are instantiated once for the whole application and are effectively singletons and supposed to be stateless.
it_it: Qualunque istanza di risorsa e di provider è gestita da RESTEasy di default. Ciò significa che la classe di una risorsa sarà istanziata da RESTEasy e servirà una singola richiesta, dopo di ché sarà distrutta. I provider sono istanziati una sola volta per tutta l'applicazione e in effetti sono dei singletons che sono supposti stateless.

source: You can write resources and providers as Seam components and benefit from the richer lifecycle management of Seam, and interception for bijection, security, and so on. Simply make your resource class a Seam component:
it_it: E' possibile scrivere risorse e provider come componenti Seam e trarre beneficio dalla più ricca gestione del ciclo di vita di Seam e dall'interception, dalla bijection, dalla sicurezza e così via. Occorre semplicemente rendere la classe della risorsa un componente Seam:
